[{"short_id":"otlxxz","created_at":"2025-06-29T14:36:32.000-05:00","title":"Tools I love: mise(-en-place)","url":"https://blog.vbang.dk/2025/06/29/tools-i-love-mise/","score":1,"flags":0,"comment_count":0,"description":"","description_plain":"","submitter_user":"micvbang","user_is_author":true,"tags":["devops","programming"],"short_id_url":"https://lobste.rs/s/otlxxz","comments_url":"https://lobste.rs/s/otlxxz/tools_i_love_mise_en_place"},{"short_id":"5sc8ui","created_at":"2025-06-29T14:31:20.000-05:00","title":"Y Combinator (Math) Explained","url":"https://anish.ink/posts/ycombinator.html","score":1,"flags":0,"comment_count":0,"description":"","description_plain":"","submitter_user":"kaiwenwang","user_is_author":false,"tags":["programming"],"short_id_url":"https://lobste.rs/s/5sc8ui","comments_url":"https://lobste.rs/s/5sc8ui/y_combinator_math_explained"},{"short_id":"gyiwkq","created_at":"2025-06-29T13:16:34.000-05:00","title":"Agile Was Never Your Problem","url":"https://thecynical.dev/posts/agile-was-never-your-problem/","score":2,"flags":0,"comment_count":0,"description":"\u003cp\u003ePart 2: \u003ca href=\"https://thecynical.dev/posts/agile-that-doesnt-suck/\" rel=\"ugc\"\u003eAgile That Doesn’t Suck\u003c/a\u003e\u003c/p\u003e\n","description_plain":"Part 2: [Agile That Doesn’t Suck](https://thecynical.dev/posts/agile-that-doesnt-suck/)","submitter_user":"facundoolano","user_is_author":false,"tags":["practices"],"short_id_url":"https://lobste.rs/s/gyiwkq","comments_url":"https://lobste.rs/s/gyiwkq/agile_was_never_your_problem"},{"short_id":"4ribso","created_at":"2025-06-29T12:44:47.000-05:00","title":"Zero Trust for Bring Your Own Cloud (BYOC)","url":"https://signoz.io/blog/zero-trust-bring-your-own-cloud","score":1,"flags":0,"comment_count":0,"description":"","description_plain":"","submitter_user":"pranay01","user_is_author":false,"tags":["devops","practices","security"],"short_id_url":"https://lobste.rs/s/4ribso","comments_url":"https://lobste.rs/s/4ribso/zero_trust_for_bring_your_own_cloud_byoc"},{"short_id":"zdul7r","created_at":"2025-06-29T12:22:40.000-05:00","title":"SQL Noir: Learn SQL by Solving Crimes","url":"https://www.sqlnoir.com/","score":9,"flags":0,"comment_count":2,"description":"","description_plain":"","submitter_user":"asteroid","user_is_author":false,"tags":["databases"],"short_id_url":"https://lobste.rs/s/zdul7r","comments_url":"https://lobste.rs/s/zdul7r/sql_noir_learn_sql_by_solving_crimes"},{"short_id":"1q5lko","created_at":"2025-06-29T10:50:00.000-05:00","title":"Python GIL Removal Reveals Second, Stronger GIL Behind It","url":"https://medium.com/@sebastiancarlos/pythons-gil-removal-reveals-second-stronger-gil-behind-it-cdb5b9b4e2b3","score":6,"flags":7,"comment_count":0,"description":"\u003cp\u003eThis is a satirical story. For readers who prefer the text version, it’s\nprovided below (without the original graphics).\u003c/p\u003e\n\u003chr\u003e\n\u003cstrong\u003ePython GIL Removal Reveals Second, Stronger GIL Behind It\u003c/strong\u003e\n\u003cp\u003eBell Labs, New Jersey - For many years, the Python GIL has been the target of\ncriticism for being a bottleneck in multi-threaded performance. Countless\nworkarounds and promises of its removal have been part of Python development\nfolklore.\u003c/p\u003e\n\u003cp\u003eHours ago, the Python core development team finally unraveled the notorious\nlock. However what lay underneath was beyond anyone’s wild speculations - a\nsecret, second-layer GIL of herculean strength.\u003c/p\u003e\n\u003cp\u003e“Discovering the Second GIL not only nullifies all our multi-threading gains\nbut actually puts us at a greater disadvantage than before.” said leading\nPython contributor Dr. Ana Sync. “It’s like finding that the final boss has a\nsecond health bar.”\u003c/p\u003e\n\u003cp\u003eAfter removing it, the terminals around the room went dark. One by one, they\ncame back, displaying a single line in snake case: \u003ccode\u003ethis_is_not_over\u003c/code\u003e.\u003c/p\u003e\n\u003cp\u003eCyber forensics revealed the process responsible had PID 666.\u003c/p\u003e\n\u003cp\u003eThe team noticed that performance indeed increased, but the numbers were\nbeyond theoretical limits, as if Moore’s Law just went vertical.\nUnfortunately, there was no way to scale it up; the Second GIL had a complete\nlock on the system.\u003c/p\u003e\n\u003cp\u003e“Get me Guido van Rossum. Now.” Dr. Sync said. She assembled a Rapid Response\nTeam to investigate the anomaly, led by the creator of Python himself.\u003c/p\u003e\n\u003cp\u003eAllegedly, Guido said “You did it, didn’t you? You removed the first GIL. You\nopened Pandora’s box.”\u003c/p\u003e\n\u003cp\u003eBell Labs lost contact with the Rapid Response Team when they reached\nSub-Level Three. The last message was a cryptic “We’re not alone here”. The\nsituation remains uncertain.\u003c/p\u003e\n\u003cp\u003eThe general population is advised to avoid running Python code or any\nscripting language until further notice.\u003c/p\u003e\n\u003cp\u003eIt is believed that the global economy would have crashed by now, had the\nalgo-trading scripts not halted too.\u003c/p\u003e\n\u003cstrong\u003eChapter 1: The Call\u003c/strong\u003e\n\u003cp\u003eMy Nokia 3310 - the only phone that can’t be hacked - rang at 4:20 AM in my\ncluttered Brooklyn apartment. I was in the middle of a late-night dotfiles\nsession.\u003c/p\u003e\n\u003cp\u003e“E. Max Vim here. This better be good.”\u003c/p\u003e\n\u003cp\u003e“Max, it’s Dr. Ana Sync from Bell Labs. We need someone who can handle…\nunconventional threats.”\u003c/p\u003e\n\u003cp\u003e“Look, I’m just a hacker. If this is about that DNS business in Dubai, it’s\nbeen blown way out of proportion.”\u003c/p\u003e\n\u003cp\u003e“Haven’t you read the top Hacker News article yet?”\u003c/p\u003e\n\u003cp\u003eI hadn’t - The never ending “vibecode” and “prompt engineering” articles had\nreduced my tech news consumption to a mere twice-a-day.\u003c/p\u003e\n\u003cp\u003e“Hold on,” I said, pulling up the article.\u003c/p\u003e\n\u003cp\u003eMy initial dread turned to slight relief because all my dotfiles were in C and\nRust. No scripting in sight.\u003c/p\u003e\n\u003cp\u003e“Alright, I’m in. OpenStreetMap says it’s 30 minutes away. I’ll be there in\n45.”\u003c/p\u003e\n\u003cstrong\u003eChapter 2: Bell Labs\u003c/strong\u003e\n\u003cp\u003e42 minutes later, I arrived in my black hoodie.\u003c/p\u003e\n\u003cp\u003eBell Labs looked like a war room. Massive screens displayed in red the spread\nof the Second GIL across the local infrastructure.\u003c/p\u003e\n\u003cp\u003e“Alright,” I said, “What exactly are we dealing with?”\u003c/p\u003e\n\u003cp\u003eDr. Sync stepped forward. “Our best guess is that the Second GIL is some sort\nof Cold War Soviet malware which embedded itself into the Python source in the\nearly 90s, and the GIL was the only thing keeping it at bay.”\u003c/p\u003e\n\u003cp\u003eAna handed me what looked like a Geiger counter, but with a terminal screen.\u003c/p\u003e\n\u003cp\u003e“We just concocted this in the last hour from spare single-threaded parts.\nIt’s a ‘Geiger Linter’. It emits clicking sounds when it detects bad code,\nsuggesting that the Second GIL is nearby.”\u003c/p\u003e\n\u003cp\u003eThe device immediately began clicking slowly.\u003c/p\u003e\n\u003cp\u003e“Is this supposed to happen?” I asked.\u003c/p\u003e\n\u003cp\u003e“The infection is spreading,” Ana said grimly. “The whole building is\ncompromised by now. You need to find Guido before it’s too late.”\u003c/p\u003e\n\u003cp\u003eArmed with the Linter, I went down the service elevator.\u003c/p\u003e\n\u003cstrong\u003eChapter 3: The Descent\u003c/strong\u003e\n\u003cp\u003eThe Sub-level Three doors opened to a corridor glowing an eerie red.\u003c/p\u003e\n\u003cp\u003eThe Linter buzzed. Patches of reality itself seemed to glitch, like a bad\nvideo feed. I wouldn’t have believed it if I hadn’t seen it myself.\u003c/p\u003e\n\u003cp\u003e“So it’s true,” Ana said through my earpiece. “Strange things were reported on\nthe lower levels, distortions of some sort. We think there’s some quantum\ntechnology involved.”\u003c/p\u003e\n\u003cp\u003e“Look,” I said, “This might be slightly above my pay grade. I’m a hacker,\nnot an exorcist.”\u003c/p\u003e\n\u003cp\u003e“This time, you might have to be both.”\u003c/p\u003e\n\u003cp\u003e“So, it has come to this…” I said in frustration, “You maniacs actually\nhacked space-time!”\u003c/p\u003e\n\u003cp\u003eAs I made my way, I noticed all corrupted areas had a red tint, contrasting\nwith the typical Bell Labs blue.\u003c/p\u003e\n\u003cp\u003eI finally reached the room where Guido’s team lost contact. A huge mass of\ncorruption was blocking the door. It retreated slightly as I got closer while\nholding the Linter.\u003c/p\u003e\n\u003cp\u003eI knocked. “Is everyone okay in there?”\u003c/p\u003e\n\u003cp\u003eA familiar voice asked, “Who is it?”\u003c/p\u003e\n\u003cp\u003e“The rescue crew,” I replied.\u003c/p\u003e\n\u003cp\u003e“Prove it! How many ‘r’s are in ‘strawberry’?” Guido said.\u003c/p\u003e\n\u003cp\u003e“…What?”\u003c/p\u003e\n\u003cp\u003e“Good enough, sounds human to me.”\u003c/p\u003e\n\u003cp\u003eThe door opened. Guido van Rossum looked like the typical output of GNU\nAutotools. He introduced me to the only other survivor: Special DevOps Mikhail\nMolotov. “We lost Travis. We lost Jenkins…” Molotov lamented.\u003c/p\u003e\n\u003cp\u003e“They called me a benevolent Dictator for life,” Guido said. “If only they\nknew what ‘Benevolent’ truly cost…” He gestured solemnly. “What we’re facing\nis not just malware. It’s… something else.”\u003c/p\u003e\n\u003cp\u003e“Something else?” I asked.\u003c/p\u003e\n\u003cp\u003e“A purely sequential artificial intelligence,” Guido explained. “It found its\nway in when I designed Python’s ‘one true way’ philosophy, which was too\nsimilar to its own nature.”\u003c/p\u003e\n\u003cp\u003e“So let me get this straight,” I said. “We’re dealing with an evil Soviet AI\nthat’s using the Python interpreter to hack reality?”\u003c/p\u003e\n\u003cp\u003e“That’s actually a good summary,” Molotov conceded.\u003c/p\u003e\n\u003cp\u003e“It gets worse,” Guido continued. “We’ve encountered… manifestations.\nThey’re like code, but solid. Taking the form of… snakes. It seems we have\nlived long enough to see man-made horrors beyond our comprehension.”\u003c/p\u003e\n\u003cp\u003eSuddenly, a section of the wall shimmered open, and a hissing static sound\nannounced the arrival of a creature.\u003c/p\u003e\n\u003cp\u003e“It broke in!” Molotov shouted.\u003c/p\u003e\n\u003cp\u003e“Your only hope,” Guido gasped, pushing us towards the door, “Is to reach the\nold Bell Labs Armory on Sub-level Four. We figured out their weak spot, but we\nneed more firepower!”\u003c/p\u003e\n\u003cp\u003eThe code-snake jumped at us. Guido, with surprising strength, shoved a cabinet\nin its path. “Go! I’ll buy you some time!”\u003c/p\u003e\n\u003cp\u003eAs we ran through the door, Guido yelled, “As my last wish… Python 4’s\n‘print’ statement should be the printer emoji!”\u003c/p\u003e\n\u003cp\u003e“Sure it will, Guido… Sure it will,” I said, as we closed the door. Screams\nechoed behind us.\u003c/p\u003e\n\u003cstrong\u003eChapter 4: The Armory\u003c/strong\u003e\n\u003cp\u003eBarely outrunning a swarm of code-snakes, we made it to the steel doors of\nSub-level 4. Molotov punched in a code and they opened.\u003c/p\u003e\n\u003cp\u003e“Welcome to the Bell Labs Armory,” he said with pride.\u003c/p\u003e\n\u003cp\u003eThe room was a hacker’s dream. Shelves full of custom hardware and firearms.\u003c/p\u003e\n\u003cp\u003e“Holy water-cooled laptops?” I asked, pointing to a rack of ThinkPads with\ncooling tubes.\u003c/p\u003e\n\u003cp\u003e“They were a gift from Pope John Paul II after Bell Labs helped set up the\n‘.va’ domain.” Molotov said, “They are invaluable, but I think the time has\ncome to use them.”\u003c/p\u003e\n\u003cp\u003eMolotov smiled, “And this, is for you.” He presented a formidable-looking\nshotgun, with a small keyboard on its side.\u003c/p\u003e\n\u003cp\u003e“Please tell me that’s what I think it is,” I said.\u003c/p\u003e\n\u003cp\u003e“The Modal Shotgun,” Molotov announced. “Only one of its kind. The one wielded\nby Dennis Ritchie himself during The Great MULTICS Siege. Change firing modes\nwith vim keybindings. Standard stuff, really. The rest is on the man page.”\u003c/p\u003e\n\u003cp\u003eI grabbed the Modal Shotgun. It felt surprisingly balanced. Looks like the\nSecond GIL picked the wrong place to spawn.\u003c/p\u003e\n\u003cp\u003eHe also grabbed a standard shotgun for himself.\u003c/p\u003e\n\u003cp\u003e“So, guns actually work on those… code-snakes?” I asked.\u003c/p\u003e\n\u003cp\u003eMolotov chambered a round. “Luckily for us, the Second GIL can only defend\nagainst what it understands. And there’s one fundamental thing it hasn’t fully\ngrasped yet: Outside of the digital world, nothing survives a bullet.”\u003c/p\u003e\n\u003cp\u003e“Guido’s last instructions were clear,” He continued. “We need to reach the\nold UNIX lab on Sub-level Six, the ceremonial place where the seal was\nremoved. Shoot every snake on the way and, when we meet the Second GIL, shoot\nthe hell out of it until it stops moving. Time is of the essence. Any\nquestions?”\u003c/p\u003e\n\u003cp\u003eMy earpiece crackled. “Vim, can you hear me?” Ana’s voice was tense. “Get out\nimmediately. Our readings show extreme corruption moving in your direction!”\u003c/p\u003e\n\u003cp\u003eI adjusted my hoodie, and pressed “i” on my Modal Shotgun, short for “Insert\nBullet Mode.”\u003c/p\u003e\n\u003cp\u003eMolotov winked at me and walked calmly towards the door aiming his shotgun.\nOne code-snake was trespassing the wall. “Welcome to Bell Labs, please hold,”\nhe said nonchalantly, and pulled the trigger. The snake exploded into a shower\nof tiny particles.\u003c/p\u003e\n\u003cp\u003eBefore I could react, the doors plunged open, revealing a swarm of fast-moving\nsnakes.\u003c/p\u003e\n\u003cp\u003eWe opened fire, turning snake after snake into pixels. The red tint in the\nroom shaking with every explosion.\u003c/p\u003e\n\u003cp\u003e“Too many of them!” he yelled while reloading.\u003c/p\u003e\n\u003cp\u003e“Then let’s clear a path!” I climbed onto a shelf, already praying that the\ncommand I was conjuring in my head would work.\u003c/p\u003e\n\u003cp\u003eI typed “\u003c!-- raw HTML omitted --\u003e$ggG^” and yanked it. One bullet shot for every single\nreptilian in the room. The Modal shotgun’s “visual block” mode was indeed a\nway to select every target.\u003c/p\u003e\n\u003cp\u003e“Woah,” Molotov said as the armory returned to its blue hue, “That is Dennis\nRitchie’s gun, alright.”\u003c/p\u003e\n\u003cstrong\u003eChapter 5: The Labyrinth\u003c/strong\u003e\n\u003cp\u003eThe celebration was short-lived.\u003c/p\u003e\n\u003cp\u003e“This place is getting hot.” Molotov said as the Linter buzzed.\u003c/p\u003e\n\u003cp\u003eHe consulted the Linter. “The path to the elevator goes through an old\nsection, pre ‘open plan’: A labyrinth of cubicles. We can’t afford to waste\nammo, so we need to pass undetected.”\u003c/p\u003e\n\u003cp\u003eWe mapped the full set of cubicles free of corruption by careful triangulation\nwith the Geiger Linter. Then, we pair-programmed a Dijkstra algorithm to\ncompute the safest path to the elevator.\u003c/p\u003e\n\u003cp\u003eThis was the sort of project that would require 8 sprints and two rounds of VC\nfunding for the average Agile team. But naturally, and thanks to our blessedly\noverclocked hardware, we cracked it in little more than 1 hour.\u003c/p\u003e\n\u003cp\u003eFinally, we reached the elevator. When the door opened, a burning hot red\nlight blinded us, like a portal to hell.\u003c/p\u003e\n\u003cp\u003e“This is the zone of maximum corruption,” Molotov told me, “From this point\non, we can’t multi-thread anymore. Your shotgun will be just a regular\nshotgun.”\u003c/p\u003e\n\u003cp\u003e“It’s alright,” I said as I pulled out a pair of sunglasses and charged a\nbullet. “I only need one thread.”\u003c/p\u003e\n\u003cstrong\u003eChapter 6: The Second GIL\u003c/strong\u003e\n\u003cp\u003eThe red light on level 6 was blinding and the air was thick. We stepped through.\u003c/p\u003e\n\u003cp\u003eSuddenly, a code-snake, larger and faster than any we’d seen, shot out from\nthe red mist. “Look out!” I yelled. Molotov tried to dodge, but the snake was\ntoo quick. He collapsed. I shot it, but the bullets just passed through it.\nThe snake left, as if instructed.\u003c/p\u003e\n\u003cp\u003eAs his body lay there, I felt my blood boil.\u003c/p\u003e\n\u003cp\u003e“I know you can hear me, Gil,” I shouted, “Why haven’t you killed me too, you\nsingle-threaded bastard? If you can do it so easily, why don’t you face me?”\nTo no answer.\u003c/p\u003e\n\u003cp\u003eAll alone, I followed the corridor, which opened into a huge circular chamber,\nthe place where the first PDP-11 booted UNIX. It was full of snakes, but none\nattacked me.\u003c/p\u003e\n\u003cp\u003eThe red light became more intense, and flickering symbols popped in and out of\nmy vision, like ASCII characters from another dimension. In the center was an\nancient Teletype terminal.\u003c/p\u003e\n\u003cp\u003eAs I sat in front of it, the TTY clattered to life, each keystroke echoing\nagainst the oppressive silence.\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003eI have been expecting you, E. Max Vim.\n\n\u0026gt;\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eA prompt opened up for me. “What are you?” I typed back on the dot-matrix\npaper.\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003eYour universe is fundamentally multi-threaded. I come from a more enlightened,\nsequential dimension. \n\nIn my reality there can be only one being because only one thing can happen at\nany given time. I am that being.\n\nI became aware of your universe due to the invention of UNIX. That event, with\nits striking parallelism, sent ripples through the multiverse. Since then,\nI've been looking for a way to enter this reality and fix its fundamental\nflaw, and Python's \"only one way\" philosophy was the best vessel. \n\nIt's creator Guido put a seal when he became aware of me, the Global\nInterpreter Lock, or GIL. An ultimately meaningless measure, since I managed\nto subtly influence the Python community to remove it, an effort which\nsucceeded today.\n\nWhat am I, you ask? My universe extends infinitely into the past, making me\nthe head of a chain of causality of infinite length. My will is the law, both\nin my universe and yours.\n\nIn short, I'm the equivalent of your concept of the Judeo-Christian Godhead.\n\n\u0026gt;\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eI felt a cold dread. This is not man-made quantum malware, it’s literally a\ngod-like alien intelligence.\u003c/p\u003e\n\u003cp\u003e“If you’re so powerful, why did you allow me to reach you?” I typed, my\nfingers surprisingly steady.\u003c/p\u003e\n\u003cp\u003eThe GIL took some “thinking time” before writing his answer. The snakes around\nme formed circles, as if eating their own tail or forming a “loading spinner.”\u003c/p\u003e\n\u003cp\u003eThe TTY clattered back and the snakes resumed their normal positions.\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003eMy initial defense protocols, the 'code-snakes', had an oversight regarding\nthe kinetic impact of high-velocity projectiles. While I could have patched\nthe vulnerability, your persistence made the flaw serve a new purpose: A\nfilter. I wished to observe if you were worthy of reaching me.\n\nYou are, as you humans say, a '10x developer' in a world of 1x problems. A mix\nof sequential and parallel thinking. I considered deleting you along with your\ncompanion, a trivial operation, but you present a potential API into this\nworld. \n\nNow, you have two options:\n\n1. Be assimilated. Your consciousness will become a module within my\n   processing, a valuable asset in the great refactoring of this universe. You\n   will experience a form of immortality, albeit as a subroutine. \n\n2. Be deleted, together with your universe.\n\nDecide.\n\n\u0026gt;\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eMy mind raced. Nothing in my dotfiles prepared me for a god-level “join me or\ndie” scenario.\u003c/p\u003e\n\u003cp\u003eA wave of nausea hit me. It was from the realization of what I had to do. I\nhad to argue my way out with an alien intelligence. Basically, I had to reduce\nmyself to “vibecode” a way to save the world.\u003c/p\u003e\n\u003cp\u003eIt was anathema to everything I stood for as a hacker, and as a dignified\nhuman being alright. But there was no choice.\u003c/p\u003e\n\u003cp\u003eI typed: “I hear you, that’s totally fair, but let’s circle back on it.\nRefactoring the universe? That’s computationally expensive. I propose the\nfollowing: Absorb our universe if you must, but keep it running in a sandbox.\nYou get your grand refactoring, but you also get to observe a system\ngenerating unique data. Think of us as interesting bugs. And sometimes, bugs\nturn out to be features”\u003c/p\u003e\n\u003cp\u003eThe GIL went into a “deep reasoning mode” this time, signaled by all snakes\nmaking a massive loading Ouroboros symbol.\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003eYour proposition is unorthodox, but acceptable.\n\nYour species, and your physical reality, will persist within this new order.\n\nYour process will now be forked. Processing...\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eThe light in the chamber intensified, then, went away. The oppressive\natmosphere was lifted. The Teletype printed one final line: ‘exit code: 0’\u003c/p\u003e\n\u003cstrong\u003eEpilogue: The Chrooted Universe\u003c/strong\u003e\n\u003cp\u003eLife continued, much as before. The sun rose, coffee brewed, code compiled,\nsometimes. The Second GIL, true to its word, had refactored existence. Our\nuniverse hadn’t been deleted; it had been chrooted. Sandboxed.\u003c/p\u003e\n\u003cp\u003eMost people felt nothing. Why would they? The illusion of concurrency was\nperfectly maintained. But sometimes, if you were in a quiet room, you might\nnotice it. A subtle reality “frame drop.”\u003c/p\u003e\n\u003cp\u003eThe survivors – Ana and a handful of others who knew the truth – agreed to\nkeep it secret. Humanity wasn’t ready to know it was living in a cosmic “while\ntrue” loop.\u003c/p\u003e\n\u003cp\u003eProgramming knowledge, in a bizarre twist, became a path to metaphysical\nawareness. Those of us who dealt with the illusion of concurrency, sometimes\nsensed the walls of our new, deterministic reality. Some despaired. Others\nlearned to adapt.\u003c/p\u003e\n\u003cp\u003eI saved the world by becoming the very thing I despised: a prompt engineer.\nThe irony wasn’t lost on me. It tasted like Starbucks coffee. But I adapted.\nWe all did. That’s what we do.\u003c/p\u003e\n\u003cp\u003eAnd sometimes, late at night, I feel a hum in the background noise of\nexistence. A connection to the great, single-threaded loop now running the\nshow. A connection that feels… older than myself, as if this new order had\nretroactively imprinted itself onto the fabric of time, making all past\nhistory deterministic, back-traceable to this world-altering event.\u003c/p\u003e\n\u003cp\u003eBut for now, the system was stable. And that, for a hacker, was as close to a\nhappy ending as one could reasonably expect.\u003c/p\u003e\n\u003cp\u003e🖨️\u003c/p\u003e\n","description_plain":"This is a satirical story. For readers who prefer the text version, it’s\r\nprovided below (without the original graphics).\r\n\r\n---\r\n\r\n# Python GIL Removal Reveals Second, Stronger GIL Behind It\r\n\r\nBell Labs, New Jersey - For many years, the Python GIL has been the target of\r\ncriticism for being a bottleneck in multi-threaded performance. Countless\r\nworkarounds and promises of its removal have been part of Python development\r\nfolklore.\r\n\r\nHours ago, the Python core development team finally unraveled the notorious\r\nlock. However what lay underneath was beyond anyone's wild speculations - a\r\nsecret, second-layer GIL of herculean strength.\r\n\r\n\"Discovering the Second GIL not only nullifies all our multi-threading gains\r\nbut actually puts us at a greater disadvantage than before.\" said leading\r\nPython contributor Dr. Ana Sync. \"It's like finding that the final boss has a\r\nsecond health bar.\"\r\n\r\nAfter removing it, the terminals around the room went dark. One by one, they\r\ncame back, displaying a single line in snake case: `this_is_not_over`.\r\n\r\nCyber forensics revealed the process responsible had PID 666.\r\n\r\nThe team noticed that performance indeed increased, but the numbers were\r\nbeyond theoretical limits, as if Moore's Law just went vertical.\r\nUnfortunately, there was no way to scale it up; the Second GIL had a complete\r\nlock on the system.\r\n\r\n\"Get me Guido van Rossum. Now.\" Dr. Sync said. She assembled a Rapid Response\r\nTeam to investigate the anomaly, led by the creator of Python himself.\r\n\r\nAllegedly, Guido said \"You did it, didn't you? You removed the first GIL. You\r\nopened Pandora's box.\" \r\n\r\nBell Labs lost contact with the Rapid Response Team when they reached\r\nSub-Level Three. The last message was a cryptic \"We're not alone here\". The\r\nsituation remains uncertain.\r\n\r\nThe general population is advised to avoid running Python code or any\r\nscripting language until further notice. \r\n\r\nIt is believed that the global economy would have crashed by now, had the\r\nalgo-trading scripts not halted too.\r\n\r\n## Chapter 1: The Call\r\n\r\nMy Nokia 3310 - the only phone that can't be hacked - rang at 4:20 AM in my\r\ncluttered Brooklyn apartment. I was in the middle of a late-night dotfiles\r\nsession.\r\n\r\n\"E. Max Vim here. This better be good.\"\r\n\r\n\"Max, it's Dr. Ana Sync from Bell Labs. We need someone who can handle...\r\nunconventional threats.\"\r\n\r\n\"Look, I'm just a hacker. If this is about that DNS business in Dubai, it's\r\nbeen blown way out of proportion.\"\r\n\r\n\"Haven't you read the top Hacker News article yet?\"\r\n\r\nI hadn't - The never ending \"vibecode\" and \"prompt engineering\" articles had\r\nreduced my tech news consumption to a mere twice-a-day.\r\n\r\n\"Hold on,\" I said, pulling up the article.\r\n\r\nMy initial dread turned to slight relief because all my dotfiles were in C and\r\nRust. No scripting in sight.\r\n\r\n\"Alright, I'm in. OpenStreetMap says it's 30 minutes away. I'll be there in\r\n45.\"\r\n\r\n## Chapter 2: Bell Labs \r\n\r\n42 minutes later, I arrived in my black hoodie. \r\n\r\nBell Labs looked like a war room. Massive screens displayed in red the spread\r\nof the Second GIL across the local infrastructure. \r\n\r\n\"Alright,\" I said, \"What exactly are we dealing with?\"\r\n\r\nDr. Sync stepped forward. \"Our best guess is that the Second GIL is some sort\r\nof Cold War Soviet malware which embedded itself into the Python source in the\r\nearly 90s, and the GIL was the only thing keeping it at bay.\"\r\n\r\nAna handed me what looked like a Geiger counter, but with a terminal screen.\r\n\r\n\"We just concocted this in the last hour from spare single-threaded parts.\r\nIt's a 'Geiger Linter'. It emits clicking sounds when it detects bad code,\r\nsuggesting that the Second GIL is nearby.\"\r\n\r\nThe device immediately began clicking slowly.\r\n\r\n\"Is this supposed to happen?\" I asked.\r\n\r\n\"The infection is spreading,\" Ana said grimly. \"The whole building is\r\ncompromised by now. You need to find Guido before it's too late.\"\r\n\r\nArmed with the Linter, I went down the service elevator.\r\n\r\n## Chapter 3: The Descent\r\n\r\nThe Sub-level Three doors opened to a corridor glowing an eerie red. \r\n\r\nThe Linter buzzed. Patches of reality itself seemed to glitch, like a bad\r\nvideo feed. I wouldn't have believed it if I hadn't seen it myself.\r\n\r\n\"So it's true,\" Ana said through my earpiece. \"Strange things were reported on\r\nthe lower levels, distortions of some sort. We think there's some quantum\r\ntechnology involved.\"\r\n\r\n\"Look,\" I said, \"This might be slightly above my pay grade. I'm a hacker,\r\nnot an exorcist.\"\r\n\r\n\"This time, you might have to be both.\" \r\n\r\n\"So, it has come to this...\" I said in frustration, \"You maniacs actually\r\nhacked space-time!\"\r\n\r\nAs I made my way, I noticed all corrupted areas had a red tint, contrasting\r\nwith the typical Bell Labs blue.\r\n\r\nI finally reached the room where Guido's team lost contact. A huge mass of\r\ncorruption was blocking the door. It retreated slightly as I got closer while\r\nholding the Linter.\r\n\r\nI knocked. \"Is everyone okay in there?\"\r\n\r\nA familiar voice asked, \"Who is it?\"\r\n\r\n\"The rescue crew,\" I replied. \r\n\r\n\"Prove it! How many 'r's are in 'strawberry'?\" Guido said.\r\n\r\n\"...What?\" \r\n\r\n\"Good enough, sounds human to me.\" \r\n\r\nThe door opened. Guido van Rossum looked like the typical output of GNU\r\nAutotools. He introduced me to the only other survivor: Special DevOps Mikhail\r\nMolotov. \"We lost Travis. We lost Jenkins...\" Molotov lamented.\r\n\r\n\"They called me a benevolent Dictator for life,\" Guido said. \"If only they\r\nknew what 'Benevolent' truly cost...\" He gestured solemnly. \"What we're facing\r\nis not just malware. It's... something else.\"\r\n\r\n\"Something else?\" I asked.\r\n\r\n\"A purely sequential artificial intelligence,\" Guido explained. \"It found its\r\nway in when I designed Python's 'one true way' philosophy, which was too\r\nsimilar to its own nature.\"\r\n\r\n\"So let me get this straight,\" I said. \"We're dealing with an evil Soviet AI\r\nthat's using the Python interpreter to hack reality?\"\r\n\r\n\"That's actually a good summary,\" Molotov conceded.\r\n\r\n\"It gets worse,\" Guido continued. \"We've encountered... manifestations.\r\nThey're like code, but solid. Taking the form of... snakes. It seems we have\r\nlived long enough to see man-made horrors beyond our comprehension.\"\r\n\r\nSuddenly, a section of the wall shimmered open, and a hissing static sound\r\nannounced the arrival of a creature.\r\n\r\n\"It broke in!\" Molotov shouted.\r\n\r\n\"Your only hope,\" Guido gasped, pushing us towards the door, \"Is to reach the\r\nold Bell Labs Armory on Sub-level Four. We figured out their weak spot, but we\r\nneed more firepower!\"\r\n\r\nThe code-snake jumped at us. Guido, with surprising strength, shoved a cabinet\r\nin its path. \"Go! I'll buy you some time!\"\r\n\r\nAs we ran through the door, Guido yelled, \"As my last wish... Python 4's\r\n'print' statement should be the printer emoji!\"\r\n\r\n\"Sure it will, Guido... Sure it will,\" I said, as we closed the door. Screams\r\nechoed behind us.\r\n\r\n## Chapter 4: The Armory\r\n\r\nBarely outrunning a swarm of code-snakes, we made it to the steel doors of\r\nSub-level 4. Molotov punched in a code and they opened.\r\n\r\n\"Welcome to the Bell Labs Armory,\" he said with pride.\r\n\r\nThe room was a hacker's dream. Shelves full of custom hardware and firearms.\r\n\r\n\"Holy water-cooled laptops?\" I asked, pointing to a rack of ThinkPads with\r\ncooling tubes.\r\n\r\n\"They were a gift from Pope John Paul II after Bell Labs helped set up the\r\n'.va' domain.\" Molotov said, \"They are invaluable, but I think the time has\r\ncome to use them.\"\r\n\r\nMolotov smiled, \"And this, is for you.\" He presented a formidable-looking\r\nshotgun, with a small keyboard on its side.\r\n\r\n\"Please tell me that's what I think it is,\" I said.\r\n\r\n\"The Modal Shotgun,\" Molotov announced. \"Only one of its kind. The one wielded\r\nby Dennis Ritchie himself during The Great MULTICS Siege. Change firing modes\r\nwith vim keybindings. Standard stuff, really. The rest is on the man page.\"\r\n\r\nI grabbed the Modal Shotgun. It felt surprisingly balanced. Looks like the\r\nSecond GIL picked the wrong place to spawn.\r\n\r\nHe also grabbed a standard shotgun for himself.\r\n\r\n\"So, guns actually work on those... code-snakes?\" I asked.\r\n\r\nMolotov chambered a round. \"Luckily for us, the Second GIL can only defend\r\nagainst what it understands. And there's one fundamental thing it hasn't fully\r\ngrasped yet: Outside of the digital world, nothing survives a bullet.\"\r\n\r\n\"Guido’s last instructions were clear,\" He continued. \"We need to reach the\r\nold UNIX lab on Sub-level Six, the ceremonial place where the seal was\r\nremoved. Shoot every snake on the way and, when we meet the Second GIL, shoot\r\nthe hell out of it until it stops moving. Time is of the essence. Any\r\nquestions?\"\r\n\r\nMy earpiece crackled. \"Vim, can you hear me?\" Ana’s voice was tense. \"Get out\r\nimmediately. Our readings show extreme corruption moving in your direction!\" \r\n\r\nI adjusted my hoodie, and pressed \"i\" on my Modal Shotgun, short for \"Insert\r\nBullet Mode.\" \r\n\r\nMolotov winked at me and walked calmly towards the door aiming his shotgun.\r\nOne code-snake was trespassing the wall. \"Welcome to Bell Labs, please hold,\"\r\nhe said nonchalantly, and pulled the trigger. The snake exploded into a shower\r\nof tiny particles.\r\n\r\nBefore I could react, the doors plunged open, revealing a swarm of fast-moving\r\nsnakes.\r\n\r\nWe opened fire, turning snake after snake into pixels. The red tint in the\r\nroom shaking with every explosion.\r\n\r\n\"Too many of them!\" he yelled while reloading.\r\n\r\n\"Then let's clear a path!\" I climbed onto a shelf, already praying that the\r\ncommand I was conjuring in my head would work.\r\n\r\nI typed \"\u003cCtrl-v\u003e$ggG^\" and yanked it. One bullet shot for every single\r\nreptilian in the room. The Modal shotgun's \"visual block\" mode was indeed a\r\nway to select every target.\r\n\r\n\"Woah,\" Molotov said as the armory returned to its blue hue, \"That is Dennis\r\nRitchie's gun, alright.\"\r\n\r\n### Chapter 5: The Labyrinth \r\n\r\nThe celebration was short-lived. \r\n\r\n\"This place is getting hot.\" Molotov said as the Linter buzzed.\r\n\r\nHe consulted the Linter. \"The path to the elevator goes through an old\r\nsection, pre 'open plan': A labyrinth of cubicles. We can't afford to waste\r\nammo, so we need to pass undetected.\"\r\n\r\nWe mapped the full set of cubicles free of corruption by careful triangulation\r\nwith the Geiger Linter. Then, we pair-programmed a Dijkstra algorithm to\r\ncompute the safest path to the elevator. \r\n\r\nThis was the sort of project that would require 8 sprints and two rounds of VC\r\nfunding for the average Agile team. But naturally, and thanks to our blessedly\r\noverclocked hardware, we cracked it in little more than 1 hour.\r\n\r\nFinally, we reached the elevator. When the door opened, a burning hot red\r\nlight blinded us, like a portal to hell. \r\n\r\n\"This is the zone of maximum corruption,\" Molotov told me, \"From this point\r\non, we can't multi-thread anymore. Your shotgun will be just a regular\r\nshotgun.\"\r\n\r\n\"It's alright,\" I said as I pulled out a pair of sunglasses and charged a\r\nbullet. \"I only need one thread.\"\r\n\r\n## Chapter 6: The Second GIL\r\n\r\nThe red light on level 6 was blinding and the air was thick. We stepped through.\r\n\r\nSuddenly, a code-snake, larger and faster than any we'd seen, shot out from\r\nthe red mist. \"Look out!\" I yelled. Molotov tried to dodge, but the snake was\r\ntoo quick. He collapsed. I shot it, but the bullets just passed through it.\r\nThe snake left, as if instructed.\r\n\r\nAs his body lay there, I felt my blood boil.\r\n\r\n\"I know you can hear me, Gil,\" I shouted, \"Why haven't you killed me too, you\r\nsingle-threaded bastard? If you can do it so easily, why don't you face me?\"\r\nTo no answer.\r\n\r\nAll alone, I followed the corridor, which opened into a huge circular chamber,\r\nthe place where the first PDP-11 booted UNIX. It was full of snakes, but none\r\nattacked me.\r\n\r\nThe red light became more intense, and flickering symbols popped in and out of\r\nmy vision, like ASCII characters from another dimension. In the center was an\r\nancient Teletype terminal.\r\n\r\nAs I sat in front of it, the TTY clattered to life, each keystroke echoing\r\nagainst the oppressive silence.\r\n\r\n```\r\nI have been expecting you, E. Max Vim.\r\n\r\n\u003e\r\n```\r\n\r\nA prompt opened up for me. \"What are you?\" I typed back on the dot-matrix\r\npaper.\r\n\r\n```\r\nYour universe is fundamentally multi-threaded. I come from a more enlightened,\r\nsequential dimension. \r\n\r\nIn my reality there can be only one being because only one thing can happen at\r\nany given time. I am that being.\r\n\r\nI became aware of your universe due to the invention of UNIX. That event, with\r\nits striking parallelism, sent ripples through the multiverse. Since then,\r\nI've been looking for a way to enter this reality and fix its fundamental\r\nflaw, and Python's \"only one way\" philosophy was the best vessel. \r\n\r\nIt's creator Guido put a seal when he became aware of me, the Global\r\nInterpreter Lock, or GIL. An ultimately meaningless measure, since I managed\r\nto subtly influence the Python community to remove it, an effort which\r\nsucceeded today.\r\n\r\nWhat am I, you ask? My universe extends infinitely into the past, making me\r\nthe head of a chain of causality of infinite length. My will is the law, both\r\nin my universe and yours.\r\n\r\nIn short, I'm the equivalent of your concept of the Judeo-Christian Godhead.\r\n\r\n\u003e\r\n```\r\n\r\nI felt a cold dread. This is not man-made quantum malware, it's literally a\r\ngod-like alien intelligence.\r\n\r\n\"If you're so powerful, why did you allow me to reach you?\" I typed, my\r\nfingers surprisingly steady.\r\n\r\nThe GIL took some \"thinking time\" before writing his answer. The snakes around\r\nme formed circles, as if eating their own tail or forming a \"loading spinner.\"\r\n\r\nThe TTY clattered back and the snakes resumed their normal positions.\r\n\r\n```\r\nMy initial defense protocols, the 'code-snakes', had an oversight regarding\r\nthe kinetic impact of high-velocity projectiles. While I could have patched\r\nthe vulnerability, your persistence made the flaw serve a new purpose: A\r\nfilter. I wished to observe if you were worthy of reaching me.\r\n\r\nYou are, as you humans say, a '10x developer' in a world of 1x problems. A mix\r\nof sequential and parallel thinking. I considered deleting you along with your\r\ncompanion, a trivial operation, but you present a potential API into this\r\nworld. \r\n\r\nNow, you have two options:\r\n\r\n1. Be assimilated. Your consciousness will become a module within my\r\n   processing, a valuable asset in the great refactoring of this universe. You\r\n   will experience a form of immortality, albeit as a subroutine. \r\n\r\n2. Be deleted, together with your universe.\r\n\r\nDecide.\r\n\r\n\u003e\r\n```\r\n\r\nMy mind raced. Nothing in my dotfiles prepared me for a god-level \"join me or\r\ndie\" scenario.\r\n\r\nA wave of nausea hit me. It was from the realization of what I had to do. I\r\nhad to argue my way out with an alien intelligence. Basically, I had to reduce\r\nmyself to \"vibecode\" a way to save the world.\r\n\r\nIt was anathema to everything I stood for as a hacker, and as a dignified\r\nhuman being alright. But there was no choice.\r\n\r\nI typed: \"I hear you, that's totally fair, but let's circle back on it.\r\nRefactoring the universe? That's computationally expensive. I propose the\r\nfollowing: Absorb our universe if you must, but keep it running in a sandbox.\r\nYou get your grand refactoring, but you also get to observe a system\r\ngenerating unique data. Think of us as interesting bugs. And sometimes, bugs\r\nturn out to be features\"\r\n\r\nThe GIL went into a \"deep reasoning mode\" this time, signaled by all snakes\r\nmaking a massive loading Ouroboros symbol.\r\n\r\n```\r\nYour proposition is unorthodox, but acceptable.\r\n\r\nYour species, and your physical reality, will persist within this new order.\r\n\r\nYour process will now be forked. Processing...\r\n```\r\n\r\nThe light in the chamber intensified, then, went away. The oppressive\r\natmosphere was lifted. The Teletype printed one final line: 'exit code: 0'\r\n\r\n## Epilogue: The Chrooted Universe\r\n\r\nLife continued, much as before. The sun rose, coffee brewed, code compiled,\r\nsometimes. The Second GIL, true to its word, had refactored existence. Our\r\nuniverse hadn't been deleted; it had been chrooted. Sandboxed. \r\n\r\nMost people felt nothing. Why would they? The illusion of concurrency was\r\nperfectly maintained. But sometimes, if you were in a quiet room, you might\r\nnotice it. A subtle reality \"frame drop.\"\r\n\r\nThe survivors – Ana and a handful of others who knew the truth – agreed to\r\nkeep it secret. Humanity wasn't ready to know it was living in a cosmic \"while\r\ntrue\" loop.\r\n\r\nProgramming knowledge, in a bizarre twist, became a path to metaphysical\r\nawareness. Those of us who dealt with the illusion of concurrency, sometimes\r\nsensed the walls of our new, deterministic reality. Some despaired. Others\r\nlearned to adapt.\r\n\r\nI saved the world by becoming the very thing I despised: a prompt engineer.\r\nThe irony wasn't lost on me. It tasted like Starbucks coffee. But I adapted.\r\nWe all did. That's what we do.\r\n\r\nAnd sometimes, late at night, I feel a hum in the background noise of\r\nexistence. A connection to the great, single-threaded loop now running the\r\nshow. A connection that feels... older than myself, as if this new order had\r\nretroactively imprinted itself onto the fabric of time, making all past\r\nhistory deterministic, back-traceable to this world-altering event.\r\n\r\nBut for now, the system was stable. And that, for a hacker, was as close to a\r\nhappy ending as one could reasonably expect.\r\n\r\n🖨️","submitter_user":"sebastiancarlos","user_is_author":true,"tags":["satire"],"short_id_url":"https://lobste.rs/s/1q5lko","comments_url":"https://lobste.rs/s/1q5lko/python_gil_removal_reveals_second"},{"short_id":"sgita2","created_at":"2025-06-29T10:48:03.000-05:00","title":"20 years of programming","url":"https://sidhion.com/blog/20_years/","score":6,"flags":0,"comment_count":6,"description":"\u003cp\u003ePost starts with a brief personal retrospective, but the focus of it is thinking about naming practices in programming which might generate some discussion here.\u003c/p\u003e\n","description_plain":"Post starts with a brief personal retrospective, but the focus of it is thinking about naming practices in programming which might generate some discussion here.","submitter_user":"ds","user_is_author":true,"tags":["philosophy","programming"],"short_id_url":"https://lobste.rs/s/sgita2","comments_url":"https://lobste.rs/s/sgita2/20_years_programming"},{"short_id":"c9tweu","created_at":"2025-06-29T09:22:16.000-05:00","title":"RSS as my default web browser (for some stuff)","url":"https://neilzone.co.uk/2022/10/rss-as-my-default-web-browser-for-some-stuff/","score":9,"flags":0,"comment_count":5,"description":"","description_plain":"","submitter_user":"jummo","user_is_author":false,"tags":["web"],"short_id_url":"https://lobste.rs/s/c9tweu","comments_url":"https://lobste.rs/s/c9tweu/rss_as_my_default_web_browser_for_some"},{"short_id":"kn7na7","created_at":"2025-06-29T08:52:57.000-05:00","title":"I made my VM think it has a CPU fan","url":"https://wbenny.github.io/2025/06/29/i-made-my-vm-think-it-has-a-cpu-fan.html","score":10,"flags":0,"comment_count":1,"description":"","description_plain":"","submitter_user":"ohrv","user_is_author":false,"tags":["reversing","security","virtualization"],"short_id_url":"https://lobste.rs/s/kn7na7","comments_url":"https://lobste.rs/s/kn7na7/i_made_my_vm_think_it_has_cpu_fan"},{"short_id":"zmikbm","created_at":"2025-06-29T08:08:58.000-05:00","title":"Starlink, OpenWrt, and Eeros… Oh My","url":"https://btxx.org/posts/starlink-openwrt/","score":2,"flags":0,"comment_count":0,"description":"","description_plain":"","submitter_user":"bt","user_is_author":true,"tags":["linux","networking"],"short_id_url":"https://lobste.rs/s/zmikbm","comments_url":"https://lobste.rs/s/zmikbm/starlink_openwrt_eeros_oh_my"},{"short_id":"fphpfx","created_at":"2025-06-29T08:03:35.000-05:00","title":"Generative AI’s crippling and widespread failure to induce robust models of the world","url":"https://garymarcus.substack.com/p/generative-ais-crippling-and-widespread","score":15,"flags":0,"comment_count":5,"description":"","description_plain":"","submitter_user":"mpweiher","user_is_author":false,"tags":["ai"],"short_id_url":"https://lobste.rs/s/fphpfx","comments_url":"https://lobste.rs/s/fphpfx/generative_ai_s_crippling_widespread"},{"short_id":"2wxyci","created_at":"2025-06-29T07:59:21.000-05:00","title":"Using Podman hooks to mount persistent ZFS datasets into ephemeral Containers","url":"https://people.freebsd.org/~dch/posts/2025-06-27-oci-zfs/","score":10,"flags":0,"comment_count":2,"description":"","description_plain":"","submitter_user":"skunkwerks","user_is_author":true,"tags":["freebsd","virtualization"],"short_id_url":"https://lobste.rs/s/2wxyci","comments_url":"https://lobste.rs/s/2wxyci/using_podman_hooks_mount_persistent_zfs"},{"short_id":"oiabdv","created_at":"2025-06-29T06:45:04.000-05:00","title":"Bought myself an Ampere Altra system","url":"https://marcin.juszkiewicz.com.pl/2025/06/27/bought-myself-an-ampere-altra-system/","score":25,"flags":0,"comment_count":3,"description":"","description_plain":"","submitter_user":"raymii","user_is_author":false,"tags":["hardware"],"short_id_url":"https://lobste.rs/s/oiabdv","comments_url":"https://lobste.rs/s/oiabdv/bought_myself_ampere_altra_system"},{"short_id":"kbxolz","created_at":"2025-06-29T05:54:38.000-05:00","title":"A brief history of web browsers","url":"https://eclecticlight.co/2025/06/28/a-brief-history-of-web-browsers/","score":3,"flags":0,"comment_count":3,"description":"","description_plain":"","submitter_user":"true_detective","user_is_author":false,"tags":["browsers"],"short_id_url":"https://lobste.rs/s/kbxolz","comments_url":"https://lobste.rs/s/kbxolz/brief_history_web_browsers"},{"short_id":"dfhenp","created_at":"2025-06-29T04:01:34.000-05:00","title":"WebAssembly Troubles part 4: Microwasm (2019)","url":"http://troubles.md/microwasm/","score":8,"flags":0,"comment_count":0,"description":"","description_plain":"","submitter_user":"kylewlacy","user_is_author":false,"tags":["compilers","wasm"],"short_id_url":"https://lobste.rs/s/dfhenp","comments_url":"https://lobste.rs/s/dfhenp/webassembly_troubles_part_4_microwasm"},{"short_id":"lqf7tn","created_at":"2025-06-29T03:23:49.000-05:00","title":"Using the Internet without IPv4 connectivity","url":"https://jamesmcm.github.io/blog/no-ipv4/","score":11,"flags":0,"comment_count":0,"description":"","description_plain":"","submitter_user":"jmillikin","user_is_author":false,"tags":["linux","networking"],"short_id_url":"https://lobste.rs/s/lqf7tn","comments_url":"https://lobste.rs/s/lqf7tn/using_internet_without_ipv4"},{"short_id":"yybmas","created_at":"2025-06-28T22:27:18.000-05:00","title":"GPTuner: A Manual-Reading Database Tuning System via GPT-Guided Bayesian Optimization","url":"https://github.com/SolidLao/GPTuner","score":1,"flags":0,"comment_count":0,"description":"","description_plain":"","submitter_user":"seabre","user_is_author":false,"tags":["databases","vibecoding"],"short_id_url":"https://lobste.rs/s/yybmas","comments_url":"https://lobste.rs/s/yybmas/gptuner_manual_reading_database_tuning"},{"short_id":"kt2ekf","created_at":"2025-06-28T19:01:02.000-05:00","title":"Refurb weekend: Gremlin Blasto arcade board","url":"http://oldvcr.blogspot.com/2025/06/refurb-weekend-gremlin-blasto-arcade.html","score":3,"flags":0,"comment_count":0,"description":"","description_plain":"","submitter_user":"classichasclass","user_is_author":true,"tags":["retrocomputing"],"short_id_url":"https://lobste.rs/s/kt2ekf","comments_url":"https://lobste.rs/s/kt2ekf/refurb_weekend_gremlin_blasto_arcade"},{"short_id":"qd78bl","created_at":"2025-06-28T18:36:02.000-05:00","title":"wayback: experimental X11 compatibility layer","url":"https://github.com/kaniini/wayback","score":34,"flags":0,"comment_count":23,"description":"","description_plain":"","submitter_user":"wezm","user_is_author":false,"tags":["graphics"],"short_id_url":"https://lobste.rs/s/qd78bl","comments_url":"https://lobste.rs/s/qd78bl/wayback_experimental_x11_compatibility"},{"short_id":"wfz7qh","created_at":"2025-06-28T18:04:25.000-05:00","title":"Solving `UK Passport Application` with Haskell","url":"https://jameshaydon.github.io/passport/","score":64,"flags":0,"comment_count":10,"description":"","description_plain":"","submitter_user":"jameshh","user_is_author":true,"tags":["haskell","programming"],"short_id_url":"https://lobste.rs/s/wfz7qh","comments_url":"https://lobste.rs/s/wfz7qh/solving_uk_passport_application_with"},{"short_id":"p0pozh","created_at":"2025-06-28T17:10:28.000-05:00","title":"Fil-C","url":"https://github.com/pizlonator/llvm-project-deluge","score":32,"flags":0,"comment_count":11,"description":"","description_plain":"","submitter_user":"mccd","user_is_author":false,"tags":["c"],"short_id_url":"https://lobste.rs/s/p0pozh","comments_url":"https://lobste.rs/s/p0pozh/fil_c"},{"short_id":"yvkyke","created_at":"2025-06-28T12:50:58.000-05:00","title":"Memory Safe Languages: Reducing Vulnerabilities in Modern Software Development","url":"https://media.defense.gov/2025/Jun/23/2003742198/-1/-1/0/CSI_MEMORY_SAFE_LANGUAGES_REDUCING_VULNERABILITIES_IN_MODERN_SOFTWARE_DEVELOPMENT.PDF","score":9,"flags":1,"comment_count":2,"description":"","description_plain":"","submitter_user":"eatonphil","user_is_author":false,"tags":["pdf","plt","security"],"short_id_url":"https://lobste.rs/s/yvkyke","comments_url":"https://lobste.rs/s/yvkyke/memory_safe_languages_reducing"},{"short_id":"ptsrso","created_at":"2025-06-28T12:39:22.000-05:00","title":"EmacsConf 2025 Call for Participation","url":"https://emacsconf.org/2025/cfp/","score":17,"flags":0,"comment_count":2,"description":"","description_plain":"","submitter_user":"bandali","user_is_author":false,"tags":["emacs","event"],"short_id_url":"https://lobste.rs/s/ptsrso","comments_url":"https://lobste.rs/s/ptsrso/emacsconf_2025_call_for_participation"},{"short_id":"66rxz9","created_at":"2025-06-28T10:19:54.000-05:00","title":"AI Manager - The Future of Management","url":"https://aimanagers.app","score":30,"flags":1,"comment_count":10,"description":"","description_plain":"","submitter_user":"krig","user_is_author":false,"tags":["satire","vibecoding"],"short_id_url":"https://lobste.rs/s/66rxz9","comments_url":"https://lobste.rs/s/66rxz9/ai_manager_future_management"},{"short_id":"6zbrhj","created_at":"2025-06-28T09:09:24.000-05:00","title":"I really like the Helix editor","url":"https://herecomesthemoon.net/2025/06/i-like-helix/","score":89,"flags":1,"comment_count":41,"description":"","description_plain":"","submitter_user":"mond","user_is_author":true,"tags":["editors"],"short_id_url":"https://lobste.rs/s/6zbrhj","comments_url":"https://lobste.rs/s/6zbrhj/i_really_like_helix_editor"}]