[{"short_id":"mk6n0l","short_id_url":"https://lobste.rs/s/mk6n0l","created_at":"2025-03-29T20:55:08.000-05:00","title":"syntax highlighting with tree-sitter","url":"https://dotat.at/@/2025-03-30-hilite.html","score":2,"flags":0,"comment_count":0,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/mk6n0l/syntax_highlighting_with_tree_sitter","submitter_user":"fanf","user_is_author":true,"tags":["rust","web"]},{"short_id":"mekrcq","short_id_url":"https://lobste.rs/s/mekrcq","created_at":"2025-03-29T20:42:04.000-05:00","title":"A Programmer's Reading List: 100 Articles I Enjoyed (1-50)","url":"https://www.piglei.com/articles/en-programmer-reading-list-part-one/","score":3,"flags":1,"comment_count":0,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/mekrcq/programmer_s_reading_list_100_articles_i","submitter_user":"piglei","user_is_author":true,"tags":["programming"]},{"short_id":"4jwyfk","short_id_url":"https://lobste.rs/s/4jwyfk","created_at":"2025-03-29T18:20:36.000-05:00","title":"Self-contained Python scripts with uv","url":"http://blog.dusktreader.dev/2025/03/29/self-contained-python-scripts-with-uv/","score":5,"flags":0,"comment_count":1,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/4jwyfk/self_contained_python_scripts_with_uv","submitter_user":"Brekkjern","user_is_author":false,"tags":["linux","python"]},{"short_id":"tuxppn","short_id_url":"https://lobste.rs/s/tuxppn","created_at":"2025-03-29T15:42:24.000-05:00","title":"A web framework for building products with Python · Plain","url":"https://plainframework.com/","score":1,"flags":0,"comment_count":0,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/tuxppn/web_framework_for_building_products_with","submitter_user":"mpweiher","user_is_author":false,"tags":["python","web"]},{"short_id":"2bbkse","short_id_url":"https://lobste.rs/s/2bbkse","created_at":"2025-03-29T15:30:25.000-05:00","title":"Thoughts on ECS","url":"https://blog.voxagon.se/2025/03/28/thoughts-on-ecs.html","score":5,"flags":0,"comment_count":0,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/2bbkse/thoughts_on_ecs","submitter_user":"ngrilly","user_is_author":false,"tags":["c","c++","games","performance"]},{"short_id":"qsrt5g","short_id_url":"https://lobste.rs/s/qsrt5g","created_at":"2025-03-29T14:50:27.000-05:00","title":"The Lighthill debate on Artificial Intelligence (1973)","url":"https://www.youtube.com/watch?v=03p2CADwGF8","score":1,"flags":0,"comment_count":0,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/qsrt5g/lighthill_debate_on_artificial","submitter_user":"telnil","user_is_author":false,"tags":["ai","video"]},{"short_id":"a8t2pp","short_id_url":"https://lobste.rs/s/a8t2pp","created_at":"2025-03-29T13:45:22.000-05:00","title":"Ente Photos v1","url":"https://ente.io/blog/v1","score":26,"flags":0,"comment_count":0,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/a8t2pp/ente_photos_v1","submitter_user":"knl","user_is_author":false,"tags":["release","web"]},{"short_id":"ryacpm","short_id_url":"https://lobste.rs/s/ryacpm","created_at":"2025-03-29T12:37:57.000-05:00","title":"vramfs: VRAM based file system for Linux","url":"https://github.com/Overv/vramfs","score":11,"flags":0,"comment_count":4,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/ryacpm/vramfs_vram_based_file_system_for_linux","submitter_user":"chamlis","user_is_author":false,"tags":["linux"]},{"short_id":"lmf0ot","short_id_url":"https://lobste.rs/s/lmf0ot","created_at":"2025-03-29T12:06:30.000-05:00","title":"Horseless intelligence","url":"https://nedbatchelder.com/blog/202503/horseless_intelligence.html","score":10,"flags":0,"comment_count":7,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/lmf0ot/horseless_intelligence","submitter_user":"nedbat","user_is_author":true,"tags":["ai"]},{"short_id":"dducfq","short_id_url":"https://lobste.rs/s/dducfq","created_at":"2025-03-29T09:50:05.000-05:00","title":"I made a little puzzle game about a rogue chess knight","url":"https://rakhim.exotext.com/knight-ride-a-game-about-rogue-chess-knight","score":23,"flags":0,"comment_count":12,"description":"\u003cp\u003eThought to share this simple game I made last \u003cdel\u003ek\u003c/del\u003enight; it turned out to be pretty addictive (for me, at least). Also discovered that native HTML audio elements play with bad delay in Safari, and found people complaining about this for years. Switched to \u003ca href=\"https://createjs.com/soundjs\" rel=\"ugc\"\u003esoundjs\u003c/a\u003e and now it works fine, but does not seem to play on iOS.\u003c/p\u003e\n","description_plain":"Thought to share this simple game I made last ~~k~~night; it turned out to be pretty addictive (for me, at least). Also discovered that native HTML audio elements play with bad delay in Safari, and found people complaining about this for years. Switched to [soundjs](https://createjs.com/soundjs) and now it works fine, but does not seem to play on iOS.","comments_url":"https://lobste.rs/s/dducfq/i_made_little_puzzle_game_about_rogue","submitter_user":"freetonik","user_is_author":true,"tags":["games","show"]},{"short_id":"6ue8gr","short_id_url":"https://lobste.rs/s/6ue8gr","created_at":"2025-03-29T09:40:49.000-05:00","title":"How To Become A Hacker: A Step-By-Step Guide","url":"https://sebastiancarlos.medium.com/how-to-become-a-hacker-a-step-by-step-guide-94902dc425b0","score":12,"flags":1,"comment_count":8,"description":"\u003cp\u003eThis is a satirical hacking story. For readers who prefer the text version, it’s provided below (without the original graphics).\u003c/p\u003e\n\u003chr\u003e\n\u003cstrong\u003eTitle: How To Become A Hacker - A Step-By-Step Guide\u003c/strong\u003e\n\u003cp\u003eDNS, the Domain Name System, is the internet’s phonebook. You type google.com, DNS looks it up and tells you the actual numerical IP address, like 172.217.160.142. Simple, right?\u003c/p\u003e\n\u003cp\u003eToo simple. Vulnerable.\u003c/p\u003e\n\u003cp\u003eEnter DNSSEC (DNS SECurity Extensions). It adds digital signatures to DNS data, proving it hasn’t been tampered with. Like a wax seal on each phonebook entry. Good idea.\u003c/p\u003e\n\u003cp\u003eThe catch? The ultimate key, the KSK (Key Signing Key, or “Chaos Key”) for the internet’s root zone — the top of the pyramid — is so critical, they split it.\u003c/p\u003e\n\u003cp\u003eThey did it using one of the oldest but strongest tricks in the cryptography book, something called the “Shamir’s Secret Sharing Algorithm,” cousin of the unbreakable 19th-century “One-Time Pad.”\u003c/p\u003e\n\u003cp\u003eBasically, they broke the master key into pieces. Seven pieces, held by seven individuals scattered across the globe. To reconstruct the key, you need a quorum — five of the seven keys, gathered in a highly secure “Key Ceremony.”\u003c/p\u003e\n\u003cp\u003eThey call them Trusted Community Representatives. I call them targets.\u003c/p\u003e\n\u003cp\u003eMy mission: Liberate the internet from this centralized cabal. Return the web to its primordial, free state.\u003c/p\u003e\n\u003cp\u003eMy motivations are complex, but it’s mostly revenge.\u003c/p\u003e\n\u003cp\u003eI used to be a white-hat hacker, dreaming of elegant systems. But my proposals got shot down by the C-suite one too many times, and my projects co-opted into surveillance tools. I realized the entire structure had to be torn to the ground to build anything meaningful.\u003c/p\u003e\n\u003cp\u003eAnyway, this is my story. You might learn something.\u003c/p\u003e\n\u003cstrong\u003eStep 1: Helsinki\u003c/strong\u003e\n\u003cp\u003eFinland. Land of saunas, heavy metal, and the patron saint of freedom, Linus Torvalds himself.\u003c/p\u003e\n\u003cp\u003eMy first target: Oliver Salmiakki, a netsec professor at the University of Helsinki, where Darude shot his Sandstorm video. He was the only keyholder whose information was publicly available — a fatal flaw.\u003c/p\u003e\n\u003cp\u003eWe also have some history, Oliver and I. It involved a JavaScript conference, and his then-girlfriend who apparently found my explanation of Vim’s modal editing compelling. I was drunk, she was drunk, and frankly, nothing that happens at a JavaScript conference should be taken seriously — Oliver, however, took it very personally.\u003c/p\u003e\n\u003cp\u003eI slipped into the back of the lecture hall. Oliver was talking about quicksort. I waited for a pause, then cleared my throat.\u003c/p\u003e\n\u003cp\u003e“Professor,” I said. “quicksort is adequate for pedagogical purposes, but are we just pretending cache coherency isn’t a factor in the real world?”\u003c/p\u003e\n\u003cp\u003eKeyboards stopped clacking. Oliver froze, chalk dust settling around him like fallout. His eyes behind thick glasses locked onto mine. A flicker of recognition, then pure fury.\u003c/p\u003e\n\u003cp\u003eHe faced his students. “Class dismissed. Please ensure your commits are pushed before exiting. We appear to have encountered… legacy code.”\u003c/p\u003e\n\u003cp\u003eAs the students left, grateful for the break, Oliver fixed his tweed jacket. “E. Max Vim. How dare you soil the land of Linus Torvalds with your presence?” he hissed, pulling a custom-made shuriken shaped like the Linux penguin mascot from his coat.\u003c/p\u003e\n\u003cp\u003eWith a flick, he sent Tux flying. It wasn’t aimed at me — not yet. It embedded itself into the stereo system. The ambient track cut out, replaced by Darude’s “Sandstorm” at full volume.\u003c/p\u003e\n\u003cp\u003e“Predictable,” I sighed, pulling out two identical Nokia 3310s, one in each hand, connected by a USB cable like improvised nunchucks. Indestructible. Reliable.\u003c/p\u003e\n\u003cp\u003e“There’s ChaCha20 encryption on my key,” Oliver said. “Military grade. You won’t decrypt it.”\u003c/p\u003e\n\u003cp\u003e“I don’t want the key, Oliver,” I replied, advancing as the beat pounded. “I want to destroy it.” I swung the Nokias menacingly, “Now, let’s dance some cha-cha-cha.”\u003c/p\u003e\n\u003cp\u003eThe fight was brutal, clumsy, and punctuated by the relentless dun dun dun Eurobeat. Chairs splintered against the wall. Expensive Scandinavian vases shattered.\u003c/p\u003e\n\u003cp\u003eFinally, I cornered him against a bookshelf. A quick jab with the corner of a Nokia. His terminal emulator closed permanently. SIGKILL.\u003c/p\u003e\n\u003cp\u003eI retrieved the key shard, stored on a USB stick around his neck.\u003c/p\u003e\n\u003cp\u003eThanks to Finland’s perpetual twilight and an efficient public transport running on Erlang, my escape was clean.\u003c/p\u003e\n\u003cp\u003eBefore leaving the country, I found a traditional wooden sauna. I placed the USB stick on the hot rocks. The plastic warped, smoked, and the silicon cracked.\u003c/p\u003e\n\u003cp\u003eOne key down.\u003c/p\u003e\n\u003cstrong\u003eStep 2: Silicon Valley\u003c/strong\u003e\n\u003cpre\u003e\u003ccode\u003e$ cat ~/kill-dns-list.txt\n# Key 1\nLocation: Helsinki\nKeyholder: Oliver Salmiakki (dead)\nStatus: Destroyed\n\n# Key 2-7\nLocation: ???\nKeyholder: ???\nStatus: Secure\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eThe Helsinki hit echoed through the dark web. My handle, e-max-vim, briefly trended on some invite-only Mastodon instances.\u003c/p\u003e\n\u003cp\u003eThis notoriety led me, ironically, to the heart of the beast: Silicon Valley. Specifically, to the open-plan, cocaine-fueled office of Linktree, a company whose entire business model seemed to answer the question no one asked: “What if a tree… of links?”\u003c/p\u003e\n\u003cp\u003eTheir CEO, Zackaria “Zack” Jones, was a man whose personality was A/B tested for maximum engagement.\u003c/p\u003e\n\u003cp\u003e“Max, my man! Disruptor! Paradigm shifter!” Zack greeted me with a fist bump that felt worryingly sincere. He wore Yeezys and a t-shirt that ironically said “Decentralize Everything”. “Love your work. Big fan of chaos! Murder! We need more of that energy. Helsinki? Chef’s kiss.”\u003c/p\u003e\n\u003cp\u003eHis plan was even more megalomaniacal than mine. He didn’t just want to break DNS; he wanted to overthrow it — Replace HTTP (HyperText Transfer Protocol) with his proprietary LTTP (LinkTree Transfer Protocol). It was horrifying. It was brilliant.\u003c/p\u003e\n\u003cp\u003e“We can help each other, Max,” Zack gestured expansively. “I know the location of all remaining DNS keyholders. You take down the old guard, clear the field. I build the new guard” He saw me as the perfect tool: motivated, capable, someone primed for destruction.\u003c/p\u003e\n\u003cp\u003eIt was then that she walked in. Tall, dressed head-to-toe in black latex that squeaked with every deliberate movement. Her hair was pulled back into an architectural bun. Her cheekbones looked sharp enough to slice neutrinos. Her eyes held the cold look of someone who could DDoS a small nation.\u003c/p\u003e\n\u003cp\u003e“Natasha Volkov,” Zack introduced her. “Our Head of Risk Mitigation.”\u003c/p\u003e\n\u003cp\u003eNatasha eyed me up and down, her gaze lingering perhaps too long on the minimalist Neovim logo on my black hoodie.\u003c/p\u003e\n\u003cp\u003e“Zackaria seems to trust you,” she stated with her thick Russian accent. “I don’t.”\u003c/p\u003e\n\u003cp\u003e“Haha, priceless!” Zack said. “Gotta love that Eastern European humor.”\u003c/p\u003e\n\u003cp\u003e“Anyway!” He continued. “I’m a CEO, not a mathematician, but let’s run the numbers: Seven keyholders total. You took out one in Helsinki. Quorum requires five keys, right? So, you need to take down… two more, and the whole thing collapses.” He smiled, proud of his calculation.\u003c/p\u003e\n\u003cp\u003e“Alright, disruptor, let’s do this!” Zack continued. “Natasha, give Max the coordinates for the two closest keyholders.”\u003c/p\u003e\n\u003cstrong\u003eStep 3: Buenos Aires\u003c/strong\u003e\n\u003cpre\u003e\u003ccode\u003e$ cat ~/kill-dns-list.txt\n# Key 1\nLocation: Helsinki\nKeyholder: Oliver Salmiakki (dead)\nStatus: Destroyed\n\n# Key 2\nLocation: Buenos Aires\nKeyholder: \"Evita\" Rosales\nStatus: Secure\n\n# Key 3\nLocation: Buenos Aires\nKeyholder: \"El Pelado\" Gomez\nStatus: Secure\n\n# Key 4-7\nLocation: ???\nKeyholder: ???\nStatus: Secure\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eThe intel pointed to an unlikely convergence — two keyholders in Buenos Aires, Argentina. Bad security practice.\u003c/p\u003e\n\u003cp\u003eEva “Evita” Rosales, a former tango dancer turned libertarian cryptographer. Ricardo “El Pelado” Gomez, a chain-smoking security consultant. They were meeting at La Catedral, a cavernous tango club in the Almagro neighborhood — a place filled with mournful bandoneon music.\u003c/p\u003e\n\u003cp\u003eI arrived as the melancholic tone of Piazzolla filled the air. I approached through the dancing couples.\u003c/p\u003e\n\u003cp\u003e“Your key shards,” I stated. “Hand them over. Or prepare for deletion.”\u003c/p\u003e\n\u003cp\u003eEl Pelado sighed, smoke coming out his nostrils. “Always the drama with you yankee hackers.”\u003c/p\u003e\n\u003cp\u003eThe fight began without further preamble. Evita fought using tango steps. As I was desperately parrying her, El Pelado’s ThinkPad T400 sent me sprawling.\u003c/p\u003e\n\u003cp\u003e“Didn’t you hear?” he growled. “It takes two to tango!”\u003c/p\u003e\n\u003cp\u003eI was barely surviving thanks to desperate Vim-shortcut-inspired evasive maneuvers (dd to dodge, :wq to retreat).\u003c/p\u003e\n\u003cp\u003eJust as they had me cornered, a flash of black latex passed by. It was Natasha.\u003c/p\u003e\n\u003cp\u003eShe wrapped her powerful legs around the cryptographer’s neck in a complex Feet Jiu-jitsu choke. Then she dispatched Evita with equal ease.\u003c/p\u003e\n\u003cp\u003eTheir terminals closed for good. kill -9.\u003c/p\u003e\n\u003cp\u003eNatasha walked over calmly, retrieving Evita’s USB shard from a hidden pocket in her velvet dress. She dropped it on the floor and shattered it under her heels. She located El Pelado’s shard among the debris and gave it the same treatment.\u003c/p\u003e\n\u003cp\u003e“Zackaria warned me you might require assistance.” Natasha said coldly above the returning tango music. “He was correct.”\u003c/p\u003e\n\u003cp\u003e“Three keys down,” I said, catching my breath. “The quorum is broken, we’ve beaten DNS.”\u003c/p\u003e\n\u003cp\u003e“Yes,” she replied. “But we won’t know for sure until the next Key Ceremony. Are you ready to stop your killing spree? What if the other keyholders broke protocol and have some sort of backup? Zackaria expects results in Berlin next.”\u003c/p\u003e\n\u003cp\u003eShe handed me a USB with the exact locations of another keyholder. A slight pause, her eyes meeting mine with intensity. “See that you don’t disappoint my expectations.”\u003c/p\u003e\n\u003cp\u003eShe turned away. “Oh, and Natasha?” I called. “Are you coming to Berlin?”\u003c/p\u003e\n\u003cp\u003eShe looked back. “An unfortunate incident prevents me from entering the complex. Berghain has a strict entry policy — You’ll be fine.”\u003c/p\u003e\n\u003cp\u003eI had a bad feeling about Berlin, and a growing suspicion about Natasha’s true allegiance.\u003c/p\u003e\n\u003cstrong\u003eStep 4: Berlin\u003c/strong\u003e\n\u003cpre\u003e\u003ccode\u003e$ cat ~/kill-dns-list.txt\n# Key 1\nLocation: Helsinki\nKeyholder: Oliver Salmiakki (dead)\nStatus: Destroyed\n\n# Key 2\nLocation: Buenos Aires\nKeyholder: \"Evita\" Rosales (dead)\nStatus: Destroyed\n\n# Key 3\nLocation: Buenos Aires\nKeyholder: \"El Pelado\" Gomez (dead)\nStatus: Destroyed\n\n# Key 4\nLocation: Berlin\nKeyholder: Jürgen Schmidt\nStatus: Secure\n\n# Key 5-7\nLocation: ???\nKeyholder: ???\nStatus: Secure\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eBerghain — The techno temple. The concrete cathedral of hedonism. My target, Jürgen Schmidt, wasn’t just a DNS keyholder; he was the club’s owner.\u003c/p\u003e\n\u003cp\u003eFinding him meant descending into the club’s depths — the unequivocal hearth of darkness of our decadent world.\u003c/p\u003e\n\u003cp\u003eGaining entry past the bouncer required hacking their opaque door policy — a feat involving social engineering, analysis of historical entry data, and finally, dark clothes and a bored expression on my face.\u003c/p\u003e\n\u003cp\u003eThe descent was… educational. Each level plunged deeper into avant-garde sexuality, industrial aesthetics, and the limits of the Fast Fourier Transformation’s usage in music. By Level 5, I felt like I’d stumbled into a Hieronymus Bosch painting.\u003c/p\u003e\n\u003cp\u003eFinally, Level 6 — The air hummed with a subsonic bassline that made my bones vibrate. The only light came from a single, ultraviolet neon portrait of Michel Foucault hanging on the concrete wall.\u003c/p\u003e\n\u003cp\u003eThe scenes unfolding… well, let’s just say practices were occurring that probably won’t hit the mainstream for another 30 years, if ever.\u003c/p\u003e\n\u003cp\u003eSuddenly, the pounding 132bpm techno track lowered its tempo, fading into a single bass drum beat. A white spotlight snapped on, illuminating me on the center of the vast room. From a balcony, a figure emerged — Jürgen.\u003c/p\u003e\n\u003cp\u003e“Looks like ve haff a visitor who did not respect ze Hausordnung,” his voice a high-pitched, cartoonish Bavarian accent cutting through the beat. The denizens of Level 6 paused their activities, turning towards me.\u003c/p\u003e\n\u003cp\u003eJürgen dramatically threw off his silk robe, revealing an oiled, and surprisingly muscular physique for a man presumably subsisting on club drugs. And next to his original, fully erect penis, was another one. Identical. Bio-engineered, apparently. He struck a pose.\u003c/p\u003e\n\u003cp\u003e“Vhat’s ze problem, mein Freund?” he sneered. “Too much sexual deconstruction for your hacker sensibilities?”\u003c/p\u003e\n\u003cp\u003eI admit, I was momentarily thrown. Not by the dual appendage — I’d seen weirder things in Perl scripts — but by the sheer, weaponized postmodernism of it all. I glanced at Foucault, seeking philosophical guidance. Inspiration struck.\u003c/p\u003e\n\u003cp\u003e“The only thing getting deconstructed tonight is your neck,” I snarked, reaching up and yanking the surprisingly heavy neon Foucault portrait off the wall with a grunt. Using it like a boomerang, I threw it across the room. It connected with the head of a henchman, who went down hard.\u003c/p\u003e\n\u003cp\u003e“Dee Jay… drop einen Beat! Hu-hu-hu!” Jurgen said, unconcerned.\u003c/p\u003e\n\u003cp\u003eThe music kicked back into high gear and the room erupted into combat. Strobe lights pulsed, turning the brawl into a series of freeze-frames.\u003c/p\u003e\n\u003cp\u003eJürgen, surprisingly agile for a man packing twice the usual heat, front-flipped towards me swinging a chrome-plated butt plug the size of a traffic cone.\u003c/p\u003e\n\u003cp\u003eIt was a blur of leather, sweat, poppers, blood, and questionable body fluids. I blocked a blow from a girl wearing nothing but tape crosses on her breasts and a plague doctor mask, and threw her into a suspiciously bubbling jacuzzi.\u003c/p\u003e\n\u003cp\u003eFinally, I faced Jürgen, swinging the bludgeon. I sidestepped, grabbed a bottle of poppers from a nearby table — and in a moment of improvisation — squeezed the entire contents directly into his left eye socket.\u003c/p\u003e\n\u003cp\u003eHis scream was primal. Visceral. So raw that — I later heard — snippets of it were sampled by three different Berlin techno producers and became underground hits.\u003c/p\u003e\n\u003cp\u003eJürgen collapsed. EPIPE (Broken pipe).\u003c/p\u003e\n\u003cp\u003eI straightened my hoodie, now covered with blood and several other substances I didn’t want to identify, and walked back up towards the exit.\u003c/p\u003e\n\u003cp\u003eNobody gave me a second glance. The massacre on Level 6 apparently didn’t amount to much more than a typical Friday night at Berghain.\u003c/p\u003e\n\u003cp\u003eFour keys down.\u003c/p\u003e\n\u003cstrong\u003eStep 5: The Jet Plane\u003c/strong\u003e\n\u003cpre\u003e\u003ccode\u003e$ cat ~/kill-dns-list.txt\n# Key 1\nLocation: Helsinki\nKeyholder: Oliver Salmiakki (dead)\nStatus: Destroyed\n\n# Key 2\nLocation: Buenos Aires\nKeyholder: \"Evita\" Rosales (dead)\nStatus: Destroyed\n\n# Key 3\nLocation: Buenos Aires\nKeyholder: \"El Pelado\" Gomez (dead)\nStatus: Destroyed\n\n# Key 4\nLocation: Berlin\nKeyholder: Jürgen Schmidt (dead)\nStatus: Destroyed\n\n# Key 5-7\nLocation: ???\nKeyholder: ???\nStatus: Secure\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eThe flight back from Berlin wasn’t commercial. Zack insisted I use his private jet.\u003c/p\u003e\n\u003cp\u003eI was drinking a glass of something expensive, feeling a sense of accomplishment. Four keyholders down, more than enough to ensure the downfall of DNS.\u003c/p\u003e\n\u003cp\u003e“Max, my dude! Crushing it!” Zack said enthusiastically.\u003c/p\u003e\n\u003cp\u003eBeside him stood two unexpected figures: Ren Zhengfei, the CEO of Huawei, in a perfectly tailored suit, and Bob Sternfels, the CEO of McKinsey, whose eyes radiated spreadsheet energy. Natasha stood silently in the background — her expression unreadable behind dark sunglasses, despite being indoors at 40,000 feet.\u003c/p\u003e\n\u003cp\u003eAlmost instantly, the edges of my vision began to look like a Gaussian blur. Zack’s white smile seemed to become predatory.\u003c/p\u003e\n\u003cp\u003e“Whoa,” I slurred, feeling my limbs turn to jelly.\u003c/p\u003e\n\u003cp\u003e“We gave you just a little something to ensure strategic alignment,” Zack said, his voice losing its tech-bro warmth.\u003c/p\u003e\n\u003cp\u003eMy heart sank. Drugged. On a private jet. Surrounded by oligarchs — classic blunder.\u003c/p\u003e\n\u003cp\u003e“You see,” Zack continued, “You’ve been a useful agent. Upper-management material. But your understanding of the endgame was flawed. You thought this was about breaking DNS?” Zack laughed. “Cute. So Web 2.0. No, Max. This was always a hostile takeover.”\u003c/p\u003e\n\u003cp\u003eHe gestured towards Ren and Bob. “Let me introduce two keyholders you haven’t fought. They’ve been partners in my scheme from the very beginning. By the time you met me, I was already in possession of all the needed keys.”\u003c/p\u003e\n\u003cp\u003e“But…” I managed. “You need five. There are only three left.”\u003c/p\u003e\n\u003cp\u003e“You still don’t get it.” Zack smirked. “Ren and Bob have 2 keys. The 2 Argentinian keys were compromised since the late 90s. You see, all software in Argentina has a backdoor, put there during the Falklands War — state-sponsored stuff — the only way to do safe computing in Argentina is inside a Faraday cage.”\u003c/p\u003e\n\u003cp\u003eHe leaned closer. “Jürgen in Berlin had the fifth key — Yes, you killing him was inconvenient. Natasha’s little stunt trying to sabotage me, I assume,” he glared momentarily at Natasha, who was startled by a couple henchmen drawing guns at her.\u003c/p\u003e\n\u003cp\u003eHer eyes met mine briefly with calculation — maybe Zack’s unchecked ambition had finally crossed a line even for her.\u003c/p\u003e\n\u003cp\u003e“But that was ultimately irrelevant.” He continued. “Jürgen himself sent me a copy of his key months ago via RFC 1149. So, that makes five — ready for the Key Ceremony at the next full moon.”\u003c/p\u003e\n\u003cp\u003e“You just helped me handle the loose ends. Now I’ll handle the remaining ones”. He continued. “The keyholder in Dubai, and you.”\u003c/p\u003e\n\u003cp\u003eThe betrayal hit harder than the drugs. He was playing 5D Chess and I was just a pawn.\u003c/p\u003e\n\u003cp\u003e“Now, Max,” Zack leaned in again, raising a 3D-printed gun. “Just one little security check. Standard procedure. We need to be sure you didn’t keep any souvenirs.” He handed me my laptop. “Unlock your ThinkPad, let my tech guys check your drive.”\u003c/p\u003e\n\u003cp\u003eMy mind raced through the chemical fog. Giving them access was unthinkable. My tools, my contacts, my half-finished novel.\u003c/p\u003e\n\u003cp\u003eThen, a bizarre memory surfaced. A training session years ago by Sensei Richard Stallman.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e“Max,” Stallman said, “freedom requires not only free software, but free thought!” He gestured to an ancient CRT monitor displaying grainy footage from a popular 90s sitcom.\u003c/p\u003e\n\u003cp\u003eOn screen, Chandler was talking to Monica. But the audio was wrong. It was “Friends” dubbed into ROT13 — or as I recall, “Sevraqf.”\u003c/p\u003e\n\u003cp\u003e“Watch. Learn. Internalize the cadence!”\u003c/p\u003e\n\u003cp\u003eWe’d spent weeks watching ROT13 “Friends” reruns. He insisted it was crucial training for communicating in hostile environments. It seemed pointless at the time — until this very moment.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e“Fine. You win.” I slurred. “Set the keyboard to Colemak and I’ll type the password.”\u003c/p\u003e\n\u003cp\u003eI typed carefully. Not my actual password, but its ROT13 equivalent, which triggered an almost forgotten subroutine.\u003c/p\u003e\n\u003cp\u003eThe ThinkPad’s login screen flickered for a moment. Zack leaned closer, impatient. Then, small panels opened on the sides of the bulky ThinkPad — hardware modifications I added during a particularly paranoid phase.\u003c/p\u003e\n\u003cp\u003eWith a series of pfft sounds, dozens of miniature tranquilizer darts shot out in all directions.\u003c/p\u003e\n\u003cp\u003eZack yelped, clutching his arm where a dart embedded in his neck. Ren and Bob got hit too. Natasha took the chance to kick the guns out of the henchmen in front of her, and ran towards me.\u003c/p\u003e\n\u003cp\u003e“Traitor!” Zack screamed, fumbling with his gun as the toxin began to take hold. He fired. Bullets ricocheted off the cabin walls.\u003c/p\u003e\n\u003cp\u003eNatasha slammed her palm onto the “Emergency Exit” panel. The cabin depressurized instantly. She grabbed my arm, pulling me towards the hole.\u003c/p\u003e\n\u003cp\u003e“Hey!” Ren shouted. “You can’t do this to Huawei!”\u003c/p\u003e\n\u003cp\u003e“Nothing personal, Ren!” I shouted back over the hurricane-winds. “But it’s Huawei or the highway!”\u003c/p\u003e\n\u003cp\u003eAnd then we jumped.\u003c/p\u003e\n\u003cp\u003eOur landing was soft, cushioned by an improbably large, rain-soaked pile of Alternative für Deutschland (AfD) election posters dumped in a rural Brandenburg town. Classy.\u003c/p\u003e\n\u003cp\u003eThe grim reality settled in. Zack’s plan was perfectly viable.\u003c/p\u003e\n\u003cp\u003e“It’s over,” I said looking at the pile of nationalistic propaganda. “They won.”\u003c/p\u003e\n\u003cp\u003e“Not yet.” Natasha corrected. “There’s one wildcard left. Let’s go to Dubai.”\u003c/p\u003e\n\u003cstrong\u003eStep 6: Dubai\u003c/strong\u003e\n\u003cpre\u003e\u003ccode\u003e$ cat ~/kill-dns-list.txt\n# Key 1\nLocation: Helsinki\nKeyholder: Oliver Salmiakki (dead)\nStatus: Destroyed\n\n# Key 2\nLocation: Buenos Aires\nKeyholder: \"Evita\" Rosales (dead)\nStatus: Compromised\n\n# Key 3\nLocation: Buenos Aires\nKeyholder: \"El Pelado\" Gomez (dead)\nStatus: Compromised\n\n# Key 4\nLocation: Berlin\nKeyholder: Jürgen Schmidt (dead)\nStatus: Compromised\n\n# Key 5\nLocation: ???\nKeyholder: Ren Zhengfei\nStatus: Compromised\n\n# Key 6\nLocation: ???\nKeyholder: Bob Sternfels\nStatus: Compromised\n\n# Key 7\nLocation: Dubai\nKeyholder: Mohamed Al-Farsi\nStatus: ???\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eDubai, here goes nothing. The final keyholder — the last, desperate chance to stop Linktree.\u003c/p\u003e\n\u003cp\u003eMohamed Al-Farsi, known for his expertise and his paranoid security measures, hasn’t been seen in public in years. But our intel points to a data center in Dubai Production City.\u003c/p\u003e\n\u003cp\u003eTraversing Ramadan tents, we arrived at the complex gates. It was Friday, which meant the security would be lax during the noon prayer — the perfect time to sneak in.\u003c/p\u003e\n\u003cp\u003eBut the task was far from easy, as it was guarded by biometric scanners, laser grids, and a room full of pressure plates representing a game of Minesweeper that we had to beat to open the final door. At the end, Natasha held two plates pressed to bypass an ambiguous bomb location, making me the only one able to proceed and face Mohamed.\u003c/p\u003e\n\u003cp\u003eI found him in a small prayer room adorned with calligraphic art, next to the main server — the hum of cooling systems coming through the walls.\u003c/p\u003e\n\u003cp\u003eHe finished his prayer, slowly rose, and turned. His eyes, dark and intelligent, showed no surprise.\u003c/p\u003e\n\u003cp\u003e“So, the ghost arrives,” he said softly, his English impeccable. “The one they call E. Max Vim. You have caused disruption across the network, and geopolitical instability.”\u003c/p\u003e\n\u003cp\u003e“Just balancing the parentheses, Mohamed,” I replied.\u003c/p\u003e\n\u003cp\u003e“Do not mention Lisp in this sacred space,” he said gently. “You seek my key?”\u003c/p\u003e\n\u003cp\u003e“Well, I’ll make it short.” I said, meeting his calm gaze. “A corporate cabal led by Zack Jones is about to seize control of DNS. They plan to replace it with a proprietary system.”\u003c/p\u003e\n\u003cp\u003eHe nodded slowly, stroking his beard. “Zackaria Jones… LinkTree Transfer Protocol… Yes, I’ve seen the network chatter. The arrogance. The patterns are emerging. Is it now the time for chaos or tyranny? A tempting philosophy, yours. One I have wrestled with myself. But chaos is not freedom. It is merely a different kind of tyranny — the tyranny of the strong preying on the weak without the pretense of rules.”\u003c/p\u003e\n\u003cp\u003eHe stood up fully, adjusting the lines of his black robe. “Regardless, DNS is protected. Not merely by encryption, which is fallible. It is quantum-entangled with my own life. A dead man’s switch.”\u003c/p\u003e\n\u003cp\u003e“Did you say quantum-entangled?”\u003c/p\u003e\n\u003cp\u003e“Ah, yes. You see, I worked for the NSA. Their quantum tech is decades ahead of public knowledge. I foresaw the need to protect DNS from something like this, and so, I used it to create the ultimate backdoor.”\u003c/p\u003e\n\u003cp\u003eHe looked at me. “You must know that if I die — outside of specific protocols — the mechanism doesn’t just erase my shard’s data, but the entire DNS.” His voice dropped slightly. “It’s designed to inject garbage into the very heart of the system during any subsequent Key Ceremony. It will brick DNS at a fundamental level.”\u003c/p\u003e\n\u003cp\u003eUnderstanding dawned in his eyes. “Ah, I see now. You wish for me to trigger the fail-safe by my death. To ensure that no one — not ICANN, and certainly not Zack — can control DNS ever again. A final, destructive act of decentralization.”\u003c/p\u003e\n\u003cp\u003eHe opened his eyes, and a strange, unsettling peace settled over him. “Perhaps chaos is preferable to that tyranny after all. The system we built was flawed from the start. Too much trust placed in too few hands, vulnerable to human greed.” He looked at the calligraphy on the wall, then back at me, his decision made. “Perhaps it is time for it to end. For something new to emerge from the ruins.”\u003c/p\u003e\n\u003cp\u003eHe spread his hands slightly, palms open, a gesture of acceptance. “Very well, ghost. Do what you must. Trigger the reset. Make it clean.”\u003c/p\u003e\n\u003cp\u003eI raised my open-source katana. My hand was steady. This wasn’t just revenge anymore. It was the only way to stop Zack. It felt necessary — a system reset.\u003c/p\u003e\n\u003cp\u003eA single hit, clean and precise. Mohamed fell without a sound onto the prayer rug.\u003c/p\u003e\n\u003cp\u003eI looked at the intricate calligraphy on the wall, depicting verses about knowledge and truth. An unexpected pang — not remorse, exactly, but respect. Respect for the man who built a self-destruct button into the heart of the internet and, when the time came, had the conviction to see it pushed.\u003c/p\u003e\n\u003cp\u003e“Peace be upon you, brother of the book.” I murmured, feeling the weight of my actions settle upon me.\u003c/p\u003e\n\u003cp\u003eI wiped the blade clean on my sleeve. Outside, Natasha would be dealing with the pressure plates — time to leave.\u003c/p\u003e\n\u003cp\u003eThe quantum fail-safe triggered by Mohamed’s death propagated at the speed of light, ready to poison the next signing attempt.\u003c/p\u003e\n\u003cp\u003eThe chaos unleashed. The coup averted.\u003c/p\u003e\n\u003cstrong\u003eEpilogue\u003c/strong\u003e\n\u003cpre\u003e\u003ccode\u003e$ cat ~/kill-dns-list.txt\n# Key 1\nLocation: Helsinki\nKeyholder: Oliver Salmiakki (dead)\nStatus: Deactivated (?)\n\n# Key 2\nLocation: Buenos Aires\nKeyholder: \"Evita\" Rosales (dead)\nStatus: Deactivated (?)\n\n# Key 3\nLocation: Buenos Aires\nKeyholder: \"El Pelado\" Gomez (dead)\nStatus: Deactivated (?)\n\n# Key 4\nLocation: Berlin\nKeyholder: Jürgen Schmidt (dead)\nStatus: Deactivated (?)\n\n# Key 5\nLocation: ???\nKeyholder: Ren Zhengfei\nStatus: Deactivated (?)\n\n# Key 6\nLocation: ???\nKeyholder: Bob Sternfels\nStatus: Deactivated (?)\n\n# Key 7\nLocation: Dubai\nKeyholder: Mohamed Al-Farsi (dead)\nStatus: Deactivated (?)\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eSo, that’s the story.\u003c/p\u003e\n\u003cp\u003eNatasha and I parted ways somewhere over the Indian Ocean. Our alliance, born of shared enemies, dissolved as quickly as it formed.\u003c/p\u003e\n\u003cp\u003eBefore vanishing myself, I set up this dead man’s switch. A simple bash script, really. Wired to trigger this transmission to a few pre-selected, resilient corners of the old internet — Usenet — if my vitals flatline.\u003c/p\u003e\n\u003cp\u003eThe reason this message was ultimately sent could be either my demise triggering the switch, or the very disruption I sought to unleash causing mass decryption and data leakage across the world.\u003c/p\u003e\n\u003cp\u003eAll I know is, I executed Mohamed’s final kill command.\u003c/p\u003e\n\u003cp\u003eKeep an eye on your DNS resolution times for the next few days. If things start getting weird, you’ll know why.\u003c/p\u003e\n\u003cp\u003eThe full consequences? Hard to predict. Catastrophe? A temporary outage?A slow degradation?\u003c/p\u003e\n\u003cp\u003eThe future of the network is unwritten. Choose your resolvers wisely.\u003c/p\u003e\n\u003cp\u003eE. Max Vim, signing off.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e(END TRANSMISSION)\u003c/strong\u003e\n\u003cem\u003e\u003cstrong\u003eSIGNATURE VERIFIED\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\n","description_plain":"This is a satirical hacking story. For readers who prefer the text version, it's provided below (without the original graphics).\r\n\r\n---\r\n\r\n# Title: How To Become A Hacker - A Step-By-Step Guide\r\n\r\nDNS, the Domain Name System, is the internet’s phonebook. You type google.com, DNS looks it up and tells you the actual numerical IP address, like 172.217.160.142. Simple, right?\r\n\r\nToo simple. Vulnerable.\r\n\r\nEnter DNSSEC (DNS SECurity Extensions). It adds digital signatures to DNS data, proving it hasn’t been tampered with. Like a wax seal on each phonebook entry. Good idea.\r\n\r\nThe catch? The ultimate key, the KSK (Key Signing Key, or “Chaos Key”) for the internet’s root zone — the top of the pyramid — is so critical, they split it.\r\n\r\nThey did it using one of the oldest but strongest tricks in the cryptography book, something called the “Shamir’s Secret Sharing Algorithm,” cousin of the unbreakable 19th-century “One-Time Pad.”\r\n\r\nBasically, they broke the master key into pieces. Seven pieces, held by seven individuals scattered across the globe. To reconstruct the key, you need a quorum — five of the seven keys, gathered in a highly secure “Key Ceremony.”\r\n\r\nThey call them Trusted Community Representatives. I call them targets.\r\n\r\nMy mission: Liberate the internet from this centralized cabal. Return the web to its primordial, free state.\r\n\r\nMy motivations are complex, but it’s mostly revenge.\r\n\r\nI used to be a white-hat hacker, dreaming of elegant systems. But my proposals got shot down by the C-suite one too many times, and my projects co-opted into surveillance tools. I realized the entire structure had to be torn to the ground to build anything meaningful.\r\n\r\nAnyway, this is my story. You might learn something.\r\n\r\n## Step 1: Helsinki\r\n\r\nFinland. Land of saunas, heavy metal, and the patron saint of freedom, Linus Torvalds himself.\r\n\r\nMy first target: Oliver Salmiakki, a netsec professor at the University of Helsinki, where Darude shot his Sandstorm video. He was the only keyholder whose information was publicly available — a fatal flaw.\r\n\r\nWe also have some history, Oliver and I. It involved a JavaScript conference, and his then-girlfriend who apparently found my explanation of Vim’s modal editing compelling. I was drunk, she was drunk, and frankly, nothing that happens at a JavaScript conference should be taken seriously — Oliver, however, took it very personally.\r\n\r\nI slipped into the back of the lecture hall. Oliver was talking about quicksort. I waited for a pause, then cleared my throat.\r\n\r\n“Professor,” I said. “quicksort is adequate for pedagogical purposes, but are we just pretending cache coherency isn’t a factor in the real world?”\r\n\r\nKeyboards stopped clacking. Oliver froze, chalk dust settling around him like fallout. His eyes behind thick glasses locked onto mine. A flicker of recognition, then pure fury.\r\n\r\nHe faced his students. “Class dismissed. Please ensure your commits are pushed before exiting. We appear to have encountered… legacy code.”\r\n\r\nAs the students left, grateful for the break, Oliver fixed his tweed jacket. “E. Max Vim. How dare you soil the land of Linus Torvalds with your presence?” he hissed, pulling a custom-made shuriken shaped like the Linux penguin mascot from his coat.\r\n\r\nWith a flick, he sent Tux flying. It wasn’t aimed at me — not yet. It embedded itself into the stereo system. The ambient track cut out, replaced by Darude’s “Sandstorm” at full volume.\r\n\r\n“Predictable,” I sighed, pulling out two identical Nokia 3310s, one in each hand, connected by a USB cable like improvised nunchucks. Indestructible. Reliable.\r\n\r\n“There’s ChaCha20 encryption on my key,” Oliver said. “Military grade. You won’t decrypt it.”\r\n\r\n“I don’t want the key, Oliver,” I replied, advancing as the beat pounded. “I want to destroy it.” I swung the Nokias menacingly, “Now, let’s dance some cha-cha-cha.”\r\n\r\nThe fight was brutal, clumsy, and punctuated by the relentless dun dun dun Eurobeat. Chairs splintered against the wall. Expensive Scandinavian vases shattered.\r\n\r\nFinally, I cornered him against a bookshelf. A quick jab with the corner of a Nokia. His terminal emulator closed permanently. SIGKILL.\r\n\r\nI retrieved the key shard, stored on a USB stick around his neck.\r\n\r\nThanks to Finland’s perpetual twilight and an efficient public transport running on Erlang, my escape was clean.\r\n\r\nBefore leaving the country, I found a traditional wooden sauna. I placed the USB stick on the hot rocks. The plastic warped, smoked, and the silicon cracked.\r\n\r\nOne key down.\r\n\r\n## Step 2: Silicon Valley\r\n\r\n```\r\n$ cat ~/kill-dns-list.txt\r\n# Key 1\r\nLocation: Helsinki\r\nKeyholder: Oliver Salmiakki (dead)\r\nStatus: Destroyed\r\n\r\n# Key 2-7\r\nLocation: ???\r\nKeyholder: ???\r\nStatus: Secure\r\n```\r\n\r\nThe Helsinki hit echoed through the dark web. My handle, e-max-vim, briefly trended on some invite-only Mastodon instances.\r\n\r\nThis notoriety led me, ironically, to the heart of the beast: Silicon Valley. Specifically, to the open-plan, cocaine-fueled office of Linktree, a company whose entire business model seemed to answer the question no one asked: “What if a tree… of links?”\r\n\r\nTheir CEO, Zackaria “Zack” Jones, was a man whose personality was A/B tested for maximum engagement.\r\n\r\n“Max, my man! Disruptor! Paradigm shifter!” Zack greeted me with a fist bump that felt worryingly sincere. He wore Yeezys and a t-shirt that ironically said “Decentralize Everything”. “Love your work. Big fan of chaos! Murder! We need more of that energy. Helsinki? Chef’s kiss.”\r\n\r\nHis plan was even more megalomaniacal than mine. He didn’t just want to break DNS; he wanted to overthrow it — Replace HTTP (HyperText Transfer Protocol) with his proprietary LTTP (LinkTree Transfer Protocol). It was horrifying. It was brilliant.\r\n\r\n“We can help each other, Max,” Zack gestured expansively. “I know the location of all remaining DNS keyholders. You take down the old guard, clear the field. I build the new guard” He saw me as the perfect tool: motivated, capable, someone primed for destruction.\r\n\r\nIt was then that she walked in. Tall, dressed head-to-toe in black latex that squeaked with every deliberate movement. Her hair was pulled back into an architectural bun. Her cheekbones looked sharp enough to slice neutrinos. Her eyes held the cold look of someone who could DDoS a small nation.\r\n\r\n“Natasha Volkov,” Zack introduced her. “Our Head of Risk Mitigation.”\r\n\r\nNatasha eyed me up and down, her gaze lingering perhaps too long on the minimalist Neovim logo on my black hoodie.\r\n\r\n“Zackaria seems to trust you,” she stated with her thick Russian accent. “I don’t.”\r\n\r\n“Haha, priceless!” Zack said. “Gotta love that Eastern European humor.”\r\n\r\n“Anyway!” He continued. “I’m a CEO, not a mathematician, but let’s run the numbers: Seven keyholders total. You took out one in Helsinki. Quorum requires five keys, right? So, you need to take down… two more, and the whole thing collapses.” He smiled, proud of his calculation.\r\n\r\n“Alright, disruptor, let’s do this!” Zack continued. “Natasha, give Max the coordinates for the two closest keyholders.”\r\n\r\n## Step 3: Buenos Aires\r\n\r\n```\r\n$ cat ~/kill-dns-list.txt\r\n# Key 1\r\nLocation: Helsinki\r\nKeyholder: Oliver Salmiakki (dead)\r\nStatus: Destroyed\r\n\r\n# Key 2\r\nLocation: Buenos Aires\r\nKeyholder: \"Evita\" Rosales\r\nStatus: Secure\r\n\r\n# Key 3\r\nLocation: Buenos Aires\r\nKeyholder: \"El Pelado\" Gomez\r\nStatus: Secure\r\n\r\n# Key 4-7\r\nLocation: ???\r\nKeyholder: ???\r\nStatus: Secure\r\n```\r\n\r\nThe intel pointed to an unlikely convergence — two keyholders in Buenos Aires, Argentina. Bad security practice.\r\n\r\nEva “Evita” Rosales, a former tango dancer turned libertarian cryptographer. Ricardo “El Pelado” Gomez, a chain-smoking security consultant. They were meeting at La Catedral, a cavernous tango club in the Almagro neighborhood — a place filled with mournful bandoneon music.\r\n\r\nI arrived as the melancholic tone of Piazzolla filled the air. I approached through the dancing couples.\r\n\r\n“Your key shards,” I stated. “Hand them over. Or prepare for deletion.”\r\n\r\nEl Pelado sighed, smoke coming out his nostrils. “Always the drama with you yankee hackers.”\r\n\r\nThe fight began without further preamble. Evita fought using tango steps. As I was desperately parrying her, El Pelado’s ThinkPad T400 sent me sprawling.\r\n\r\n“Didn’t you hear?” he growled. “It takes two to tango!”\r\n\r\nI was barely surviving thanks to desperate Vim-shortcut-inspired evasive maneuvers (dd to dodge, :wq to retreat).\r\n\r\nJust as they had me cornered, a flash of black latex passed by. It was Natasha.\r\n\r\nShe wrapped her powerful legs around the cryptographer’s neck in a complex Feet Jiu-jitsu choke. Then she dispatched Evita with equal ease.\r\n\r\nTheir terminals closed for good. kill -9.\r\n\r\nNatasha walked over calmly, retrieving Evita’s USB shard from a hidden pocket in her velvet dress. She dropped it on the floor and shattered it under her heels. She located El Pelado’s shard among the debris and gave it the same treatment.\r\n\r\n“Zackaria warned me you might require assistance.” Natasha said coldly above the returning tango music. “He was correct.”\r\n\r\n“Three keys down,” I said, catching my breath. “The quorum is broken, we’ve beaten DNS.”\r\n\r\n“Yes,” she replied. “But we won’t know for sure until the next Key Ceremony. Are you ready to stop your killing spree? What if the other keyholders broke protocol and have some sort of backup? Zackaria expects results in Berlin next.”\r\n\r\nShe handed me a USB with the exact locations of another keyholder. A slight pause, her eyes meeting mine with intensity. “See that you don’t disappoint my expectations.”\r\n\r\nShe turned away. “Oh, and Natasha?” I called. “Are you coming to Berlin?”\r\n\r\nShe looked back. “An unfortunate incident prevents me from entering the complex. Berghain has a strict entry policy — You’ll be fine.”\r\n\r\nI had a bad feeling about Berlin, and a growing suspicion about Natasha’s true allegiance.\r\n\r\n## Step 4: Berlin\r\n\r\n```\r\n$ cat ~/kill-dns-list.txt\r\n# Key 1\r\nLocation: Helsinki\r\nKeyholder: Oliver Salmiakki (dead)\r\nStatus: Destroyed\r\n\r\n# Key 2\r\nLocation: Buenos Aires\r\nKeyholder: \"Evita\" Rosales (dead)\r\nStatus: Destroyed\r\n\r\n# Key 3\r\nLocation: Buenos Aires\r\nKeyholder: \"El Pelado\" Gomez (dead)\r\nStatus: Destroyed\r\n\r\n# Key 4\r\nLocation: Berlin\r\nKeyholder: Jürgen Schmidt\r\nStatus: Secure\r\n\r\n# Key 5-7\r\nLocation: ???\r\nKeyholder: ???\r\nStatus: Secure\r\n```\r\n\r\nBerghain — The techno temple. The concrete cathedral of hedonism. My target, Jürgen Schmidt, wasn’t just a DNS keyholder; he was the club’s owner.\r\n\r\nFinding him meant descending into the club’s depths — the unequivocal hearth of darkness of our decadent world.\r\n\r\nGaining entry past the bouncer required hacking their opaque door policy — a feat involving social engineering, analysis of historical entry data, and finally, dark clothes and a bored expression on my face.\r\n\r\nThe descent was… educational. Each level plunged deeper into avant-garde sexuality, industrial aesthetics, and the limits of the Fast Fourier Transformation’s usage in music. By Level 5, I felt like I’d stumbled into a Hieronymus Bosch painting.\r\n\r\nFinally, Level 6 — The air hummed with a subsonic bassline that made my bones vibrate. The only light came from a single, ultraviolet neon portrait of Michel Foucault hanging on the concrete wall.\r\n\r\nThe scenes unfolding… well, let’s just say practices were occurring that probably won’t hit the mainstream for another 30 years, if ever.\r\n\r\nSuddenly, the pounding 132bpm techno track lowered its tempo, fading into a single bass drum beat. A white spotlight snapped on, illuminating me on the center of the vast room. From a balcony, a figure emerged — Jürgen.\r\n\r\n“Looks like ve haff a visitor who did not respect ze Hausordnung,” his voice a high-pitched, cartoonish Bavarian accent cutting through the beat. The denizens of Level 6 paused their activities, turning towards me.\r\n\r\nJürgen dramatically threw off his silk robe, revealing an oiled, and surprisingly muscular physique for a man presumably subsisting on club drugs. And next to his original, fully erect penis, was another one. Identical. Bio-engineered, apparently. He struck a pose.\r\n\r\n“Vhat’s ze problem, mein Freund?” he sneered. “Too much sexual deconstruction for your hacker sensibilities?”\r\n\r\nI admit, I was momentarily thrown. Not by the dual appendage — I’d seen weirder things in Perl scripts — but by the sheer, weaponized postmodernism of it all. I glanced at Foucault, seeking philosophical guidance. Inspiration struck.\r\n\r\n“The only thing getting deconstructed tonight is your neck,” I snarked, reaching up and yanking the surprisingly heavy neon Foucault portrait off the wall with a grunt. Using it like a boomerang, I threw it across the room. It connected with the head of a henchman, who went down hard.\r\n\r\n“Dee Jay… drop einen Beat! Hu-hu-hu!” Jurgen said, unconcerned.\r\n\r\nThe music kicked back into high gear and the room erupted into combat. Strobe lights pulsed, turning the brawl into a series of freeze-frames.\r\n\r\nJürgen, surprisingly agile for a man packing twice the usual heat, front-flipped towards me swinging a chrome-plated butt plug the size of a traffic cone.\r\n\r\nIt was a blur of leather, sweat, poppers, blood, and questionable body fluids. I blocked a blow from a girl wearing nothing but tape crosses on her breasts and a plague doctor mask, and threw her into a suspiciously bubbling jacuzzi.\r\n\r\nFinally, I faced Jürgen, swinging the bludgeon. I sidestepped, grabbed a bottle of poppers from a nearby table — and in a moment of improvisation — squeezed the entire contents directly into his left eye socket.\r\n\r\nHis scream was primal. Visceral. So raw that — I later heard — snippets of it were sampled by three different Berlin techno producers and became underground hits.\r\n\r\nJürgen collapsed. EPIPE (Broken pipe).\r\n\r\nI straightened my hoodie, now covered with blood and several other substances I didn’t want to identify, and walked back up towards the exit.\r\n\r\nNobody gave me a second glance. The massacre on Level 6 apparently didn’t amount to much more than a typical Friday night at Berghain.\r\n\r\nFour keys down.\r\n\r\n## Step 5: The Jet Plane\r\n\r\n```\r\n$ cat ~/kill-dns-list.txt\r\n# Key 1\r\nLocation: Helsinki\r\nKeyholder: Oliver Salmiakki (dead)\r\nStatus: Destroyed\r\n\r\n# Key 2\r\nLocation: Buenos Aires\r\nKeyholder: \"Evita\" Rosales (dead)\r\nStatus: Destroyed\r\n\r\n# Key 3\r\nLocation: Buenos Aires\r\nKeyholder: \"El Pelado\" Gomez (dead)\r\nStatus: Destroyed\r\n\r\n# Key 4\r\nLocation: Berlin\r\nKeyholder: Jürgen Schmidt (dead)\r\nStatus: Destroyed\r\n\r\n# Key 5-7\r\nLocation: ???\r\nKeyholder: ???\r\nStatus: Secure\r\n```\r\n\r\nThe flight back from Berlin wasn’t commercial. Zack insisted I use his private jet.\r\n\r\nI was drinking a glass of something expensive, feeling a sense of accomplishment. Four keyholders down, more than enough to ensure the downfall of DNS.\r\n\r\n“Max, my dude! Crushing it!” Zack said enthusiastically.\r\n\r\nBeside him stood two unexpected figures: Ren Zhengfei, the CEO of Huawei, in a perfectly tailored suit, and Bob Sternfels, the CEO of McKinsey, whose eyes radiated spreadsheet energy. Natasha stood silently in the background — her expression unreadable behind dark sunglasses, despite being indoors at 40,000 feet.\r\n\r\nAlmost instantly, the edges of my vision began to look like a Gaussian blur. Zack’s white smile seemed to become predatory.\r\n\r\n“Whoa,” I slurred, feeling my limbs turn to jelly.\r\n\r\n“We gave you just a little something to ensure strategic alignment,” Zack said, his voice losing its tech-bro warmth.\r\n\r\nMy heart sank. Drugged. On a private jet. Surrounded by oligarchs — classic blunder.\r\n\r\n“You see,” Zack continued, “You’ve been a useful agent. Upper-management material. But your understanding of the endgame was flawed. You thought this was about breaking DNS?” Zack laughed. “Cute. So Web 2.0. No, Max. This was always a hostile takeover.”\r\n\r\nHe gestured towards Ren and Bob. “Let me introduce two keyholders you haven’t fought. They’ve been partners in my scheme from the very beginning. By the time you met me, I was already in possession of all the needed keys.”\r\n\r\n“But…” I managed. “You need five. There are only three left.”\r\n\r\n“You still don’t get it.” Zack smirked. “Ren and Bob have 2 keys. The 2 Argentinian keys were compromised since the late 90s. You see, all software in Argentina has a backdoor, put there during the Falklands War — state-sponsored stuff — the only way to do safe computing in Argentina is inside a Faraday cage.”\r\n\r\nHe leaned closer. “Jürgen in Berlin had the fifth key — Yes, you killing him was inconvenient. Natasha’s little stunt trying to sabotage me, I assume,” he glared momentarily at Natasha, who was startled by a couple henchmen drawing guns at her.\r\n\r\nHer eyes met mine briefly with calculation — maybe Zack’s unchecked ambition had finally crossed a line even for her.\r\n\r\n“But that was ultimately irrelevant.” He continued. “Jürgen himself sent me a copy of his key months ago via RFC 1149. So, that makes five — ready for the Key Ceremony at the next full moon.”\r\n\r\n“You just helped me handle the loose ends. Now I’ll handle the remaining ones”. He continued. “The keyholder in Dubai, and you.”\r\n\r\nThe betrayal hit harder than the drugs. He was playing 5D Chess and I was just a pawn.\r\n\r\n“Now, Max,” Zack leaned in again, raising a 3D-printed gun. “Just one little security check. Standard procedure. We need to be sure you didn’t keep any souvenirs.” He handed me my laptop. “Unlock your ThinkPad, let my tech guys check your drive.”\r\n\r\nMy mind raced through the chemical fog. Giving them access was unthinkable. My tools, my contacts, my half-finished novel.\r\n\r\nThen, a bizarre memory surfaced. A training session years ago by Sensei Richard Stallman.\r\n\r\n---\r\n\r\n“Max,” Stallman said, “freedom requires not only free software, but free thought!” He gestured to an ancient CRT monitor displaying grainy footage from a popular 90s sitcom.\r\n\r\nOn screen, Chandler was talking to Monica. But the audio was wrong. It was “Friends” dubbed into ROT13 — or as I recall, “Sevraqf.”\r\n\r\n“Watch. Learn. Internalize the cadence!”\r\n\r\nWe’d spent weeks watching ROT13 “Friends” reruns. He insisted it was crucial training for communicating in hostile environments. It seemed pointless at the time — until this very moment.\r\n\r\n---\r\n\r\n“Fine. You win.” I slurred. “Set the keyboard to Colemak and I’ll type the password.”\r\n\r\nI typed carefully. Not my actual password, but its ROT13 equivalent, which triggered an almost forgotten subroutine.\r\n\r\nThe ThinkPad’s login screen flickered for a moment. Zack leaned closer, impatient. Then, small panels opened on the sides of the bulky ThinkPad — hardware modifications I added during a particularly paranoid phase.\r\n\r\nWith a series of pfft sounds, dozens of miniature tranquilizer darts shot out in all directions.\r\n\r\nZack yelped, clutching his arm where a dart embedded in his neck. Ren and Bob got hit too. Natasha took the chance to kick the guns out of the henchmen in front of her, and ran towards me.\r\n\r\n“Traitor!” Zack screamed, fumbling with his gun as the toxin began to take hold. He fired. Bullets ricocheted off the cabin walls.\r\n\r\nNatasha slammed her palm onto the “Emergency Exit” panel. The cabin depressurized instantly. She grabbed my arm, pulling me towards the hole.\r\n\r\n“Hey!” Ren shouted. “You can’t do this to Huawei!”\r\n\r\n“Nothing personal, Ren!” I shouted back over the hurricane-winds. “But it’s Huawei or the highway!”\r\n\r\nAnd then we jumped.\r\n\r\nOur landing was soft, cushioned by an improbably large, rain-soaked pile of Alternative für Deutschland (AfD) election posters dumped in a rural Brandenburg town. Classy.\r\n\r\nThe grim reality settled in. Zack’s plan was perfectly viable.\r\n\r\n“It’s over,” I said looking at the pile of nationalistic propaganda. “They won.”\r\n\r\n“Not yet.” Natasha corrected. “There’s one wildcard left. Let’s go to Dubai.”\r\n\r\n## Step 6: Dubai\r\n\r\n```\r\n$ cat ~/kill-dns-list.txt\r\n# Key 1\r\nLocation: Helsinki\r\nKeyholder: Oliver Salmiakki (dead)\r\nStatus: Destroyed\r\n\r\n# Key 2\r\nLocation: Buenos Aires\r\nKeyholder: \"Evita\" Rosales (dead)\r\nStatus: Compromised\r\n\r\n# Key 3\r\nLocation: Buenos Aires\r\nKeyholder: \"El Pelado\" Gomez (dead)\r\nStatus: Compromised\r\n\r\n# Key 4\r\nLocation: Berlin\r\nKeyholder: Jürgen Schmidt (dead)\r\nStatus: Compromised\r\n\r\n# Key 5\r\nLocation: ???\r\nKeyholder: Ren Zhengfei\r\nStatus: Compromised\r\n\r\n# Key 6\r\nLocation: ???\r\nKeyholder: Bob Sternfels\r\nStatus: Compromised\r\n\r\n# Key 7\r\nLocation: Dubai\r\nKeyholder: Mohamed Al-Farsi\r\nStatus: ???\r\n```\r\n\r\nDubai, here goes nothing. The final keyholder — the last, desperate chance to stop Linktree.\r\n\r\nMohamed Al-Farsi, known for his expertise and his paranoid security measures, hasn’t been seen in public in years. But our intel points to a data center in Dubai Production City.\r\n\r\nTraversing Ramadan tents, we arrived at the complex gates. It was Friday, which meant the security would be lax during the noon prayer — the perfect time to sneak in.\r\n\r\nBut the task was far from easy, as it was guarded by biometric scanners, laser grids, and a room full of pressure plates representing a game of Minesweeper that we had to beat to open the final door. At the end, Natasha held two plates pressed to bypass an ambiguous bomb location, making me the only one able to proceed and face Mohamed.\r\n\r\nI found him in a small prayer room adorned with calligraphic art, next to the main server — the hum of cooling systems coming through the walls.\r\n\r\nHe finished his prayer, slowly rose, and turned. His eyes, dark and intelligent, showed no surprise.\r\n\r\n“So, the ghost arrives,” he said softly, his English impeccable. “The one they call E. Max Vim. You have caused disruption across the network, and geopolitical instability.”\r\n\r\n“Just balancing the parentheses, Mohamed,” I replied.\r\n\r\n“Do not mention Lisp in this sacred space,” he said gently. “You seek my key?”\r\n\r\n“Well, I’ll make it short.” I said, meeting his calm gaze. “A corporate cabal led by Zack Jones is about to seize control of DNS. They plan to replace it with a proprietary system.”\r\n\r\nHe nodded slowly, stroking his beard. “Zackaria Jones… LinkTree Transfer Protocol… Yes, I’ve seen the network chatter. The arrogance. The patterns are emerging. Is it now the time for chaos or tyranny? A tempting philosophy, yours. One I have wrestled with myself. But chaos is not freedom. It is merely a different kind of tyranny — the tyranny of the strong preying on the weak without the pretense of rules.”\r\n\r\nHe stood up fully, adjusting the lines of his black robe. “Regardless, DNS is protected. Not merely by encryption, which is fallible. It is quantum-entangled with my own life. A dead man’s switch.”\r\n\r\n“Did you say quantum-entangled?”\r\n\r\n“Ah, yes. You see, I worked for the NSA. Their quantum tech is decades ahead of public knowledge. I foresaw the need to protect DNS from something like this, and so, I used it to create the ultimate backdoor.”\r\n\r\nHe looked at me. “You must know that if I die — outside of specific protocols — the mechanism doesn’t just erase my shard’s data, but the entire DNS.” His voice dropped slightly. “It’s designed to inject garbage into the very heart of the system during any subsequent Key Ceremony. It will brick DNS at a fundamental level.”\r\n\r\nUnderstanding dawned in his eyes. “Ah, I see now. You wish for me to trigger the fail-safe by my death. To ensure that no one — not ICANN, and certainly not Zack — can control DNS ever again. A final, destructive act of decentralization.”\r\n\r\nHe opened his eyes, and a strange, unsettling peace settled over him. “Perhaps chaos is preferable to that tyranny after all. The system we built was flawed from the start. Too much trust placed in too few hands, vulnerable to human greed.” He looked at the calligraphy on the wall, then back at me, his decision made. “Perhaps it is time for it to end. For something new to emerge from the ruins.”\r\n\r\nHe spread his hands slightly, palms open, a gesture of acceptance. “Very well, ghost. Do what you must. Trigger the reset. Make it clean.”\r\n\r\nI raised my open-source katana. My hand was steady. This wasn’t just revenge anymore. It was the only way to stop Zack. It felt necessary — a system reset.\r\n\r\nA single hit, clean and precise. Mohamed fell without a sound onto the prayer rug.\r\n\r\nI looked at the intricate calligraphy on the wall, depicting verses about knowledge and truth. An unexpected pang — not remorse, exactly, but respect. Respect for the man who built a self-destruct button into the heart of the internet and, when the time came, had the conviction to see it pushed.\r\n\r\n“Peace be upon you, brother of the book.” I murmured, feeling the weight of my actions settle upon me.\r\n\r\nI wiped the blade clean on my sleeve. Outside, Natasha would be dealing with the pressure plates — time to leave.\r\n\r\nThe quantum fail-safe triggered by Mohamed’s death propagated at the speed of light, ready to poison the next signing attempt.\r\n\r\nThe chaos unleashed. The coup averted.\r\n\r\n## Epilogue\r\n\r\n```\r\n$ cat ~/kill-dns-list.txt\r\n# Key 1\r\nLocation: Helsinki\r\nKeyholder: Oliver Salmiakki (dead)\r\nStatus: Deactivated (?)\r\n\r\n# Key 2\r\nLocation: Buenos Aires\r\nKeyholder: \"Evita\" Rosales (dead)\r\nStatus: Deactivated (?)\r\n\r\n# Key 3\r\nLocation: Buenos Aires\r\nKeyholder: \"El Pelado\" Gomez (dead)\r\nStatus: Deactivated (?)\r\n\r\n# Key 4\r\nLocation: Berlin\r\nKeyholder: Jürgen Schmidt (dead)\r\nStatus: Deactivated (?)\r\n\r\n# Key 5\r\nLocation: ???\r\nKeyholder: Ren Zhengfei\r\nStatus: Deactivated (?)\r\n\r\n# Key 6\r\nLocation: ???\r\nKeyholder: Bob Sternfels\r\nStatus: Deactivated (?)\r\n\r\n# Key 7\r\nLocation: Dubai\r\nKeyholder: Mohamed Al-Farsi (dead)\r\nStatus: Deactivated (?)\r\n```\r\n\r\nSo, that’s the story.\r\n\r\nNatasha and I parted ways somewhere over the Indian Ocean. Our alliance, born of shared enemies, dissolved as quickly as it formed.\r\n\r\nBefore vanishing myself, I set up this dead man’s switch. A simple bash script, really. Wired to trigger this transmission to a few pre-selected, resilient corners of the old internet — Usenet — if my vitals flatline.\r\n\r\nThe reason this message was ultimately sent could be either my demise triggering the switch, or the very disruption I sought to unleash causing mass decryption and data leakage across the world.\r\n\r\nAll I know is, I executed Mohamed’s final kill command.\r\n\r\nKeep an eye on your DNS resolution times for the next few days. If things start getting weird, you’ll know why.\r\n\r\nThe full consequences? Hard to predict. Catastrophe? A temporary outage?A slow degradation?\r\n\r\nThe future of the network is unwritten. Choose your resolvers wisely.\r\n\r\nE. Max Vim, signing off.\r\n\r\n**(END TRANSMISSION)**\r\n***SIGNATURE VERIFIED***","comments_url":"https://lobste.rs/s/6ue8gr/how_become_hacker_step_by_step_guide","submitter_user":"sebastiancarlos","user_is_author":true,"tags":["cryptography","linux","security"]},{"short_id":"evrduc","short_id_url":"https://lobste.rs/s/evrduc","created_at":"2025-03-29T08:58:59.000-05:00","title":"where do the bytes go?","url":"https://flak.tedunangst.com/post/where-do-the-bytes-go","score":17,"flags":0,"comment_count":0,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/evrduc/where_do_bytes_go","submitter_user":"calvin","user_is_author":false,"tags":["openbsd"]},{"short_id":"govrnx","short_id_url":"https://lobste.rs/s/govrnx","created_at":"2025-03-29T07:32:20.000-05:00","title":"Paged out issue 06","url":"https://pagedout.institute/download/PagedOut_006.pdf","score":21,"flags":0,"comment_count":3,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/govrnx/paged_out_issue_06","submitter_user":"Toric","user_is_author":false,"tags":["hardware","pdf","release","security"]},{"short_id":"xs2sdb","short_id_url":"https://lobste.rs/s/xs2sdb","created_at":"2025-03-29T07:28:30.000-05:00","title":"Item Flow, Part 1: A new unified concept for layout","url":"https://webkit.org/blog/16587/item-flow-part-1-a-new-unified-concept-for-layout/","score":10,"flags":0,"comment_count":0,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/xs2sdb/item_flow_part_1_new_unified_concept_for","submitter_user":"Kerrick","user_is_author":false,"tags":["css"]},{"short_id":"hg1kpm","short_id_url":"https://lobste.rs/s/hg1kpm","created_at":"2025-03-29T07:04:55.000-05:00","title":"Pixelfed leaks private posts from other Fediverse instances","url":"https://fokus.cool/2025/03/25/pixelfed-vulnerability.html","score":12,"flags":0,"comment_count":18,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/hg1kpm/pixelfed_leaks_private_posts_from_other","submitter_user":"strugee","user_is_author":false,"tags":["security","web"]},{"short_id":"qdhcqx","short_id_url":"https://lobste.rs/s/qdhcqx","created_at":"2025-03-29T06:57:10.000-05:00","title":"\"Moonshots\" Initiative to Secure the Future of RISC OS","url":"https://www.riscosopen.org/news/articles/2025/03/28/moonshots-initiative-to-secure-the-future-of-the-os","score":5,"flags":0,"comment_count":0,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/qdhcqx/moonshots_initiative_secure_future_risc","submitter_user":"nortti","user_is_author":false,"tags":["osdev"]},{"short_id":"owlocr","short_id_url":"https://lobste.rs/s/owlocr","created_at":"2025-03-29T06:46:05.000-05:00","title":"On the Biology of a Large Language Model","url":"https://transformer-circuits.pub/2025/attribution-graphs/biology.html","score":3,"flags":0,"comment_count":0,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/owlocr/on_biology_large_language_model","submitter_user":"pointlessone","user_is_author":false,"tags":["ai"]},{"short_id":"ypuwrw","short_id_url":"https://lobste.rs/s/ypuwrw","created_at":"2025-03-29T05:58:44.000-05:00","title":"Building a search engine from scratch, in Rust: part 1","url":"https://jdrouet.github.io/posts/202503170800-search-engine-part-1/","score":6,"flags":0,"comment_count":0,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/ypuwrw/building_search_engine_from_scratch_rust","submitter_user":"Unfixable1373","user_is_author":true,"tags":["rust","wasm"]},{"short_id":"7yz8sf","short_id_url":"https://lobste.rs/s/7yz8sf","created_at":"2025-03-29T05:39:01.000-05:00","title":"Total functions and beyond","url":"https://ericnormand.substack.com/p/total-functions-and-beyond","score":3,"flags":0,"comment_count":0,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/7yz8sf/total_functions_beyond","submitter_user":"segeda","user_is_author":false,"tags":["clojure","plt"]},{"short_id":"od7zlr","short_id_url":"https://lobste.rs/s/od7zlr","created_at":"2025-03-29T05:37:23.000-05:00","title":"Expressing Japanese Grammar Through TypeScript Type System","url":"https://github.com/typedgrammar/typed-japanese/blob/main/blog.md","score":6,"flags":0,"comment_count":0,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/od7zlr/expressing_japanese_grammar_through","submitter_user":"delroth","user_is_author":false,"tags":["programming"]},{"short_id":"fstz1l","short_id_url":"https://lobste.rs/s/fstz1l","created_at":"2025-03-29T05:23:45.000-05:00","title":"A Language Server for Postgres","url":"https://github.com/supabase-community/postgres-language-server","score":26,"flags":0,"comment_count":4,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/fstz1l/language_server_for_postgres","submitter_user":"fanf","user_is_author":false,"tags":["databases","editors"]},{"short_id":"11chzy","short_id_url":"https://lobste.rs/s/11chzy","created_at":"2025-03-28T23:09:33.000-05:00","title":"The \"broligarchs\" don't speak for me","url":"https://ratfactor.com/tech-nope","score":60,"flags":3,"comment_count":5,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/11chzy/broligarchs_don_t_speak_for_me","submitter_user":"jrw","user_is_author":false,"tags":["culture","philosophy","rant"]},{"short_id":"qpymbd","short_id_url":"https://lobste.rs/s/qpymbd","created_at":"2025-03-28T22:32:00.000-05:00","title":"OpenWrt Two Approval","url":"https://openwrt.org/voting/2025-02-12-openwrt-two","score":23,"flags":1,"comment_count":6,"description":"\u003cp\u003eSpecs for the OpenWRT One: \u003ca href=\"https://openwrt.org/toh/openwrt/one\" rel=\"ugc\"\u003ehttps://openwrt.org/toh/openwrt/one\u003c/a\u003e\u003c/p\u003e\n","description_plain":"Specs for the OpenWRT One: https://openwrt.org/toh/openwrt/one","comments_url":"https://lobste.rs/s/qpymbd/openwrt_two_approval","submitter_user":"icefox","user_is_author":false,"tags":["hardware","networking"]},{"short_id":"y7jhdy","short_id_url":"https://lobste.rs/s/y7jhdy","created_at":"2025-03-28T22:15:03.000-05:00","title":"Condition system for Fennel language and Lua runtime","url":"https://andreyor.st/posts/2021-08-08-condition-system-for-fennel-language-and-lua-runtime/","score":14,"flags":0,"comment_count":0,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/y7jhdy/condition_system_for_fennel_language_lua","submitter_user":"veqq","user_is_author":false,"tags":["lisp"]},{"short_id":"wiq9v3","short_id_url":"https://lobste.rs/s/wiq9v3","created_at":"2025-03-28T19:14:46.000-05:00","title":"Time formatting and storage bugs","url":"https://en.wikipedia.org/wiki/Time_formatting_and_storage_bugs","score":1,"flags":0,"comment_count":0,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/wiq9v3/time_formatting_storage_bugs","submitter_user":"chamlis","user_is_author":false,"tags":["historical"]}]