[{"short_id":"nux2xg","created_at":"2025-12-05T09:07:51.000-06:00","title":"Typewriter plotters","url":"https://biosrhythm.com/?p=2143","score":2,"flags":0,"comment_count":0,"description":"","description_plain":"","submitter_user":"fanf","user_is_author":false,"tags":["hardware","historical"],"short_id_url":"https://lobste.rs/s/nux2xg","comments_url":"https://lobste.rs/s/nux2xg/typewriter_plotters"},{"short_id":"9lbkyn","created_at":"2025-12-05T07:33:05.000-06:00","title":"The 1600 columns limit in PostgreSQL - how many columns fit into a table","url":"https://andreas.scherbaum.la/post/2025-12-04_the-1600-columns-limit-in-postgresql-how-many-columns-fit-into-a-table/","score":2,"flags":0,"comment_count":0,"description":"","description_plain":"","submitter_user":"eatonphil","user_is_author":false,"tags":["databases"],"short_id_url":"https://lobste.rs/s/9lbkyn","comments_url":"https://lobste.rs/s/9lbkyn/1600_columns_limit_postgresql_how_many"},{"short_id":"9i16af","created_at":"2025-12-05T07:27:25.000-06:00","title":"Layoutz – Simple, beautiful CLI output for Haskell 🪶","url":"https://flora.pm/packages/@hackage/layoutz","score":4,"flags":0,"comment_count":0,"description":"","description_plain":"","submitter_user":"Hecate","user_is_author":false,"tags":["haskell"],"short_id_url":"https://lobste.rs/s/9i16af","comments_url":"https://lobste.rs/s/9i16af/layoutz_simple_beautiful_cli_output_for"},{"short_id":"gv0fzl","created_at":"2025-12-05T07:02:50.000-06:00","title":"Golang’s Big Miss on Memory Arenas","url":"https://avittig.medium.com/golangs-big-miss-on-memory-arenas-f1375524cc90","score":5,"flags":0,"comment_count":3,"description":"","description_plain":"","submitter_user":"telemachus","user_is_author":false,"tags":["go"],"short_id_url":"https://lobste.rs/s/gv0fzl","comments_url":"https://lobste.rs/s/gv0fzl/golang_s_big_miss_on_memory_arenas"},{"short_id":"gdtbbh","created_at":"2025-12-05T06:43:01.000-06:00","title":"The Performance Revolution in JavaScript Tooling","url":"https://blog.appsignal.com/2025/12/03/the-performance-revolution-in-javascript-tooling.html","score":3,"flags":0,"comment_count":4,"description":"","description_plain":"","submitter_user":"ayo","user_is_author":false,"tags":["javascript"],"short_id_url":"https://lobste.rs/s/gdtbbh","comments_url":"https://lobste.rs/s/gdtbbh/performance_revolution_javascript"},{"short_id":"lm8vm2","created_at":"2025-12-05T05:12:00.000-06:00","title":"LISP Style \u0026 Design","url":"https://archive.org/details/miller-and-benson-1990-lisp-style-design","score":3,"flags":0,"comment_count":0,"description":"","description_plain":"","submitter_user":"amoroso","user_is_author":false,"tags":["book","lisp"],"short_id_url":"https://lobste.rs/s/lm8vm2","comments_url":"https://lobste.rs/s/lm8vm2/lisp_style_design"},{"short_id":"7nlfjb","created_at":"2025-12-05T04:54:28.000-06:00","title":"What are you doing this weekend?","url":"","score":4,"flags":0,"comment_count":8,"description":"\u003cp\u003eFeel free to tell what you plan on doing this weekend and even ask for help or feedback.\u003c/p\u003e\n\u003cp\u003ePlease keep in mind it’s more than OK to do nothing at all too!\u003c/p\u003e\n","description_plain":"Feel free to tell what you plan on doing this weekend and even ask for help or feedback.\r\n\r\nPlease keep in mind it’s more than OK to do nothing at all too!","submitter_user":"caius","user_is_author":true,"tags":["ask","programming"],"short_id_url":"https://lobste.rs/s/7nlfjb","comments_url":"https://lobste.rs/s/7nlfjb/what_are_you_doing_this_weekend"},{"short_id":"dgxkdx","created_at":"2025-12-05T01:45:11.000-06:00","title":"Unredacted Magazine Issue 008 SEP 2025","url":"https://unredactedmagazine.com/issues/008.pdf","score":4,"flags":0,"comment_count":1,"description":"","description_plain":"","submitter_user":"sjamaan","user_is_author":false,"tags":["pdf","privacy","security"],"short_id_url":"https://lobste.rs/s/dgxkdx","comments_url":"https://lobste.rs/s/dgxkdx/unredacted_magazine_issue_008_sep_2025"},{"short_id":"ob4esu","created_at":"2025-12-05T00:51:46.000-06:00","title":"dp_knapsack_sliding_hirschberg, a new activation memory budget solver for PyTorch","url":"https://jedrzej.maczan.pl/2025_11_21_dp_knapsack_sliding_hirschberg","score":2,"flags":0,"comment_count":0,"description":"","description_plain":"","submitter_user":"ocramz","user_is_author":false,"tags":["compilers","math","performance"],"short_id_url":"https://lobste.rs/s/ob4esu","comments_url":"https://lobste.rs/s/ob4esu/dp_knapsack_sliding_hirschberg_new"},{"short_id":"4iraje","created_at":"2025-12-05T00:43:55.000-06:00","title":"Ohlang","url":"https://vms-has-a.great-site.net/tut.txt","score":2,"flags":0,"comment_count":0,"description":"\u003cp\u003eThis \u003ca href=\"https://vms-has-a.great-site.net/oh.html\" rel=\"ugc\"\u003etodo\u003c/a\u003e site is implemented in it.\u003c/p\u003e\n","description_plain":"This [todo](https://vms-has-a.great-site.net/oh.html) site is implemented in it.","submitter_user":"veqq","user_is_author":false,"tags":["concatenative","plt"],"short_id_url":"https://lobste.rs/s/4iraje","comments_url":"https://lobste.rs/s/4iraje/ohlang"},{"short_id":"ihrynz","created_at":"2025-12-04T23:12:20.000-06:00","title":"How to speed up the Rust compiler in December 2025","url":"https://nnethercote.github.io/2025/12/05/how-to-speed-up-the-rust-compiler-in-december-2025.html","score":30,"flags":0,"comment_count":2,"description":"","description_plain":"","submitter_user":"asb","user_is_author":true,"tags":["performance","rust"],"short_id_url":"https://lobste.rs/s/ihrynz","comments_url":"https://lobste.rs/s/ihrynz/how_speed_up_rust_compiler_december_2025"},{"short_id":"btpwfx","created_at":"2025-12-04T21:44:57.000-06:00","title":"Trustworthy software through non-profits?","url":"https://www.more-magic.net/posts/trustworthy-software-through-non-profits.html","score":5,"flags":0,"comment_count":0,"description":"","description_plain":"","submitter_user":"sjamaan","user_is_author":true,"tags":["culture","philosophy","practices"],"short_id_url":"https://lobste.rs/s/btpwfx","comments_url":"https://lobste.rs/s/btpwfx/trustworthy_software_through_non"},{"short_id":"cqcmkv","created_at":"2025-12-04T21:21:51.000-06:00","title":"Russ Cox - ACM ByteCast","url":"https://acmbytecast.podbean.com/e/russ-cox-episode-78/","score":2,"flags":0,"comment_count":0,"description":"","description_plain":"","submitter_user":"janus","user_is_author":false,"tags":["audio","go","unix"],"short_id_url":"https://lobste.rs/s/cqcmkv","comments_url":"https://lobste.rs/s/cqcmkv/russ_cox_acm_bytecast"},{"short_id":"whiefr","created_at":"2025-12-04T20:45:11.000-06:00","title":"Thoughts on Go vs. Rust vs. Zig","url":"https://sinclairtarget.com/blog/2025/08/thoughts-on-go-vs.-rust-vs.-zig/","score":25,"flags":0,"comment_count":3,"description":"","description_plain":"","submitter_user":"ucirello","user_is_author":false,"tags":["go","rust","zig"],"short_id_url":"https://lobste.rs/s/whiefr","comments_url":"https://lobste.rs/s/whiefr/thoughts_on_go_vs_rust_vs_zig"},{"short_id":"h4yblg","created_at":"2025-12-04T20:41:30.000-06:00","title":"Lobsters Interview with Aks","url":"","score":25,"flags":0,"comment_count":0,"description":"\u003cp\u003eI know \u003ca href=\"https://lobste.rs/~Aks\" rel=\"ugc\"\u003e@Aks\u003c/a\u003e from IRC. He works on KDE Software, has made many lovely games and I even use his \u003ca href=\"https://codeberg.org/akselmo/Revontuli\" rel=\"ugc\"\u003ecolorscheme\u003c/a\u003e in my terminal!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePlease introduce yourself!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eI'm Akseli but I usually go as \u003ca href=\"https://akselmo.dev/about/\" rel=\"ugc\"\u003eAks\u003c/a\u003e on the internet. I'm in my 30s and I'm from Finland. I've liked computers since I was a kid, so naturally I ended up doing computer stuff as a day job. Nowadays I work on KDE software at TechPaladin.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow did you first discover computers as a kid?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eI was 3-4 years old. We had an old 386 DOS computer and I usually played games like Stunts on it. I was always behind when it came to hardware. While all my peers at school would have PS2s, I played on NES and PS1. Over time I just liked to play and tinker with different kinds of machines, mostly old left-over computers. But games were my main hook, I always wanted to make my own. And \u003ca href=\"https://akselmo.dev/tags/gamedev/\" rel=\"ugc\"\u003eI did\u003c/a\u003e!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat were your first games like?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMy very first game was with FPS Creator when I was ~13. My friend and I had some inside joke about a game with tons of enemies and a gun with 6 bullets, so I ended up recreating that. The game is \u003cem\u003ereally bad\u003c/em\u003e, but that was sort of the point. The next game I made when I was 18 or so, with Unity. Similar theme, but this time the enemies were dancing and bouncing skeletons, and you had a shotgun. It was so silly. I then made a roguelike, and 3D platformer, and FPS called \u003ca href=\"https://akselmo.itch.io/penance\" rel=\"ugc\"\u003ePenance\u003c/a\u003e that has about 19k downloads. You can find \u003ca href=\"https://akselmo.itch.io/\" rel=\"ugc\"\u003emy games\u003c/a\u003e on Itch. Lately though, I haven't had the energy to finish my game projects e.g. Artificial Rage: \u003ca href=\"https://codeberg.org/akselmo/Artificial-Rage\" rel=\"ugc\"\u003ehttps://codeberg.org/akselmo/Artificial-Rage\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eI sank a fair few hours into Penance! I also really liked the \u003ca href=\"https://akselmo.itch.io/holiday-present-hunt\" rel=\"ugc\"\u003eChristmas game\u003c/a\u003e you made your sister. Do you ever put Easter eggs in code or often make projects for others like that?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eI put some Easter eggs. For example someone complained that in Penance all the weapons look like woolen socks(?). So I added a pair of wooly socks in the starting area. I also proposed to my wife with a game, which had a small hallway with pictures of us. It was a fun little project, but a bit cut short since I tried to work on it as a secret, which proved difficult! We have made a \u003ca href=\"https://tecsiederp.itch.io/still-rose\" rel=\"ugc\"\u003efew\u003c/a\u003e  \u003ca href=\"https://tecsiederp.itch.io/nebs-island-adventure\" rel=\"ugc\"\u003egames\u003c/a\u003e together. She went to a web-dev bootcamp but doesn't code anymore, although she gladly works with me on various game projects.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow do you ideate the game play, style and such things?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhile playing, I usually think it \"would be cool if I had this game but changed this and that..\" which provides a great starting point. Then it just naturally evolves into it's own thing. Penance was pretty much me going \"I want Quake but with random generated levels\" but then I ended up making a campaign with handcrafted levels to it anyway, beside the random generated endless mode.\u003c/p\u003e\n\u003cp\u003eReally, I just make things \u003cem\u003eI\u003c/em\u003e want to play. People liking it is just a bonus. One of my favorite game projects is \u003ca href=\"https://akselmo.itch.io/castle-rodok\" rel=\"ugc\"\u003eCastle Rodok\u003c/a\u003e because it is full of lore about my own RPG world. It's not very popular, but I like it a lot. It was a passion project.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat languages and technologies did you use?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWith tools, I'm driven by need more than wants. My day job is all C++, which I'm fine with. I am very much a fan of \"C-style\" languages. They're boring and get the job done. For things I want to get running quick, I usually use Python, which I used a lot in test automation for all kinds of devices. Mostly medical devices so I can't talk about them due to NDAs.\u003c/p\u003e\n\u003cp\u003eMost of my games have been in Unity, but \u003ca href=\"https://akselmo.itch.io/crypt-of-darne\" rel=\"ugc\"\u003eCrypt of Darne\u003c/a\u003e uses Python and I also have played around with \u003ca href=\"https://akselmo.dev/posts/moving-from-c-to-odin/\" rel=\"ugc\"\u003eC and Odin\u003c/a\u003e for my game projects.\u003c/p\u003e\n\u003cp\u003eI have tried LISPs and functional programming languages and such, but I just have hard time with them. Especially with those that propose a completely different syntax for me. I haven't had any projects with Rust but I liked tinkering with it it, besides the \u003ccode\u003e'\u003c/code\u003e lifetime syntax which I easily miss. I am very boring when it comes to programming languages, I like to stick with what I know. I wanderlust about what I can create: Games, apps, systems software, drivers... Many ideas but hardly any time. But work comes first, so I mostly work on KDE things right now. For my own things, If I feel like working on a game, I go with the flow and do that.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat was your experience with different OS before finding \u003ca href=\"https://kde.org/\" rel=\"ugc\"\u003eKDE\u003c/a\u003e?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eI'd wanted to move on from Windows and dabbled with Linux a bunch, but could never stick to it because I could not play any games I owned in Linux. When I learned that Linux systems can in-fact game, it didn't take me long to switch. At first, I just dual-booted and tested the waters. I tried Linux Mint and Ubuntu, which were fine, but I had some issues with X11 and it's compositing eating all the FPS, so I gave up for a while. 6 months later I tried Kubuntu which worked really well for my needs. After some time I hopped to Fedora KDE, and there I found out that Wayland completely removed the issue with the compositing eating FPS in games. KDE was also very easy to learn and understand. I didn't really need to customize it. Then I found an annoying bug I wanted to fix it and started to contribute.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat was the first contribution experience like?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eI had no idea how to do anything with C++. I learned C from scratch making \u003ca href=\"https://codeberg.org/akselmo/Artificial-Rage\" rel=\"ugc\"\u003eArtificial Rage\u003c/a\u003e, studying how to create a project with CMake and all that, but luckily the internet is full of advice. So I had not used C++ before and just started learning to make that first contribution! I just joined the Matrix chats and asked questions; people were very helpful. Onboarding was great. It wasn't very big though, I just looked at the surrounding code and made my contribution look the part. Feedback in the merge request on Gitlab helped wrap it up. One of my first larger contributions though was adding region and language settings to system settings. This allowed users to change, for example, date-time settings differently than currency. This was mix of C and C++ and was difficult! Diligently reading the docs, looking at similar code and a lot of build-\u0026gt;test-\u0026gt;change-\u0026gt;build again... it started to work! Then the reviews helped too. But C++ is such a different beast, I'm still learning it to this day. I'd say I know less C++ and more about problem solving.\u003c/p\u003e\n\u003cp\u003eIt also helps that the \"Qt dialect\" of C++ is rather nice. The Qt framework does a lot of the work for you. For example, the signal and slot system or objects having parent objects that clear their children when they're deconstructed. Qt's documentation is also pretty great.\u003c/p\u003e\n\u003cp\u003eI'm still learning and don't have much in depth knowledge, but I hate header files. Modifying the same thing (function declarations) in two places makes no sense. It should autogenerate as part of the compilation. I found some such header generating tools, but they go unused and quietly forgotten. I suspect they would confuse language servers too, so it's a tooling issue.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat are your thoughts on Linux over all, big things which need changing but no one is working on or nice initiatives which you think will improve things, etc.?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe Linux desktop is getting much, much better and I see a hopeful future. Will it ever be the main OS, like Windows is? Probably not, unless hardware manufacturers/OEM's start installing Linux distros by default, instead of Windows. But I'm hopeful we'll get to 5%-10% worldwide usage. Now that gaming is possible on Linux, a lot of people moved over. Just few weeks ago I installed Bazzite for my friend who has been using Windows forever, but didn't want to use Win11.\u003c/p\u003e\n\u003cp\u003eOur next step is to make sure accessibility is up to snuff. At least for KDE, we have an accessibility engineer who is brilliant at their job. Then, I think immutable systems might get more popular. Personally I'm fine with either, but for those who view their computer more as an appliance than a computer, immutable systems are very nice: They allow them to jump from broken state back to working state with ease (select different boot entry at startup).\u003c/p\u003e\n\u003cp\u003eComplex software's never done; improvements are always needed. Accessibility means more than just accessibility settings: Make it easy to install, test, run, etc... If Linux desktops can get more hardware manufacturers on board to install Linux desktop as default, that will certainly help too. Also shoutout to the [EndOf10](\u003ca href=\"https://endof10.org/\" rel=\"ugc\"\u003ehttps://endof10.org/\u003c/a\u003e initiative, when I shared it around to my non-nerdy-friends, they were very curious about Linux desktop and I had an excuse to ramble about it to them! In a nutshell: I am hopeful, but we can't rest on our laurels, we need to stop fighting \"whats the best desktop\" and work together more.\u003c/p\u003e\n\u003cp\u003eBTW, if anyone reading this has been Linux curious, go for it! Take a secondary device and play around with it there. And I also want to point out that dont be afraid to contribute to things you like in any way you can, be it software or hardware or actual physical world.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow do you see it in light of more phone usage, less desktop usage? Have you any impressions of governments or businesses moving to linux?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eComputers are still widely used where I live, at least within my generation. Those who game especially often have a desktop PC. It may not be top-of-the-line hardcore gaming rig, but they have one to play a bit of Counter-Strike or similar games.\u003c/p\u003e\n\u003cp\u003ePhones are the king of \"basic stuff\" and for many people a tablet functions as a simple internet-appliance. I can only hope that projects like [PostmarketOS](\u003ca href=\"https://postmarketos.org/\" rel=\"ugc\"\u003ehttps://postmarketos.org/\u003c/a\u003e will help to keep these tablets and phones working when the regular android updates stop, to ease the avalanche of e-waste.\u003c/p\u003e\n\u003cp\u003eWhen it comes to governments and businesses, I wish they did it more. I have heard that in Germany more governments are testing it out. In Finland, I do not know, but I would like to drive more for it.\nIt's certainly an area where we should try to help as much as possible as well.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow can we (individuals or organizations) help?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIndividual users: Make sure to report bugs and issues, and share knowledge. Do not evangelize or push the matter, just say it's something you use and elaborate when people ask. Too many times I've seen people pushed away from using Linux desktop because people are very.. Pushy. As surprising it may be, not many people really care as much as we do!\u003c/p\u003e\n\u003cp\u003eOrganizations: Try to adopt more FOSS technologies for daily things, e.g. LibreOffice. Start small.\nIt does not need to be an overnight change, just small things here and there.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow many resources do you have compared to the demands of everything you are working on?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe're definitely stretched. We always could use more help, though C++ seems to deter that help a bit, which I can understand. But if I could start from scratch, I'm sure anyone can! Besides, more and more projects use QML and Rust. For testing, there's Python.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat prerequisites are there for contributing?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe have Matrix chat for new contributors, where people can ask questions (and answering questions there is also a way to contribute.) All of it is \u003ca href=\"https://community.kde.org/Get_Involved\" rel=\"ugc\"\u003edocumented\u003c/a\u003e. When triaging, I am trying to more often tag bugs in bugzilla as \"junior jobs\" to make things more approachable. Mentoring etc. is a community effort, and those who are willing to learn will receive help, though we're all rather busy so we hope people put some effort into trying to learn things too, of course.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow could bug reporting be improved?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eI think we could half-automate bug reports, to make things easier: Gather basic information and ask basic questions upfront, without needing to open a web browser. For crash reports, we use a tool called \u003ca href=\"https://invent.kde.org/plasma/drkonqi\" rel=\"ugc\"\u003eDrKonqi\u003c/a\u003e: When app crashes, it gathers backtraces etc. automagically and allows the user to type what happened in a field. Something similar for regular ol' bugs would be great. Games do this with taking screenshots and logs when player opens the bug-report tool. But someone would still have to go through them, which is also an excellent way for anyone to contribute: Go through some bug reports, see if you can reproduce them or not, and report back to it with your system information. \u003cem\u003eAnyone\u003c/em\u003e can do it, it's not a difficult job, just a bit tedious, especially when there's thousands of bug reports and 10 people going through them.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow do you approach problem solving?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDepends on the problem! If a bug causes a crash, a backtrace is usually helpful. If not, I go with trusty print-debugging to see exactly where things start acting weird. I like to approach it from many different angles at same time:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSometimes I try to fix the bug to figure it out: Why does a given change fix the bug? \u003cstrong\u003eThe fix may not be the correct fix yet.\u003c/strong\u003e\n\u003c/li\u003e\n\u003cli\u003eOf course, a well written bugreport with good reproduction steps helps a lot!\u003c/li\u003e\n\u003cli\u003e\n\u003ccode\u003egit blame\u003c/code\u003e is a good friend, asking people who implemented things can really help. But sometimes I work on code where it just says \"moved to git in 2013\" and the original code's from the 90s.\u003c/li\u003e\n\u003cli\u003eTalking to other people\u003c/li\u003e\n\u003cli\u003eWriting notes down as you try to understand the bug\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAnything that pokes your brain in multiple different directions.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eI really like the idea of fixing a bug in multiple ways to really see what's needed. How do you determine whether something is the proper fix or not?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSometimes the code just \"feels right\" or someone more knowledgeable can tell me. Of course, fixing simple visual errors should not need a ton of changes around the codebase. Changes should be proportional to the bug's difficulty/complexity, but there's no clear answer. It's more a gut feeling.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat inspires you to have an online presence (in irc, commenting, blog posts etc.)? How do you decide when to make a blog post or not?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFor blog posts, I ask myself: \"Do I need to remember this?\" Some are just a note for myself, which others might find useful too.\u003c/p\u003e\n\u003cp\u003eI once deleted my lobste.rs account because it took up too much time. Now that all my work is remote, I kind of miss coffee-breaks and office chitchat, so I hang about in IRC, Matrix, Fediverse, Lobsters etc. to fill my Sims status bar. I still prefer remote work, but I wouldn't mind hybrid option at times. Also, removing the lobste.rs bookmark stopped me reflexively clicking it.\u003c/p\u003e\n\u003cp\u003eDue to learning I have ADHD and very likely autism, I have worked on myself (mentally) and internalized that I don't need to constantly go through these sites. Notice the problematic behavior, then cut it out. Whenever I notice I'm stuck in a loop opening and closing the same sites, I've learned to close the web-browser and do something else. The hardest part is actually noticing it.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDo you have any interesting personal tools? I use your \u003ca href=\"https://codeberg.org/akselmo/Revontuli\" rel=\"ugc\"\u003ecolorscheme\u003c/a\u003e.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eI journal a lot on a remarkable2 tablet when working, writing down what I have done, should do or notes figuring out problems. Writing by hand helps me remember things too. I made an RSS \"newspaper\" \u003ca href=\"http://codeberg.org/akselmo/rss2remarkable\" rel=\"ugc\"\u003escript\u003c/a\u003e for my tablet too, which also shows the daily weather now.\u003c/p\u003e\n\u003cp\u003eI also use \u003ca href=\"http://todotxt.org/\" rel=\"ugc\"\u003etodo.txt\u003c/a\u003e for tasks, like my own list of bugs and other projects I need to go through. I even wrote an app for it called \u003ca href=\"https://flathub.org/en/apps/org.kde.komodo\" rel=\"ugc\"\u003eKomoDo\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThen I use Obsidian for any technical notes and know-how, like programming and computer things that are pain to write by hand.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhen did you migrate to \u003ca href=\"codeberg.org/akselmo\" rel=\"ugc\"\u003ecodeberg\u003c/a\u003e?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIt was even before Github started getting \"AI\" stuff. I just got tired of Github being a social media site instead of a good platform. SourceHut would have been nice too, I just didn't know of it at the time. I'm also wary of the email workflow, but wouldn't be opposed to learning it.\u003c/p\u003e\n","description_plain":"I know @Aks from IRC. He works on KDE Software, has made many lovely games and I even use his [colorscheme](https://codeberg.org/akselmo/Revontuli) in my terminal!\r\n\r\n**Please introduce yourself!**\r\n\r\nI'm Akseli but I usually go as [Aks](https://akselmo.dev/about/) on the internet. I'm in my 30s and I'm from Finland. I've liked computers since I was a kid, so naturally I ended up doing computer stuff as a day job. Nowadays I work on KDE software at TechPaladin.\r\n\r\n**How did you first discover computers as a kid?**\r\n\r\nI was 3-4 years old. We had an old 386 DOS computer and I usually played games like Stunts on it. I was always behind when it came to hardware. While all my peers at school would have PS2s, I played on NES and PS1. Over time I just liked to play and tinker with different kinds of machines, mostly old left-over computers. But games were my main hook, I always wanted to make my own. And [I did](https://akselmo.dev/tags/gamedev/)!\r\n\r\n**What were your first games like?**\r\n\r\nMy very first game was with FPS Creator when I was ~13. My friend and I had some inside joke about a game with tons of enemies and a gun with 6 bullets, so I ended up recreating that. The game is _really bad_, but that was sort of the point. The next game I made when I was 18 or so, with Unity. Similar theme, but this time the enemies were dancing and bouncing skeletons, and you had a shotgun. It was so silly. I then made a roguelike, and 3D platformer, and FPS called [Penance](https://akselmo.itch.io/penance) that has about 19k downloads. You can find [my games](https://akselmo.itch.io/) on Itch. Lately though, I haven't had the energy to finish my game projects e.g. Artificial Rage: https://codeberg.org/akselmo/Artificial-Rage\r\n\r\n**I sank a fair few hours into Penance! I also really liked the [Christmas game](https://akselmo.itch.io/holiday-present-hunt) you made your sister. Do you ever put Easter eggs in code or often make projects for others like that?**\r\n\r\nI put some Easter eggs. For example someone complained that in Penance all the weapons look like woolen socks(?). So I added a pair of wooly socks in the starting area. I also proposed to my wife with a game, which had a small hallway with pictures of us. It was a fun little project, but a bit cut short since I tried to work on it as a secret, which proved difficult! We have made a [few](https://tecsiederp.itch.io/still-rose)  [games](https://tecsiederp.itch.io/nebs-island-adventure) together. She went to a web-dev bootcamp but doesn't code anymore, although she gladly works with me on various game projects.\r\n\r\n**How do you ideate the game play, style and such things?**\r\n\r\nWhile playing, I usually think it \"would be cool if I had this game but changed this and that..\" which provides a great starting point. Then it just naturally evolves into it's own thing. Penance was pretty much me going \"I want Quake but with random generated levels\" but then I ended up making a campaign with handcrafted levels to it anyway, beside the random generated endless mode.\r\n\r\nReally, I just make things _I_ want to play. People liking it is just a bonus. One of my favorite game projects is [Castle Rodok](https://akselmo.itch.io/castle-rodok) because it is full of lore about my own RPG world. It's not very popular, but I like it a lot. It was a passion project.\r\n\r\n**What languages and technologies did you use?**\r\n\r\nWith tools, I'm driven by need more than wants. My day job is all C++, which I'm fine with. I am very much a fan of \"C-style\" languages. They're boring and get the job done. For things I want to get running quick, I usually use Python, which I used a lot in test automation for all kinds of devices. Mostly medical devices so I can't talk about them due to NDAs.\r\n\r\nMost of my games have been in Unity, but [Crypt of Darne](https://akselmo.itch.io/crypt-of-darne) uses Python and I also have played around with [C and Odin](https://akselmo.dev/posts/moving-from-c-to-odin/) for my game projects.\r\n\r\nI have tried LISPs and functional programming languages and such, but I just have hard time with them. Especially with those that propose a completely different syntax for me. I haven't had any projects with Rust but I liked tinkering with it it, besides the `'` lifetime syntax which I easily miss. I am very boring when it comes to programming languages, I like to stick with what I know. I wanderlust about what I can create: Games, apps, systems software, drivers... Many ideas but hardly any time. But work comes first, so I mostly work on KDE things right now. For my own things, If I feel like working on a game, I go with the flow and do that.\r\n\r\n**What was your experience with different OS before finding [KDE](https://kde.org/)?**\r\n\r\nI'd wanted to move on from Windows and dabbled with Linux a bunch, but could never stick to it because I could not play any games I owned in Linux. When I learned that Linux systems can in-fact game, it didn't take me long to switch. At first, I just dual-booted and tested the waters. I tried Linux Mint and Ubuntu, which were fine, but I had some issues with X11 and it's compositing eating all the FPS, so I gave up for a while. 6 months later I tried Kubuntu which worked really well for my needs. After some time I hopped to Fedora KDE, and there I found out that Wayland completely removed the issue with the compositing eating FPS in games. KDE was also very easy to learn and understand. I didn't really need to customize it. Then I found an annoying bug I wanted to fix it and started to contribute.\r\n\r\n**What was the first contribution experience like?**\r\n\r\nI had no idea how to do anything with C++. I learned C from scratch making [Artificial Rage](https://codeberg.org/akselmo/Artificial-Rage), studying how to create a project with CMake and all that, but luckily the internet is full of advice. So I had not used C++ before and just started learning to make that first contribution! I just joined the Matrix chats and asked questions; people were very helpful. Onboarding was great. It wasn't very big though, I just looked at the surrounding code and made my contribution look the part. Feedback in the merge request on Gitlab helped wrap it up. One of my first larger contributions though was adding region and language settings to system settings. This allowed users to change, for example, date-time settings differently than currency. This was mix of C and C++ and was difficult! Diligently reading the docs, looking at similar code and a lot of build-\u003etest-\u003echange-\u003ebuild again... it started to work! Then the reviews helped too. But C++ is such a different beast, I'm still learning it to this day. I'd say I know less C++ and more about problem solving. \r\n\r\nIt also helps that the \"Qt dialect\" of C++ is rather nice. The Qt framework does a lot of the work for you. For example, the signal and slot system or objects having parent objects that clear their children when they're deconstructed. Qt's documentation is also pretty great.\r\n\r\nI'm still learning and don't have much in depth knowledge, but I hate header files. Modifying the same thing (function declarations) in two places makes no sense. It should autogenerate as part of the compilation. I found some such header generating tools, but they go unused and quietly forgotten. I suspect they would confuse language servers too, so it's a tooling issue.\r\n\r\n**What are your thoughts on Linux over all, big things which need changing but no one is working on or nice initiatives which you think will improve things, etc.?**\r\n\r\nThe Linux desktop is getting much, much better and I see a hopeful future. Will it ever be the main OS, like Windows is? Probably not, unless hardware manufacturers/OEM's start installing Linux distros by default, instead of Windows. But I'm hopeful we'll get to 5%-10% worldwide usage. Now that gaming is possible on Linux, a lot of people moved over. Just few weeks ago I installed Bazzite for my friend who has been using Windows forever, but didn't want to use Win11.\r\n\r\nOur next step is to make sure accessibility is up to snuff. At least for KDE, we have an accessibility engineer who is brilliant at their job. Then, I think immutable systems might get more popular. Personally I'm fine with either, but for those who view their computer more as an appliance than a computer, immutable systems are very nice: They allow them to jump from broken state back to working state with ease (select different boot entry at startup).\r\n\r\nComplex software's never done; improvements are always needed. Accessibility means more than just accessibility settings: Make it easy to install, test, run, etc... If Linux desktops can get more hardware manufacturers on board to install Linux desktop as default, that will certainly help too. Also shoutout to the [EndOf10](https://endof10.org/ initiative, when I shared it around to my non-nerdy-friends, they were very curious about Linux desktop and I had an excuse to ramble about it to them! In a nutshell: I am hopeful, but we can't rest on our laurels, we need to stop fighting \"whats the best desktop\" and work together more.\r\n\r\nBTW, if anyone reading this has been Linux curious, go for it! Take a secondary device and play around with it there. And I also want to point out that dont be afraid to contribute to things you like in any way you can, be it software or hardware or actual physical world.\r\n\r\n**How do you see it in light of more phone usage, less desktop usage? Have you any impressions of governments or businesses moving to linux?**\r\n\r\nComputers are still widely used where I live, at least within my generation. Those who game especially often have a desktop PC. It may not be top-of-the-line hardcore gaming rig, but they have one to play a bit of Counter-Strike or similar games.\r\n\r\nPhones are the king of \"basic stuff\" and for many people a tablet functions as a simple internet-appliance. I can only hope that projects like [PostmarketOS](https://postmarketos.org/ will help to keep these tablets and phones working when the regular android updates stop, to ease the avalanche of e-waste.\r\n\r\nWhen it comes to governments and businesses, I wish they did it more. I have heard that in Germany more governments are testing it out. In Finland, I do not know, but I would like to drive more for it.\r\nIt's certainly an area where we should try to help as much as possible as well.\r\n\r\n**How can we (individuals or organizations) help?**\r\n\r\nIndividual users: Make sure to report bugs and issues, and share knowledge. Do not evangelize or push the matter, just say it's something you use and elaborate when people ask. Too many times I've seen people pushed away from using Linux desktop because people are very.. Pushy. As surprising it may be, not many people really care as much as we do!\r\n\r\nOrganizations: Try to adopt more FOSS technologies for daily things, e.g. LibreOffice. Start small.\r\nIt does not need to be an overnight change, just small things here and there.\r\n\r\n**How many resources do you have compared to the demands of everything you are working on?**\r\n\r\nWe're definitely stretched. We always could use more help, though C++ seems to deter that help a bit, which I can understand. But if I could start from scratch, I'm sure anyone can! Besides, more and more projects use QML and Rust. For testing, there's Python.\r\n\r\n**What prerequisites are there for contributing?**\r\n\r\nWe have Matrix chat for new contributors, where people can ask questions (and answering questions there is also a way to contribute.) All of it is [documented](https://community.kde.org/Get_Involved). When triaging, I am trying to more often tag bugs in bugzilla as \"junior jobs\" to make things more approachable. Mentoring etc. is a community effort, and those who are willing to learn will receive help, though we're all rather busy so we hope people put some effort into trying to learn things too, of course.\r\n\r\n**How could bug reporting be improved?**\r\n\r\nI think we could half-automate bug reports, to make things easier: Gather basic information and ask basic questions upfront, without needing to open a web browser. For crash reports, we use a tool called [DrKonqi](https://invent.kde.org/plasma/drkonqi): When app crashes, it gathers backtraces etc. automagically and allows the user to type what happened in a field. Something similar for regular ol' bugs would be great. Games do this with taking screenshots and logs when player opens the bug-report tool. But someone would still have to go through them, which is also an excellent way for anyone to contribute: Go through some bug reports, see if you can reproduce them or not, and report back to it with your system information. _Anyone_ can do it, it's not a difficult job, just a bit tedious, especially when there's thousands of bug reports and 10 people going through them.\r\n\r\n**How do you approach problem solving?**\r\n\r\nDepends on the problem! If a bug causes a crash, a backtrace is usually helpful. If not, I go with trusty print-debugging to see exactly where things start acting weird. I like to approach it from many different angles at same time: \r\n\r\n- Sometimes I try to fix the bug to figure it out: Why does a given change fix the bug? **The fix may not be the correct fix yet.** \r\n- Of course, a well written bugreport with good reproduction steps helps a lot!\r\n-  `git blame` is a good friend, asking people who implemented things can really help. But sometimes I work on code where it just says \"moved to git in 2013\" and the original code's from the 90s. \r\n- Talking to other people\r\n- Writing notes down as you try to understand the bug\r\n\r\nAnything that pokes your brain in multiple different directions.\r\n\r\n**I really like the idea of fixing a bug in multiple ways to really see what's needed. How do you determine whether something is the proper fix or not?**\r\n\r\nSometimes the code just \"feels right\" or someone more knowledgeable can tell me. Of course, fixing simple visual errors should not need a ton of changes around the codebase. Changes should be proportional to the bug's difficulty/complexity, but there's no clear answer. It's more a gut feeling.\r\n\r\n**What inspires you to have an online presence (in irc, commenting, blog posts etc.)? How do you decide when to make a blog post or not?**\r\n\r\nFor blog posts, I ask myself: \"Do I need to remember this?\" Some are just a note for myself, which others might find useful too. \r\n\r\nI once deleted my lobste.rs account because it took up too much time. Now that all my work is remote, I kind of miss coffee-breaks and office chitchat, so I hang about in IRC, Matrix, Fediverse, Lobsters etc. to fill my Sims status bar. I still prefer remote work, but I wouldn't mind hybrid option at times. Also, removing the lobste.rs bookmark stopped me reflexively clicking it.\r\n\r\nDue to learning I have ADHD and very likely autism, I have worked on myself (mentally) and internalized that I don't need to constantly go through these sites. Notice the problematic behavior, then cut it out. Whenever I notice I'm stuck in a loop opening and closing the same sites, I've learned to close the web-browser and do something else. The hardest part is actually noticing it.\r\n\r\n**Do you have any interesting personal tools? I use your [colorscheme](https://codeberg.org/akselmo/Revontuli).**\r\n\r\nI journal a lot on a remarkable2 tablet when working, writing down what I have done, should do or notes figuring out problems. Writing by hand helps me remember things too. I made an RSS \"newspaper\" [script]( http://codeberg.org/akselmo/rss2remarkable) for my tablet too, which also shows the daily weather now.\r\n\r\nI also use [todo.txt](http://todotxt.org/) for tasks, like my own list of bugs and other projects I need to go through. I even wrote an app for it called [KomoDo](https://flathub.org/en/apps/org.kde.komodo).\r\n\r\nThen I use Obsidian for any technical notes and know-how, like programming and computer things that are pain to write by hand.\r\n\r\n**When did you migrate to [codeberg](codeberg.org/akselmo)?**\r\n\r\nIt was even before Github started getting \"AI\" stuff. I just got tired of Github being a social media site instead of a good platform. SourceHut would have been nice too, I just didn't know of it at the time. I'm also wary of the email workflow, but wouldn't be opposed to learning it.","submitter_user":"veqq","user_is_author":true,"tags":["person"],"short_id_url":"https://lobste.rs/s/h4yblg","comments_url":"https://lobste.rs/s/h4yblg/lobsters_interview_with_aks"},{"short_id":"bsrsxo","created_at":"2025-12-04T20:01:48.000-06:00","title":"Do we understand SQL?","url":"https://youtu.be/qiVUf9X6ItM?t=4357","score":1,"flags":0,"comment_count":0,"description":"","description_plain":"","submitter_user":"jamii","user_is_author":false,"tags":["databases","video"],"short_id_url":"https://lobste.rs/s/bsrsxo","comments_url":"https://lobste.rs/s/bsrsxo/do_we_understand_sql"},{"short_id":"lsdpq6","created_at":"2025-12-04T18:32:56.000-06:00","title":"Stacktower: An Accidental Deep Dive","url":"https://stacktower.io/","score":2,"flags":0,"comment_count":0,"description":"","description_plain":"","submitter_user":"bramh","user_is_author":false,"tags":["compsci"],"short_id_url":"https://lobste.rs/s/lsdpq6","comments_url":"https://lobste.rs/s/lsdpq6/stacktower_accidental_deep_dive"},{"short_id":"cbyhwk","created_at":"2025-12-04T17:19:14.000-06:00","title":"This Month in Redox - November 2025","url":"https://www.redox-os.org/news/this-month-251130/","score":8,"flags":0,"comment_count":2,"description":"","description_plain":"","submitter_user":"gnafuthegreat","user_is_author":false,"tags":["osdev","rust"],"short_id_url":"https://lobste.rs/s/cbyhwk","comments_url":"https://lobste.rs/s/cbyhwk/this_month_redox_november_2025"},{"short_id":"ava9gi","created_at":"2025-12-04T17:05:23.000-06:00","title":"Django 6.0 release notes","url":"https://docs.djangoproject.com/en/6.0/releases/6.0/","score":1,"flags":0,"comment_count":1,"description":"","description_plain":"","submitter_user":"pauloxnet","user_is_author":false,"tags":["python","release","web"],"short_id_url":"https://lobste.rs/s/ava9gi","comments_url":"https://lobste.rs/s/ava9gi/django_6_0_release_notes"},{"short_id":"lh0bt6","created_at":"2025-12-04T16:59:49.000-06:00","title":"State of AI: An Empirical 100 Trillion Token Study with OpenRouter","url":"https://openrouter.ai/state-of-ai","score":3,"flags":0,"comment_count":1,"description":"","description_plain":"","submitter_user":"wrs","user_is_author":false,"tags":["vibecoding"],"short_id_url":"https://lobste.rs/s/lh0bt6","comments_url":"https://lobste.rs/s/lh0bt6/state_ai_empirical_100_trillion_token"},{"short_id":"d5jx09","created_at":"2025-12-04T16:20:47.000-06:00","title":"What is a Package Manager?","url":"https://nesbitt.io/2025/12/02/what-is-a-package-manager.html","score":3,"flags":0,"comment_count":0,"description":"","description_plain":"","submitter_user":"ubernostrum","user_is_author":false,"tags":["programming","security"],"short_id_url":"https://lobste.rs/s/d5jx09","comments_url":"https://lobste.rs/s/d5jx09/what_is_package_manager"},{"short_id":"8sxs7x","created_at":"2025-12-04T16:20:17.000-06:00","title":"Designing for Observability: From Noise To Insight","url":"https://www.youtube.com/watch?v=KGPX3-xasK8","score":1,"flags":0,"comment_count":0,"description":"","description_plain":"","submitter_user":"355E3B","user_is_author":false,"tags":["design","video"],"short_id_url":"https://lobste.rs/s/8sxs7x","comments_url":"https://lobste.rs/s/8sxs7x/designing_for_observability_from_noise"},{"short_id":"x7glis","created_at":"2025-12-04T15:46:54.000-06:00","title":"jujutsu v0.36.0 released","url":"https://github.com/jj-vcs/jj/releases/tag/v0.36.0","score":46,"flags":0,"comment_count":5,"description":"","description_plain":"","submitter_user":"mediremi","user_is_author":false,"tags":["release","vcs"],"short_id_url":"https://lobste.rs/s/x7glis","comments_url":"https://lobste.rs/s/x7glis/jujutsu_v0_36_0_released"},{"short_id":"7saw1o","created_at":"2025-12-04T15:23:56.000-06:00","title":"8086 Microcode Explorer","url":"https://nand2mario.github.io/8086_microcode.html","score":5,"flags":0,"comment_count":0,"description":"","description_plain":"","submitter_user":"lorddimwit","user_is_author":false,"tags":["hardware"],"short_id_url":"https://lobste.rs/s/7saw1o","comments_url":"https://lobste.rs/s/7saw1o/8086_microcode_explorer"},{"short_id":"xisyov","created_at":"2025-12-04T15:12:03.000-06:00","title":"What is better: a lookup table or an enum type?","url":"https://www.cybertec-postgresql.com/en/lookup-table-or-enum-type/","score":7,"flags":0,"comment_count":1,"description":"","description_plain":"","submitter_user":"eduard","user_is_author":false,"tags":["databases"],"short_id_url":"https://lobste.rs/s/xisyov","comments_url":"https://lobste.rs/s/xisyov/what_is_better_lookup_table_enum_type"}]