[{"short_id":"dghv8d","short_id_url":"https://lobste.rs/s/dghv8d","created_at":"2024-02-23T09:02:54.000-06:00","title":"Please Make Your Table Headings Sticky","url":"https://btxx.org/posts/Please_Make_Your_Table_Headings_Sticky/","score":1,"flags":0,"comment_count":0,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/dghv8d/please_make_your_table_headings_sticky","submitter_user":{"username":"bt","created_at":"2022-09-23T07:06:36.000-05:00","is_admin":false,"about":"UX designer / developer passionate about usability and software freedom.","is_moderator":false,"karma":418,"avatar_url":"/avatars/bt-100.png","invited_by_user":"galaiko"},"user_is_author":true,"tags":["web"]},{"short_id":"kz0jpg","short_id_url":"https://lobste.rs/s/kz0jpg","created_at":"2024-02-23T08:32:26.000-06:00","title":"Everyone seems to forget why GNOME and GNOME 3 and Unity happened (2022)","url":"https://liam-on-linux.dreamwidth.org/85359.html","score":4,"flags":0,"comment_count":0,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/kz0jpg/everyone_seems_forget_why_gnome_gnome_3","submitter_user":{"username":"drs","created_at":"2015-11-24T15:34:32.000-06:00","is_admin":false,"about":"","is_moderator":false,"karma":916,"avatar_url":"/avatars/drs-100.png","invited_by_user":"brynet"},"user_is_author":false,"tags":["design","historical","linux"]},{"short_id":"w3zkxx","short_id_url":"https://lobste.rs/s/w3zkxx","created_at":"2024-02-23T08:31:37.000-06:00","title":"Lobsters interview with Bjorn Stahl","url":"","score":11,"flags":0,"comment_count":1,"description":"\u003cp\u003eAfter \u003ca href=\"https://lobste.rs/~PhantomZorba\" rel=\"ugc\"\u003e@PhantomZorba\u003c/a\u003e did the \u003ca href=\"https://lobste.rs/s/ttr8op/lobsters_interview_with_david_chisnall\" rel=\"ugc\"\u003einterview with me last month\u003c/a\u003e we decided to try to make the lobste.rs interview series a relay, where each interviewee then interviews someone else.  Picking a single person from this community is hard, but \u003ca href=\"https://arcan-fe.com\" rel=\"ugc\"\u003eArcan\u003c/a\u003e is the project that I wish I had the time, expertise, and patience to have written, so I had to choose \u003ca href=\"https://lobste.rs/~crazyloglad\" rel=\"ugc\"\u003e@crazyloglad\u003c/a\u003e.\u003c/p\u003e\n\u003cstrong\u003eIntroduce yourself, describe what you do for work and how long you’ve been at it.\u003c/strong\u003e\n\u003cp\u003eHello! For the last few years I have been an independent contractor working with smaller startups in information security. I have just finished a longer engagement into hardware reversing and am taking something of a breather doing more playful things. On the open-source side of the world, I am the architect and lead engineer of the Arcan project.\u003c/p\u003e\n\u003cp\u003eThere are paper trails that say I am a software engineer, yet others that say I am a computer scientist. For me, I tend to stick with the term ‘reverser’; it means little to most but much to a few and the few tend to interest me more than the many.\u003c/p\u003e\n\u003cp\u003eMy background in computing is life-long. I am a child of the personal computing era. My conversations with the Commodore 64 happened much too early, starting with the Usborne Publishing ‘Computer Battlegames’ book and continued into devouring anything the local library could provide thereafter, picking up English in the process. This took place in a small village close to the 56th parallel north where computers were mostly dismissed as witchcraft and being accused of performing witchcraft didn’t make life any easier.\u003c/p\u003e\n\u003cp\u003eI will try and fail to keep this short, condensing the last three decades into three pivotal moments. The first moment from my preteens-into-teens was emulation. With home consoles becoming more prevalent I got curious as to why games on one system wouldn’t run on another, especially not on my own beloved computer: Isn’t it all just code? I started asking around in the circle of much older explorers and penpals and got a cursory explanation that it was difficult and unreasonable. That sounded like just my thing. Someone handed me a printout of phone numbers to ‘Bulletin Boards’ which led to heavier drugs like FidoNet and a small world suddenly became very large and down the rabbit hole I went.\u003c/p\u003e\n\u003cp\u003eThe second pivot was the PhD thing. I enrolled at university to try and get some structure to the chaos of being primarily autodidactic. It was a small university that had the reputation of being a place for ‘hackers’ through the ‘software engineering’ disguise. For a small pocket of time the student housing area was a sight to behold, and every scene from cracking to osdev to demos to gamedev was represented in abundance. There was an offer of a place to work in a lab, coding 3D engines and visualizations for demonstrators of autonomous coordination of naval vessels and submarines and things like that. I built something of a repertoire with the professor that was pulling the strings, which started the doctoral journey. My main interest was (and remains) debugging when things grow large, complex and distributed. Following the money meant that the best fit at the time was SCADA for critical infrastructure, and the consequences when energy systems would need to be restructured to deal with consumers also being producers and you can no longer hide behind the lie of control systems being ‘air-gapped’. In that context nobody would listen if you talked debugging, so I had to flip the switch to talk about security.\u003c/p\u003e\n\u003cp\u003eThe third pivot was first an industrial collaboration that turned into employment at a tiger-team (the ‘Men in Black’) at Sony-Ericsson, now SONY Mobile. This happened just before the transition from feature-phones into smartphones. This group dealt with putting out fires, meaning critical bugs that others had given up on but meant the death of a product or possibly the company if it caused device returns. The margins were razor thin; if you could save a few cents on the BOM by not having a MMU and process isolation, you saved a few cents on the BOM. A close friend and I tried to distil some of these lessons into trainings and a university course on the subject, with the ‘NDA friendly’ version still around on the Internet somewhere under the idea of ‘Systemic Software Debugging’ which I hope to revisit someday in a more approachable format.\u003c/p\u003e\n\u003cstrong\u003eWhat is your work/computing environment like?\u003c/strong\u003e\n\u003cp\u003eVery compartmentalised.\u003c/p\u003e\n\u003cp\u003eMy house is less of a house and more of a daycare for forever young techies. I have one lab for coding with a big desktop and a lot of ‘one purpose devices’, novelty displays and input tech. Of note is a small cluster of ephemeral devices that boot from preset images and run some software that I need but deeply distrust (like web browsers). These reset and re-image (saving raw-disk diffs if something strange happens) and map into tabs, though the windowing scheme used is quite different.\u003c/p\u003e\n\u003cp\u003eI work offline with ‘bare minimal’ editor and man pages instead of IDEs and autocompletion as I tend to, paraphrasing James Mickens, break my tools with my tools.\u003c/p\u003e\n\u003cp\u003eAnother lab doubles as a home theater. This is used for VR and general controlled environment ‘audio/video’ testing. The more playful things happen in the basement area around pinball machines and DIY arcade games. Pinballs are great fun for computer-vision like experiments. The latest addition is a more controlled space for lower level hardware work - with the usual scopes, some laser ‘cutters’, CNCs, 3D printers and so on.\u003c/p\u003e\n\u003cp\u003eI also rely on printing things on paper and scribble. I always carry at least one notebook or e-Ink notetaker. There is also something almost purifying when later shredding and incinerating the evidence. When travelling, commuting or just hiding in a pub or bar for a change of scenery I nowadays tend to use AR glasses hooked up to a steam deck or laptop.\u003c/p\u003e\n\u003cstrong\u003eAt some point it appears that you decided to rewrite the *NIX graphics stack from scratch, how did that happen?\u003c/strong\u003e\n\u003cp\u003eReluctantly and regrettably. Knowing what I know today I probably would not have bothered. I approach ‘system graphics’ from an angle of signal processing and queueing theory (IPC systems) rather than what most think of as ‘graphics’. In that sense we are mixing and resampling signals much more than drawing pixels. Very little of the actual work is modern graphics, and I am artificially constrained by the capability ‘sweet-spot’ of the first generation Raspberry Pi.\u003c/p\u003e\n\u003cp\u003eThis is done in order to get away from the influence of GPUs that only a few can build and comprehend, and to be able to work on simpler dedicated processors that many more can design and build. Many architectural decisions in Arcan are explicitly to begin the painful decoupling from proprietary GPUs. The modern GPU ecosystem is highly abusive and deliberately user unfriendly yet is in a place where it is actually running the show. I don’t like that.\u003c/p\u003e\n\u003cp\u003eThere is also a personal story of trying to build the panopticon of debugging. With that I mean ‘observing and experimenting’ with the Rube Goldberg contraption of what we unknowingly build by smashing pieces of software together. Even though the individual pieces can sometimes be formally proven to work and then actually made to work, the solutions that we end up with often solves some problem in a very convoluted way, but we lack the faculties to see it. Part of the reason for that is a tooling problem.\u003c/p\u003e\n\u003cp\u003eThis coincides with the other side of the same coin. What I am trying to achieve with the Arcan project, and the sole reason any of this is public, is that I want to string together some of the frayed threads of our history. With that I mean to resurrect some of what we lost from the personal computer era where you just ‘powered on and started to code’ as a means of exploring computing. This is not meant as a retrocomputing romance. The output should be more capable than what we already have, not less. There are other and far more interesting and intimate webs to uncover than the ones we have, Ted Nelson even said as much.\u003c/p\u003e\n\u003cp\u003eThis is also why I keep aiming that any layer follows the model of having agency be defined and scriptable in Lua - which I find to be a more civilized take on BASIC. Lua is a fair vantage point for working towards the abstract if that is your thing, but also for digging further down the stack. The target audience is not so much the developers that are, as much as the ones that should come. For that aim to have any chance of success at all, controlling the tactile, the aural and the visual need to be much more approachable and many still start their journey programming games.\u003c/p\u003e\n\u003cstrong\u003eYou mentioned that you sometime regret going down the path of building a new display system, if you could give one piece of advice to your younger self, what would it be?\u003c/strong\u003e\n\u003cp\u003eBecause you asked for one, I will provide two – mainly because the most important one is really short: Disseminate earlier. The distance from what has been done and where my mental model currently sits compared to what is written down or published is several years. I was afraid of stepping on toes even though I should be crushing feet. There are good reasons as to why I couldn’t, but that doesn’t invalidate the fact that I was overly careful and have been paying the price ever since.\u003c/p\u003e\n\u003cp\u003eThe real ‘one’ would be to stick to the first plan for the integration story. For a long time I simply used Xorg as the user space portion of the display driver and had all my bits and pieces running as the one and only full screen surface, just disable its native socket after setup and done. There was simply not much to gain from trying to use the lower level interfaces as they were being split out and refactored away from Xorg. I have easily wasted years trying to untangle issues caused by subtle changes to that neverending refactoring story and the building blocks are still woefully incomplete.\u003c/p\u003e\n\u003cp\u003eAt the same time I maintained a private, less than friendly version of Android that swapped out parts of their stack for mine using all the tricks in the offensive software engineering playbook. This was abandoned a long time ago and I shouldn’t have done so. Part of the reason I did was the fallout from witnessing FirefoxOS from a front row seat. The architecture I was trying to push would have had a much better chance (still dangerously close to zero). In the end that would have been a much more fruitful path than the FreeDesktop one, which could have been retrofitted much later. The strategic position of having a seemless transition away from the Android we know today that isn’t hinged on whole-system virtualization would have been very valuable.\u003c/p\u003e\n\u003cstrong\u003eYou said that part of your goal is tying together the frayed threads of history. In computing, there are a lot of paths that were abandoned for various reasons that you may no longer apply. What idea would you most like to see resurrected from computing history?\u003c/strong\u003e\n\u003cp\u003eThe old quip about the future already being here, just not evenly distributed applies to the past as well. In that sense I think there is little that has actually gone away, merely drifted out of sight until the next opportune cycle. Just consider how many rounds of ebb and flow we have had for AI, Virtualization and Centralized-shared versus Distributed-single user.\u003c/p\u003e\n\u003cp\u003eThe framing I would like to see is webs of personal computing. In this sense the ‘app’ is a topic of interest originating at the individual by default, but invites, or even mandates, collaboration around said topic (or a slice thereof).\u003c/p\u003e\n\u003cp\u003eHere, the economy should be around active participation rather than the current default of a quiet (or in twitch.tv - loud but saying nothing) mass which observes, takes note and punishes or rewards the central figurehead while simultaneously fighting to take the spotlight, which encourages censorship over attenuating a message.\u003c/p\u003e\n\u003cp\u003eWith modern hardware and communications, local content and links can be much more dynamic and interactive. Within it I want to see the ‘living document’ revisited as a communal scratchpad.\u003c/p\u003e\n\u003cp\u003eThis would land closer to a continuation of where the BBS model meets Xanadu with an internal representation closer to that of NeWS and Display Postscript with overlays for alternate presentation to account for accessibility. It would warrant other solutions than ‘cloud central’ web for a number of interesting areas across the board: from authenticated identity to search and retrieval, but especially for the principal building block that is ‘the link’.\u003c/p\u003e\n\u003cp\u003eDone wrong (URL) the link is merely an web-ABI conforming RPC call or (symlink) a reference to a data assumption (“everything” is a file schtick). If so, ancillary systems chime in and compensate for abandoned opportunity. That is how you get “advertisement and 3rd party cookies”, man-in-the-middle “shorteners” and so on. Just as the dynamics would change if the one being linked contractually knows who linked to them, the rules we bake in here has a profound systemic effect.\u003c/p\u003e\n\u003cstrong\u003eIf you could make all OS kernels include one feature, and have compatible implementations supported everywhere, what would it be?\u003c/strong\u003e\n\u003cp\u003eI think the pragmatic reality of dealing with- and sustaining- legacy while also paving the way for new things is the most important part for the kernel to play and curate, so this is really for the popular user facing kernels and not more research, nostalgia or server specialized ones. The biggest problem I have right now is not the lack of any singular feature, but how the current ones are exposed.\u003c/p\u003e\n\u003cp\u003eThe single most expensive and needlessly painful parts have been working with capabilities and resource identifier tokens, whatever we call them (HANDLEs, file descriptors). The POSIX ones are worst in class, much thanks to the sparse allocation requirement but also thanks to the staggered evolution of all the support functions that comes with it. This is worse in graphics where you might need to juggle tens of tokens to cover even a single image frame. Connected to this is process and thread creation but that is only part of the story. Inheriting a complex set of states as per fork() is bad, but the other side of the very verbose ‘CreateProcessEx’ or ‘posix_spawn’ is not that much better.\u003c/p\u003e\n\u003cp\u003eWhat I want from the OS is a better and coherent interface for specifying short lived, language runtime agnostic and specialized compute, especially as we are getting more FPGAs, DSPs, and so on. Having one interface for FPGAs, a handful for GPUs, others for tracing then to try and specify the compute, lifecycle, resource access permissions, data transfer and error handling conditions over things as unrefined and inefficient as kill, mmap, mprotect, madvise, read, write, exec etc. is soul-crushing to say the least.\u003c/p\u003e\n\u003cstrong\u003eI found a lot of the low level bits of the open source graphics stacks very hard to understand, what would you recommend for someone wanting to get started in this area?\u003c/strong\u003e\n\u003cp\u003eA challenge in unpacking the graphic stack is that it is not in a single discrete place, but smeared all over. Surprisingly little is actually ‘inside’ the display server API or display server itself.\u003c/p\u003e\n\u003cp\u003eMuch more live in the accelerated graphics API, and how it talks to kernel devices (this is MESA and through it, KMS/GBM or HWC/Gralloc in Android). That said, MESA has many faces and while the public ones relate to the many versions and extensions of GL and Vulkan, that is only part of the story. For the actual ‘graphics’ part, that is the place to study or use as reference. Note that the MESA codebase started around 1993 with all that entails. It’s not an easy read.\u003c/p\u003e\n\u003cp\u003eWhat I think is the best course of action depends a bit on where you current intuition took a wrong turn. The most common one in my experience is the mistake of thinking of a ‘framebuffer’ that you batch write ‘pixels’ into, binned by some discrete synchronization signal (‘vsynch’, ‘vblank’, …). This is common because that is often at least part of what higher level graphics API used to offer the developer.\u003c/p\u003e\n\u003cp\u003eThe printer was, and is, a more accurate model. Just as there was good reason for why the printer server part of Xorg fell out of favour, there was good reason for why it was there in the first place.\u003c/p\u003e\n\u003cp\u003eWe still queue deeply paginated batches of draw commands to a strange and foreign device that looks at colours very differently from what we do; papers still get stuck; often we want to cancel a dispatched job because it contained the wrong thing or something changed; render times vary wildly for unclear reasons and so on. The display server do to render jobs what the printer spooler did to print jobs.\u003c/p\u003e\n\u003cp\u003eFor the real system graphics experience however, pick a single usecase in normal desktop use that is common. The one that I prefer when comparing is ‘drag resizing’ a window as it really gives every subsystem a good shake. This is where you will find the biggest divergence between solutions and near every design decision comes into scrutiny.\u003c/p\u003e\n","description_plain":"After @PhantomZorba did the [interview with me last month](https://lobste.rs/s/ttr8op/lobsters_interview_with_david_chisnall) we decided to try to make the lobste.rs interview series a relay, where each interviewee then interviews someone else.  Picking a single person from this community is hard, but [Arcan](https://arcan-fe.com) is the project that I wish I had the time, expertise, and patience to have written, so I had to choose @crazyloglad.\r\n\r\n\r\n# Introduce yourself, describe what you do for work and how long you’ve been at it.\r\n\r\nHello! For the last few years I have been an independent contractor working with smaller startups in information security. I have just finished a longer engagement into hardware reversing and am taking something of a breather doing more playful things. On the open-source side of the world, I am the architect and lead engineer of the Arcan project.\r\n\r\nThere are paper trails that say I am a software engineer, yet others that say I am a computer scientist. For me, I tend to stick with the term ‘reverser’; it means little to most but much to a few and the few tend to interest me more than the many.\r\n\r\nMy background in computing is life-long. I am a child of the personal computing era. My conversations with the Commodore 64 happened much too early, starting with the Usborne Publishing ‘Computer Battlegames’ book and continued into devouring anything the local library could provide thereafter, picking up English in the process. This took place in a small village close to the 56th parallel north where computers were mostly dismissed as witchcraft and being accused of performing witchcraft didn’t make life any easier.\r\n\r\nI will try and fail to keep this short, condensing the last three decades into three pivotal moments. The first moment from my preteens-into-teens was emulation. With home consoles becoming more prevalent I got curious as to why games on one system wouldn’t run on another, especially not on my own beloved computer: Isn’t it all just code? I started asking around in the circle of much older explorers and penpals and got a cursory explanation that it was difficult and unreasonable. That sounded like just my thing. Someone handed me a printout of phone numbers to ‘Bulletin Boards’ which led to heavier drugs like FidoNet and a small world suddenly became very large and down the rabbit hole I went.\r\n\r\nThe second pivot was the PhD thing. I enrolled at university to try and get some structure to the chaos of being primarily autodidactic. It was a small university that had the reputation of being a place for ‘hackers’ through the ‘software engineering’ disguise. For a small pocket of time the student housing area was a sight to behold, and every scene from cracking to osdev to demos to gamedev was represented in abundance. There was an offer of a place to work in a lab, coding 3D engines and visualizations for demonstrators of autonomous coordination of naval vessels and submarines and things like that. I built something of a repertoire with the professor that was pulling the strings, which started the doctoral journey. My main interest was (and remains) debugging when things grow large, complex and distributed. Following the money meant that the best fit at the time was SCADA for critical infrastructure, and the consequences when energy systems would need to be restructured to deal with consumers also being producers and you can no longer hide behind the lie of control systems being ‘air-gapped’. In that context nobody would listen if you talked debugging, so I had to flip the switch to talk about security.\r\n\r\nThe third pivot was first an industrial collaboration that turned into employment at a tiger-team (the ‘Men in Black’) at Sony-Ericsson, now SONY Mobile. This happened just before the transition from feature-phones into smartphones. This group dealt with putting out fires, meaning critical bugs that others had given up on but meant the death of a product or possibly the company if it caused device returns. The margins were razor thin; if you could save a few cents on the BOM by not having a MMU and process isolation, you saved a few cents on the BOM. A close friend and I tried to distil some of these lessons into trainings and a university course on the subject, with the ‘NDA friendly’ version still around on the Internet somewhere under the idea of ‘Systemic Software Debugging’ which I hope to revisit someday in a more approachable format.\r\n\r\n\r\n# What is your work/computing environment like?\r\n\r\nVery compartmentalised.\r\n\r\nMy house is less of a house and more of a daycare for forever young techies. I have one lab for coding with a big desktop and a lot of ‘one purpose devices’, novelty displays and input tech. Of note is a small cluster of ephemeral devices that boot from preset images and run some software that I need but deeply distrust (like web browsers). These reset and re-image (saving raw-disk diffs if something strange happens) and map into tabs, though the windowing scheme used is quite different.\r\n\r\nI work offline with ‘bare minimal’ editor and man pages instead of IDEs and autocompletion as I tend to, paraphrasing James Mickens, break my tools with my tools.\r\n\r\nAnother lab doubles as a home theater. This is used for VR and general controlled environment ‘audio/video’ testing. The more playful things happen in the basement area around pinball machines and DIY arcade games. Pinballs are great fun for computer-vision like experiments. The latest addition is a more controlled space for lower level hardware work - with the usual scopes, some laser ‘cutters’, CNCs, 3D printers and so on.\r\n\r\nI also rely on printing things on paper and scribble. I always carry at least one notebook or e-Ink notetaker. There is also something almost purifying when later shredding and incinerating the evidence. When travelling, commuting or just hiding in a pub or bar for a change of scenery I nowadays tend to use AR glasses hooked up to a steam deck or laptop.\r\n\r\n# At some point it appears that you decided to rewrite the *NIX graphics stack from scratch, how did that happen?\r\n\r\nReluctantly and regrettably. Knowing what I know today I probably would not have bothered. I approach ‘system graphics’ from an angle of signal processing and queueing theory (IPC systems) rather than what most think of as ‘graphics’. In that sense we are mixing and resampling signals much more than drawing pixels. Very little of the actual work is modern graphics, and I am artificially constrained by the capability ‘sweet-spot’ of the first generation Raspberry Pi.\r\n\r\nThis is done in order to get away from the influence of GPUs that only a few can build and comprehend, and to be able to work on simpler dedicated processors that many more can design and build. Many architectural decisions in Arcan are explicitly to begin the painful decoupling from proprietary GPUs. The modern GPU ecosystem is highly abusive and deliberately user unfriendly yet is in a place where it is actually running the show. I don’t like that.\r\n\r\nThere is also a personal story of trying to build the panopticon of debugging. With that I mean ‘observing and experimenting’ with the Rube Goldberg contraption of what we unknowingly build by smashing pieces of software together. Even though the individual pieces can sometimes be formally proven to work and then actually made to work, the solutions that we end up with often solves some problem in a very convoluted way, but we lack the faculties to see it. Part of the reason for that is a tooling problem.\r\n\r\nThis coincides with the other side of the same coin. What I am trying to achieve with the Arcan project, and the sole reason any of this is public, is that I want to string together some of the frayed threads of our history. With that I mean to resurrect some of what we lost from the personal computer era where you just ‘powered on and started to code’ as a means of exploring computing. This is not meant as a retrocomputing romance. The output should be more capable than what we already have, not less. There are other and far more interesting and intimate webs to uncover than the ones we have, Ted Nelson even said as much.\r\n\r\nThis is also why I keep aiming that any layer follows the model of having agency be defined and scriptable in Lua - which I find to be a more civilized take on BASIC. Lua is a fair vantage point for working towards the abstract if that is your thing, but also for digging further down the stack. The target audience is not so much the developers that are, as much as the ones that should come. For that aim to have any chance of success at all, controlling the tactile, the aural and the visual need to be much more approachable and many still start their journey programming games.\r\n\r\n# You mentioned that you sometime regret going down the path of building a new display system, if you could give one piece of advice to your younger self, what would it be?\r\n\r\nBecause you asked for one, I will provide two – mainly because the most important one is really short: Disseminate earlier. The distance from what has been done and where my mental model currently sits compared to what is written down or published is several years. I was afraid of stepping on toes even though I should be crushing feet. There are good reasons as to why I couldn’t, but that doesn’t invalidate the fact that I was overly careful and have been paying the price ever since.\r\n\r\nThe real ‘one’ would be to stick to the first plan for the integration story. For a long time I simply used Xorg as the user space portion of the display driver and had all my bits and pieces running as the one and only full screen surface, just disable its native socket after setup and done. There was simply not much to gain from trying to use the lower level interfaces as they were being split out and refactored away from Xorg. I have easily wasted years trying to untangle issues caused by subtle changes to that neverending refactoring story and the building blocks are still woefully incomplete.\r\n\r\nAt the same time I maintained a private, less than friendly version of Android that swapped out parts of their stack for mine using all the tricks in the offensive software engineering playbook. This was abandoned a long time ago and I shouldn’t have done so. Part of the reason I did was the fallout from witnessing FirefoxOS from a front row seat. The architecture I was trying to push would have had a much better chance (still dangerously close to zero). In the end that would have been a much more fruitful path than the FreeDesktop one, which could have been retrofitted much later. The strategic position of having a seemless transition away from the Android we know today that isn’t hinged on whole-system virtualization would have been very valuable.\r\n\r\n# You said that part of your goal is tying together the frayed threads of history. In computing, there are a lot of paths that were abandoned for various reasons that you may no longer apply. What idea would you most like to see resurrected from computing history?\r\n\r\nThe old quip about the future already being here, just not evenly distributed applies to the past as well. In that sense I think there is little that has actually gone away, merely drifted out of sight until the next opportune cycle. Just consider how many rounds of ebb and flow we have had for AI, Virtualization and Centralized-shared versus Distributed-single user.\r\n\r\nThe framing I would like to see is webs of personal computing. In this sense the ‘app’ is a topic of interest originating at the individual by default, but invites, or even mandates, collaboration around said topic (or a slice thereof).\r\n\r\nHere, the economy should be around active participation rather than the current default of a quiet (or in twitch.tv - loud but saying nothing) mass which observes, takes note and punishes or rewards the central figurehead while simultaneously fighting to take the spotlight, which encourages censorship over attenuating a message.\r\n\r\nWith modern hardware and communications, local content and links can be much more dynamic and interactive. Within it I want to see the ‘living document’ revisited as a communal scratchpad.\r\n\r\nThis would land closer to a continuation of where the BBS model meets Xanadu with an internal representation closer to that of NeWS and Display Postscript with overlays for alternate presentation to account for accessibility. It would warrant other solutions than ‘cloud central’ web for a number of interesting areas across the board: from authenticated identity to search and retrieval, but especially for the principal building block that is ‘the link’.\r\n\r\nDone wrong (URL) the link is merely an web-ABI conforming RPC call or (symlink) a reference to a data assumption (“everything” is a file schtick). If so, ancillary systems chime in and compensate for abandoned opportunity. That is how you get “advertisement and 3rd party cookies”, man-in-the-middle “shorteners” and so on. Just as the dynamics would change if the one being linked contractually knows who linked to them, the rules we bake in here has a profound systemic effect.\r\n\r\n\r\n\r\n# If you could make all OS kernels include one feature, and have compatible implementations supported everywhere, what would it be?\r\n\r\nI think the pragmatic reality of dealing with- and sustaining- legacy while also paving the way for new things is the most important part for the kernel to play and curate, so this is really for the popular user facing kernels and not more research, nostalgia or server specialized ones. The biggest problem I have right now is not the lack of any singular feature, but how the current ones are exposed.\r\n\r\nThe single most expensive and needlessly painful parts have been working with capabilities and resource identifier tokens, whatever we call them (HANDLEs, file descriptors). The POSIX ones are worst in class, much thanks to the sparse allocation requirement but also thanks to the staggered evolution of all the support functions that comes with it. This is worse in graphics where you might need to juggle tens of tokens to cover even a single image frame. Connected to this is process and thread creation but that is only part of the story. Inheriting a complex set of states as per fork() is bad, but the other side of the very verbose ‘CreateProcessEx’ or ‘posix_spawn’ is not that much better.\r\n\r\nWhat I want from the OS is a better and coherent interface for specifying short lived, language runtime agnostic and specialized compute, especially as we are getting more FPGAs, DSPs, and so on. Having one interface for FPGAs, a handful for GPUs, others for tracing then to try and specify the compute, lifecycle, resource access permissions, data transfer and error handling conditions over things as unrefined and inefficient as kill, mmap, mprotect, madvise, read, write, exec etc. is soul-crushing to say the least.\r\n\r\n# I found a lot of the low level bits of the open source graphics stacks very hard to understand, what would you recommend for someone wanting to get started in this area?\r\n\r\nA challenge in unpacking the graphic stack is that it is not in a single discrete place, but smeared all over. Surprisingly little is actually ‘inside’ the display server API or display server itself.\r\n\r\nMuch more live in the accelerated graphics API, and how it talks to kernel devices (this is MESA and through it, KMS/GBM or HWC/Gralloc in Android). That said, MESA has many faces and while the public ones relate to the many versions and extensions of GL and Vulkan, that is only part of the story. For the actual ‘graphics’ part, that is the place to study or use as reference. Note that the MESA codebase started around 1993 with all that entails. It’s not an easy read.\r\n\r\nWhat I think is the best course of action depends a bit on where you current intuition took a wrong turn. The most common one in my experience is the mistake of thinking of a ‘framebuffer’ that you batch write ‘pixels’ into, binned by some discrete synchronization signal (‘vsynch’, ‘vblank’, …). This is common because that is often at least part of what higher level graphics API used to offer the developer.\r\n\r\nThe printer was, and is, a more accurate model. Just as there was good reason for why the printer server part of Xorg fell out of favour, there was good reason for why it was there in the first place.\r\n\r\nWe still queue deeply paginated batches of draw commands to a strange and foreign device that looks at colours very differently from what we do; papers still get stuck; often we want to cancel a dispatched job because it contained the wrong thing or something changed; render times vary wildly for unclear reasons and so on. The display server do to render jobs what the printer spooler did to print jobs.\r\n\r\nFor the real system graphics experience however, pick a single usecase in normal desktop use that is common. The one that I prefer when comparing is ‘drag resizing’ a window as it really gives every subsystem a good shake. This is where you will find the biggest divergence between solutions and near every design decision comes into scrutiny.","comments_url":"https://lobste.rs/s/w3zkxx/lobsters_interview_with_bjorn_stahl","submitter_user":{"username":"david_chisnall","created_at":"2020-03-19T12:44:25.000-05:00","is_admin":false,"about":"I am Director of System Architecture at SCI Semiconductor and a Visiting Researcher at the University of Cambridge Computer Laboratory.  I remain actively involved in the [CHERI](http://chericpu.org) project, where I led the early language / compiler strand of the research, and am the maintainer of the [CHERIoT Platform](https://cheriot.org).  \r\n\r\nI was on the FreeBSD Core Team for two terms, have been an LLVM developer since 2008, am the author of the GNUstep Objective-C runtime (libobjc2 and associated clang support), and am responsible for libcxxrt and the BSD-licensed device tree compiler.  \r\n\r\nI am [clearly at least ten people](https://lobste.rs/s/ttr8op/lobsters_interview_with_david_chisnall#c_k16zu8)","is_moderator":false,"karma":26702,"avatar_url":"/avatars/david_chisnall-100.png","invited_by_user":"Drakonis","github_username":"davidchisnall","mastodon_username":"david_chisnall"},"user_is_author":true,"tags":["person"]},{"short_id":"9mqtoh","short_id_url":"https://lobste.rs/s/9mqtoh","created_at":"2024-02-23T08:29:43.000-06:00","title":"Warp, the modern terminal, is now available for Linux","url":"https://www.warp.dev/blog/warp-for-linux","score":-1,"flags":2,"comment_count":5,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/9mqtoh/warp_modern_terminal_is_now_available_for","submitter_user":{"username":"kghose","created_at":"2014-09-03T12:48:11.000-05:00","is_admin":false,"about":"Electrical Engineer, Software writer, fascinated by mathematics, visualizations and the human brain, currently a novice bioinformatician. [Long form articles and coding diary](http://kaushikghose.wordpress.com)\r\n","is_moderator":false,"karma":4219,"avatar_url":"/avatars/kghose-100.png","invited_by_user":"hdevalence"},"user_is_author":false,"tags":["ai","linux","programming"]},{"short_id":"b3ahkj","short_id_url":"https://lobste.rs/s/b3ahkj","created_at":"2024-02-23T07:30:57.000-06:00","title":"Why my code isn't in TypeScript","url":"https://remysharp.com/2024/02/23/why-my-code-isnt-in-typescript","score":6,"flags":0,"comment_count":5,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/b3ahkj/why_my_code_isn_t_typescript","submitter_user":{"username":"carlana","created_at":"2021-07-19T11:55:18.000-05:00","is_admin":false,"about":"Carlana Johnson is a philosopher and programmer, currently employed as the Director of Technology for Spotlight PA.","is_moderator":false,"karma":17055,"avatar_url":"/avatars/carlana-100.png","invited_by_user":"peterbourgon","github_username":"earthboundkid"},"user_is_author":false,"tags":["javascript"]},{"short_id":"fcwczk","short_id_url":"https://lobste.rs/s/fcwczk","created_at":"2024-02-23T05:31:20.000-06:00","title":"What are you doing this weekend?","url":"","score":4,"flags":0,"comment_count":22,"description":"\u003cp\u003eFeel free to tell what you plan on doing this weekend and even ask for help or feedback.\u003c/p\u003e\n\u003cp\u003ePlease keep in mind it’s more than OK to do nothing at all too!\u003c/p\u003e\n","description_plain":"Feel free to tell what you plan on doing this weekend and even ask for help or feedback.\r\n\r\nPlease keep in mind it’s more than OK to do nothing at all too!","comments_url":"https://lobste.rs/s/fcwczk/what_are_you_doing_this_weekend","submitter_user":{"username":"caius","created_at":"2014-05-13T06:58:30.000-05:00","is_admin":false,"about":"Compulsive Geek, Ale Connoisseur, Occasionally Responsible Adult.","is_moderator":false,"karma":9915,"avatar_url":"/avatars/caius-100.png","invited_by_user":"lauris","github_username":"caius"},"user_is_author":true,"tags":["ask","programming"]},{"short_id":"azii4m","short_id_url":"https://lobste.rs/s/azii4m","created_at":"2024-02-23T05:29:49.000-06:00","title":"Thanks FedEx, This is Why we Keep Getting Phished","url":"https://www.troyhunt.com/thanks-fedex-this-is-why-we-keep-getting-phished/","score":23,"flags":1,"comment_count":2,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/azii4m/thanks_fedex_this_is_why_we_keep_getting","submitter_user":{"username":"acatton","created_at":"2015-02-13T18:54:10.000-06:00","is_admin":false,"about":"I'm just a software engineer who likes his job.\r\n\r\nI'm currently a Site Reliability Engineer at Google, Inc.\r\n\r\n**Opinions are my own, and NOT the views of my current or past employers**","is_moderator":false,"karma":3222,"avatar_url":"/avatars/acatton-100.png","invited_by_user":"csantosb","github_username":"acatton"},"user_is_author":false,"tags":["security"]},{"short_id":"jslbix","short_id_url":"https://lobste.rs/s/jslbix","created_at":"2024-02-23T05:02:36.000-06:00","title":"Java FFI vs JNI for Meta's RocksDB Java API","url":"https://rocksdb.org/blog/2024/02/20/foreign-function-interface.html","score":1,"flags":0,"comment_count":0,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/jslbix/java_ffi_vs_jni_for_meta_s_rocksdb_java_api","submitter_user":{"username":"adamretter","created_at":"2018-10-11T03:20:58.000-05:00","is_admin":false,"about":"Software Developer, Open Source, mostly Java, Scala and C++. Database geek: eXist-db and RocksDB. Digital Preservation and Digital Archives.","is_moderator":false,"karma":108,"avatar_url":"/avatars/adamretter-100.png","invited_by_user":"liwakura","github_username":"adamretter"},"user_is_author":true,"tags":["databases","java","performance"]},{"short_id":"2hsgkm","short_id_url":"https://lobste.rs/s/2hsgkm","created_at":"2024-02-23T04:48:36.000-06:00","title":"Building a realtime datalake with Apache Flink, Spark, and Hudi","url":"https://engineering.grab.com/enabling-near-realtime-data-analytics","score":1,"flags":0,"comment_count":0,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/2hsgkm/building_realtime_datalake_with_apache","submitter_user":{"username":"rmoff","created_at":"2018-09-19T03:24:42.000-05:00","is_admin":false,"about":"https://rmoff.info","is_moderator":false,"karma":30,"avatar_url":"/avatars/rmoff-100.png","invited_by_user":"vrthra","github_username":"rmoff"},"user_is_author":false,"tags":["databases","distributed"]},{"short_id":"9xtcun","short_id_url":"https://lobste.rs/s/9xtcun","created_at":"2024-02-23T04:24:30.000-06:00","title":"Complex systems and bridging between spec and implementation","url":"","score":1,"flags":0,"comment_count":4,"description":"\u003cp\u003eI am on the cusp (hopefully) of kicking off development of a fairly large and complex system (multiple integrated services, kafkas involved, background processes, multiple client frontends, etc…). It’s predominantly going to be built in rust (but that’s only trivially relevant; i.e. not following standard OOP).\u003c/p\u003e\n\u003cp\u003eHere’s where i’m at:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eI have defined all the components, services, data stores to use / or develop\u003c/li\u003e\n\u003cli\u003eI have a a fairly concrete conceptualisation of how to structure and manage data on the storage end of the system which i’m formalizing into a specification\u003c/li\u003e\n\u003cli\u003eI have a deployment model for the various parts of the system to go into production\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eThe problem is, I have a gap, from these specs of the individual components and services that need to be built out, to the actual implementation of those services. I’ve scaffolded the code-base around what “feels” like sensible semantics, but bridging from the scope, through the high-level code organisation through to implementation is where I start to get a bit queasy.\u003c/p\u003e\n\u003cp\u003eIn the past, i’ve more or less dove head-first into just starting to implement, but the problem has been that I will very easily end up going in circles, or I end up with a lot of duplicated code across areas and just generally feel like it’s not working out the way I had hoped (obviously because i’ve just gone ahead and implemented).\u003c/p\u003e\n\u003cp\u003eWhat are some tools, processes, design concepts, thinking patterns that you can use to sort of fill in that “last mile” from high-level spec to implementing to try and ensure that things stay on track and limit abandonment or going down dead-ends?\u003c/p\u003e\n\u003cp\u003eI’m interested in advice, articles, books, or anything else that makes sense in the rough context above. Not specifically around for instance design patterns themselves, i’m more than familiar with the tools in that arsenal, but how do you bridge the gap between the concept and the implementation without going too deep down the rabbit-hole of modelling out actual code and everything else in UML for instance? How do you basically minimize getting mired in massive refactors once you get to implementation phase?\u003c/p\u003e\n","description_plain":"I am on the cusp (hopefully) of kicking off development of a fairly large and complex system (multiple integrated services, kafkas involved, background processes, multiple client frontends, etc...). It's predominantly going to be built in rust (but that's only trivially relevant; i.e. not following standard OOP).\r\n\r\nHere's where i'm at:\r\n\r\n1. I have defined all the components, services, data stores to use / or develop\r\n2. I have a a fairly concrete conceptualisation of how to structure and manage data on the storage end of the system which i'm formalizing into a specification\r\n3. I have a deployment model for the various parts of the system to go into production\r\n\r\nThe problem is, I have a gap, from these specs of the individual components and services that need to be built out, to the actual implementation of those services. I've scaffolded the code-base around what \"feels\" like sensible semantics, but bridging from the scope, through the high-level code organisation through to implementation is where I start to get a bit queasy.\r\n\r\nIn the past, i've more or less dove head-first into just starting to implement, but the problem has been that I will very easily end up going in circles, or I end up with a lot of duplicated code across areas and just generally feel like it's not working out the way I had hoped (obviously because i've just gone ahead and implemented).\r\n\r\nWhat are some tools, processes, design concepts, thinking patterns that you can use to sort of fill in that \"last mile\" from high-level spec to implementing to try and ensure that things stay on track and limit abandonment or going down dead-ends?\r\n\r\nI'm interested in advice, articles, books, or anything else that makes sense in the rough context above. Not specifically around for instance design patterns themselves, i'm more than familiar with the tools in that arsenal, but how do you bridge the gap between the concept and the implementation without going too deep down the rabbit-hole of modelling out actual code and everything else in UML for instance? How do you basically minimize getting mired in massive refactors once you get to implementation phase?","comments_url":"https://lobste.rs/s/9xtcun/complex_systems_bridging_between_spec","submitter_user":{"username":"objectif_lune","created_at":"2017-03-27T14:13:09.000-05:00","is_admin":false,"about":"Builder of things and stuff, and some other things.","is_moderator":false,"karma":450,"avatar_url":"/avatars/objectif_lune-100.png","invited_by_user":"flyingfisch","keybase_signatures":[{"kb_username":"jdu","sig_hash":"9c85876b21ddda1c82885c72879baf339b52138441fc8c5fb6ee39c8acdd91150f"}]},"user_is_author":true,"tags":["ask","practices"]},{"short_id":"oxlnqg","short_id_url":"https://lobste.rs/s/oxlnqg","created_at":"2024-02-23T04:19:20.000-06:00","title":"Python Dependencies Are Fixable","url":"https://matduggan.com/everyone-is-wrong-but-you/","score":11,"flags":0,"comment_count":13,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/oxlnqg/python_dependencies_are_fixable","submitter_user":{"username":"maduggan","created_at":"2019-03-13T08:43:38.000-05:00","is_admin":false,"about":"I'm an American sys admin living in Denmark. My posts and opinions are all my own and have nothing to do with my employer. Anyone who thinks I speak on behalf of a business has lost their minds. ","is_moderator":false,"karma":1192,"avatar_url":"/avatars/maduggan-100.png","invited_by_user":"stephen"},"user_is_author":true,"tags":["python","rant"]},{"short_id":"1ll4du","short_id_url":"https://lobste.rs/s/1ll4du","created_at":"2024-02-23T02:48:29.000-06:00","title":"Experiences with building a Gentoo virtualisation host","url":"https://catfox.life/2024/02/23/experiences-with-building-a-gentoo-virtualisation-host/","score":3,"flags":0,"comment_count":1,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/1ll4du/experiences_with_building_gentoo","submitter_user":{"username":"awilfox","created_at":"2019-07-25T21:19:45.000-05:00","is_admin":false,"about":"Linux distro dev.  Contains no phosphors.  Offer not valid where prohibited by law.  Do not taunt Happy Fun Ball.  Takes may be hot; use sufficient insulation.","is_moderator":false,"karma":737,"avatar_url":"/avatars/awilfox-100.png","invited_by_user":"Arcayr","github_username":"awilfox"},"user_is_author":true,"tags":["linux"]},{"short_id":"9ynwji","short_id_url":"https://lobste.rs/s/9ynwji","created_at":"2024-02-22T21:38:16.000-06:00","title":"On Moonpool","url":"https://blag.cedeela.fr/on-moonpool/","score":7,"flags":0,"comment_count":0,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/9ynwji/on_moonpool","submitter_user":{"username":"indigo","created_at":"2015-10-15T11:52:50.000-05:00","is_admin":false,"about":"","is_moderator":false,"karma":864,"avatar_url":"/avatars/indigo-100.png","invited_by_user":"tluyben2"},"user_is_author":false,"tags":["ml"]},{"short_id":"r8kylf","short_id_url":"https://lobste.rs/s/r8kylf","created_at":"2024-02-22T21:06:14.000-06:00","title":"Go 2016-2019: My transition into management","url":"https://ajmani.net/2024/02/22/go-2016-2019/","score":6,"flags":2,"comment_count":3,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/r8kylf/go_2016_2019_my_transition_into","submitter_user":{"username":"benhoyt","created_at":"2020-05-20T17:24:04.000-05:00","is_admin":false,"about":"Software engineer at Canonical. Author of [GoAWK](https://github.com/benhoyt/goawk), a POSIX-compatible AWK interpreter written in Go. Author of Python's [`os.scandir()`](https://peps.python.org/pep-0471/). Husband, father, Christian. See my website at [BenHoyt.com](https://benhoyt.com/).","is_moderator":false,"karma":1697,"avatar_url":"/avatars/benhoyt-100.png","invited_by_user":"mvdan"},"user_is_author":false,"tags":["go"]},{"short_id":"lngkdo","short_id_url":"https://lobste.rs/s/lngkdo","created_at":"2024-02-22T17:21:03.000-06:00","title":"Robust generic functions on slices","url":"https://go.dev/blog/generic-slice-functions","score":5,"flags":0,"comment_count":1,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/lngkdo/robust_generic_functions_on_slices","submitter_user":{"username":"telemachus","created_at":"2012-08-10T12:36:05.000-05:00","is_admin":false,"about":"","is_moderator":false,"karma":2671,"avatar_url":"/avatars/telemachus-100.png","invited_by_user":"jcs"},"user_is_author":false,"tags":["go"]},{"short_id":"mqwlew","short_id_url":"https://lobste.rs/s/mqwlew","created_at":"2024-02-22T16:16:10.000-06:00","title":"Unlocking secret ThinkPad functionality for emulating USB devices","url":"https://xairy.io/articles/thinkpad-xdci","score":25,"flags":0,"comment_count":3,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/mqwlew/unlocking_secret_thinkpad","submitter_user":{"username":"crazyloglad","created_at":"2016-09-06T15:12:29.000-05:00","is_admin":false,"about":"Doing debugging and reversing for coins. Got an unhealthy interest in the interplay between system level graphics, emulators and virtual machines. Can be found lurking on freenode in #arcan, at github.com/letoram and arcan-fe.com","is_moderator":false,"karma":3432,"avatar_url":"/avatars/crazyloglad-100.png","invited_by_user":"nc","github_username":"letoram"},"user_is_author":false,"tags":["hardware"]},{"short_id":"zd7nba","short_id_url":"https://lobste.rs/s/zd7nba","created_at":"2024-02-22T15:42:21.000-06:00","title":"JavaScript Bloat in 2024","url":"https://tonsky.me/blog/js-bloat/","score":78,"flags":0,"comment_count":17,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/zd7nba/javascript_bloat_2024","submitter_user":{"username":"carlana","created_at":"2021-07-19T11:55:18.000-05:00","is_admin":false,"about":"Carlana Johnson is a philosopher and programmer, currently employed as the Director of Technology for Spotlight PA.","is_moderator":false,"karma":17055,"avatar_url":"/avatars/carlana-100.png","invited_by_user":"peterbourgon","github_username":"earthboundkid"},"user_is_author":false,"tags":["javascript","rant"]},{"short_id":"uhwdnk","short_id_url":"https://lobste.rs/s/uhwdnk","created_at":"2024-02-22T15:09:06.000-06:00","title":"openzfs-nvme-databases","url":"https://github.com/letsencrypt/openzfs-nvme-databases","score":7,"flags":0,"comment_count":1,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/uhwdnk/openzfs_nvme_databases","submitter_user":{"username":"williballenthin","created_at":"2020-10-28T11:36:41.000-05:00","is_admin":false,"about":"","is_moderator":false,"karma":452,"avatar_url":"/avatars/williballenthin-100.png","invited_by_user":"insanitybit"},"user_is_author":false,"tags":["databases","devops"]},{"short_id":"oeh7ry","short_id_url":"https://lobste.rs/s/oeh7ry","created_at":"2024-02-22T13:15:39.000-06:00","title":"Compiler Theory and Reactivity","url":"https://www.recompiled.dev/blog/ssa/","score":6,"flags":0,"comment_count":0,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/oeh7ry/compiler_theory_reactivity","submitter_user":{"username":"gsathya","created_at":"2020-07-06T08:40:08.000-05:00","is_admin":false,"about":"V8 engineer","is_moderator":false,"karma":17,"avatar_url":"/avatars/gsathya-100.png","invited_by_user":"arun"},"user_is_author":true,"tags":["compilers"]},{"short_id":"edll1r","short_id_url":"https://lobste.rs/s/edll1r","created_at":"2024-02-22T13:01:59.000-06:00","title":"Incredibly Simple QR Generation in QML","url":"https://www.kdab.com/incredibly-simple-qr-generation-in-qml/","score":4,"flags":0,"comment_count":0,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/edll1r/incredibly_simple_qr_generation_qml","submitter_user":{"username":"raymii","created_at":"2013-11-20T11:58:43.000-06:00","is_admin":false,"about":"🐋\r\nhttps://raymii.org","is_moderator":false,"karma":24958,"avatar_url":"/avatars/raymii-100.png","invited_by_user":"journeysquid"},"user_is_author":false,"tags":["c++","javascript"]},{"short_id":"qbjtey","short_id_url":"https://lobste.rs/s/qbjtey","created_at":"2024-02-22T12:54:03.000-06:00","title":"Stable Diffusion 3","url":"https://stability.ai/news/stable-diffusion-3","score":4,"flags":1,"comment_count":0,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/qbjtey/stable_diffusion_3","submitter_user":{"username":"BiteCode","created_at":"2023-04-04T09:58:38.000-05:00","is_admin":false,"about":"https://bitecode.dev","is_moderator":false,"karma":1265,"avatar_url":"/avatars/BiteCode-100.png","invited_by_user":"stavros"},"user_is_author":false,"tags":["ai"]},{"short_id":"ggviq0","short_id_url":"https://lobste.rs/s/ggviq0","created_at":"2024-02-22T12:46:00.000-06:00","title":"Feeding a Hungry Mouse Using Chromedp and Golang","url":"https://pacenthink.io/post/feeding-a-hungry-mouse-using-chromedp-and-golang/","score":-3,"flags":4,"comment_count":0,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/ggviq0/feeding_hungry_mouse_using_chromedp","submitter_user":{"username":"bhupesh","created_at":"2021-02-17T01:26:25.000-06:00","is_admin":false,"about":"Developer • Tech Writer\r\n---\r\nFind me on [Web](https://bhupesh.me) | [Twitter](https://www.twitter.com/bhupeshimself) | [GitHub](https://github.com/Bhupesh-V)","is_moderator":false,"karma":131,"avatar_url":"/avatars/bhupesh-100.png","invited_by_user":"sathyabhat","github_username":"Bhupesh-V"},"user_is_author":true,"tags":["programming"]},{"short_id":"zlbaql","short_id_url":"https://lobste.rs/s/zlbaql","created_at":"2024-02-22T12:09:46.000-06:00","title":"*(char*)0 = 0; - What Does the C++ Programmer Intend With This Code?","url":"https://www.youtube.com/watch?v=dFIqNZ8VbRY","score":13,"flags":0,"comment_count":0,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/zlbaql/char_0_0_what_does_c_programmer_intend_with","submitter_user":{"username":"jibsen","created_at":"2016-11-13T08:05:42.000-06:00","is_admin":false,"about":"","is_moderator":false,"karma":365,"avatar_url":"/avatars/jibsen-100.png","invited_by_user":"awal","github_username":"jibsen"},"user_is_author":false,"tags":["c++","hardware","video"]},{"short_id":"mgxxki","short_id_url":"https://lobste.rs/s/mgxxki","created_at":"2024-02-22T08:59:08.000-06:00","title":"Cyberbullying Gone Global: Fediverse Spam and Operation Beleaguer","url":"https://blog.fyralabs.com/cyberbullying-gone-global-regarding-the-fediverse-spam-and-operation-beleaguer/","score":17,"flags":2,"comment_count":8,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/mgxxki/cyberbullying_gone_global_fediverse","submitter_user":{"username":"calvin","created_at":"2014-07-01T06:47:13.000-05:00","is_admin":false,"about":"Soon we will all have special names... names designed to make the cathode ray tube resonate.\r\n\r\nDavid Chisnall stan account.","is_moderator":false,"karma":102472,"avatar_url":"/avatars/calvin-100.png","invited_by_user":"nbyouri","github_username":"NattyNarwhal"},"user_is_author":false,"tags":["security"]},{"short_id":"ogsmxo","short_id_url":"https://lobste.rs/s/ogsmxo","created_at":"2024-02-22T08:10:04.000-06:00","title":"Unification-free (\"keyword\") type checking","url":"https://www.haskellforall.com/2024/02/unification-free-keyword-type-checking.html","score":40,"flags":0,"comment_count":15,"description":"","description_plain":"","comments_url":"https://lobste.rs/s/ogsmxo/unification_free_keyword_type_checking","submitter_user":{"username":"Gabriella439","created_at":"2022-05-09T10:31:48.000-05:00","is_admin":false,"about":"Author of @dhall_lang, haskellforall.com, and countless packages and presentations.\r\n\r\nLeads Haskell+Nix team at @AristaNetworks.\r\n\r\nFP simp (she/they) 🏳️‍⚧","is_moderator":false,"karma":465,"avatar_url":"/avatars/Gabriella439-100.png","invited_by_user":"joepie91","github_username":"Gabriella439"},"user_is_author":true,"tags":["plt"]}]